[Survived] MethodExpression
src/application/analytics/CalculateROIUseCase.ts:66:29
     input: CalculateROIInput
   ): Promise<Result<CalculateROIOutput, UseCaseError>> {
     // Validate account ID
-    if (!input.accountId || input.accountId.trim().length === 0) {
+    if (!input.accountId || input.accountId.length === 0) {
       return err(
         new UseCaseError("Account ID is required", USE_CASE_ERRORS.VALIDATION_FAILED)

[Survived] LogicalOperator
src/application/analytics/CalculateROIUseCase.ts:66:9
     input: CalculateROIInput
   ): Promise<Result<CalculateROIOutput, UseCaseError>> {
     // Validate account ID
-    if (!input.accountId || input.accountId.trim().length === 0) {
+    if (!input.accountId && input.accountId.trim().length === 0) {
       return err(
         new UseCaseError("Account ID is required", USE_CASE_ERRORS.VALIDATION_FAILED)

[Survived] StringLiteral
src/application/analytics/CalculateROIUseCase.ts:73:50
     }
 
     // Validate time range
-    const validTimeRanges = ["7d", "30d", "90d", "1y", "custom"];
+    const validTimeRanges = ["7d", "30d", "90d", "", "custom"];
     if (!validTimeRanges.includes(input.timeRange)) {
       return err(

[NoCoverage] BlockStatement
src/application/analytics/CalculateROIUseCase.ts:74:53
 
     // Validate time range
     const validTimeRanges = ["7d", "30d", "90d", "1y", "custom"];
-    if (!validTimeRanges.includes(input.timeRange)) {
-      return err(
-        new UseCaseError(
-          `Invalid time range. Must be one of: ${validTimeRanges.join(", ")}`,
-          USE_CASE_ERRORS.VALIDATION_FAILED
-        )
-      );
-    }
+    if (!validTimeRanges.includes(input.timeRange)) {}
 
     try {

[Timeout] BooleanLiteral
src/application/analytics/CalculateROIUseCase.ts:74:9
 
     // Validate time range
     const validTimeRanges = ["7d", "30d", "90d", "1y", "custom"];
-    if (!validTimeRanges.includes(input.timeRange)) {
+    if (validTimeRanges.includes(input.timeRange)) {
       return err(
         new UseCaseError(

[NoCoverage] StringLiteral
src/application/analytics/CalculateROIUseCase.ts:77:71
     if (!validTimeRanges.includes(input.timeRange)) {
       return err(
         new UseCaseError(
-          `Invalid time range. Must be one of: ${validTimeRanges.join(", ")}`,
+          `Invalid time range. Must be one of: ${validTimeRanges.join("")}`,
           USE_CASE_ERRORS.VALIDATION_FAILED
         )

[Survived] EqualityOperator
src/application/analytics/CalculateROIUseCase.ts:87:13
       // Calculate overall ROI
       const roiResult = await this.roiCalculator.calculateROI({
         accountId: input.accountId,
-        ...(input.projectId !== undefined && { projectId: input.projectId }),
+        ...(input.projectId === undefined && { projectId: input.projectId }),
         timeRange: input.timeRange,
         ...(input.startDate && { startDate: new Date(input.startDate) }),

[Survived] EqualityOperator
src/application/analytics/CalculateROIUseCase.ts:91:13
         timeRange: input.timeRange,
         ...(input.startDate && { startDate: new Date(input.startDate) }),
         ...(input.endDate && { endDate: new Date(input.endDate) }),
-        ...(input.providers !== undefined && { providers: input.providers }),
+        ...(input.providers === undefined && { providers: input.providers }),
         ...(input.investmentDetails !== undefined && { investmentDetails: input.investmentDetails }),
       });

[Survived] ObjectLiteral
src/application/analytics/CalculateROIUseCase.ts:91:46
         timeRange: input.timeRange,
         ...(input.startDate && { startDate: new Date(input.startDate) }),
         ...(input.endDate && { endDate: new Date(input.endDate) }),
-        ...(input.providers !== undefined && { providers: input.providers }),
+        ...(input.providers !== undefined && {}),
         ...(input.investmentDetails !== undefined && { investmentDetails: input.investmentDetails }),
       });

[Survived] EqualityOperator
src/application/analytics/CalculateROIUseCase.ts:92:13
         ...(input.startDate && { startDate: new Date(input.startDate) }),
         ...(input.endDate && { endDate: new Date(input.endDate) }),
         ...(input.providers !== undefined && { providers: input.providers }),
-        ...(input.investmentDetails !== undefined && { investmentDetails: input.investmentDetails }),
+        ...(input.investmentDetails === undefined && { investmentDetails: input.investmentDetails }),
       });
 

[Survived] BlockStatement
src/application/analytics/CalculateROIUseCase.ts:100:70
       let bestPerformingChannel: ProviderType | undefined;
       let recommendations: string[] | undefined;
 
-      if (input.byChannel && this.roiCalculator.calculateChannelROI) {
-        const channelResult = await this.roiCalculator.calculateChannelROI({
-          accountId: input.accountId,
-          ...(input.projectId !== undefined && { projectId: input.projectId }),
-          timeRange: input.timeRange,
-          ...(input.startDate && { startDate: new Date(input.startDate) }),
-          ...(input.endDate && { endDate: new Date(input.endDate) }),
-        });
-
-        channelBreakdown = channelResult.channels;
-        bestPerformingChannel = channelResult.bestPerforming as ProviderType;
-        recommendations = channelResult.recommendations;
-      }
+      if (input.byChannel && this.roiCalculator.calculateChannelROI) {}
 
       return ok({

[NoCoverage] ObjectLiteral
src/application/analytics/CalculateROIUseCase.ts:103:48
       if (input.byChannel && this.roiCalculator.calculateChannelROI) {
         const channelResult = await this.roiCalculator.calculateChannelROI({
           accountId: input.accountId,
-          ...(input.projectId !== undefined && { projectId: input.projectId }),
+          ...(input.projectId !== undefined && {}),
           timeRange: input.timeRange,
           ...(input.startDate && { startDate: new Date(input.startDate) }),

[NoCoverage] ObjectLiteral
src/application/analytics/CalculateROIUseCase.ts:106:32
           ...(input.projectId !== undefined && { projectId: input.projectId }),
           timeRange: input.timeRange,
           ...(input.startDate && { startDate: new Date(input.startDate) }),
-          ...(input.endDate && { endDate: new Date(input.endDate) }),
+          ...(input.endDate && {}),
         });
 

[Survived] EqualityOperator
src/application/analytics/CalculateROIUseCase.ts:119:13
         totalRevenue: roiResult.totalRevenue,
         roi: roiResult.roi,
         roiPercentage: roiResult.roiPercentage,
-        ...(roiResult.breakdown !== undefined && { breakdown: roiResult.breakdown }),
+        ...(roiResult.breakdown === undefined && { breakdown: roiResult.breakdown }),
         ...(channelBreakdown !== undefined && { channelBreakdown }),
         ...(bestPerformingChannel !== undefined && { bestPerformingChannel }),

[Survived] ObjectLiteral
src/application/analytics/CalculateROIUseCase.ts:121:52
         roiPercentage: roiResult.roiPercentage,
         ...(roiResult.breakdown !== undefined && { breakdown: roiResult.breakdown }),
         ...(channelBreakdown !== undefined && { channelBreakdown }),
-        ...(bestPerformingChannel !== undefined && { bestPerformingChannel }),
+        ...(bestPerformingChannel !== undefined && {}),
         ...(recommendations !== undefined && { recommendations }),
       });

[NoCoverage] StringLiteral
src/application/analytics/CalculateROIUseCase.ts:127:80
     } catch (error) {
       return err(
         new UseCaseError(
-          `Failed to calculate ROI: ${error instanceof Error ? error.message : "Unknown error"}`,
+          `Failed to calculate ROI: ${error instanceof Error ? error.message : ""}`,
           USE_CASE_ERRORS.INTERNAL_ERROR
         )

[NoCoverage] StringLiteral
src/application/analytics/CalculateROIUseCase.ts:127:11
     } catch (error) {
       return err(
         new UseCaseError(
-          `Failed to calculate ROI: ${error instanceof Error ? error.message : "Unknown error"}`,
+          ``,
           USE_CASE_ERRORS.INTERNAL_ERROR
         )
