[Timeout] BlockStatement
src/application/analytics/PredictEngagementUseCase.ts:83:62
     }
 
     // Validate content
-    if (!input.content || input.content.trim().length === 0) {
-      return err(
-        new UseCaseError("Content is required for engagement prediction", USE_CASE_ERRORS.VALIDATION_FAILED)
-      );
-    }
+    if (!input.content || input.content.trim().length === 0) {}
 
     // Validate content type

[Timeout] ConditionalExpression
src/application/analytics/PredictEngagementUseCase.ts:83:9
     }
 
     // Validate content
-    if (!input.content || input.content.trim().length === 0) {
+    if (false) {
       return err(
         new UseCaseError("Content is required for engagement prediction", USE_CASE_ERRORS.VALIDATION_FAILED)

[Killed] StringLiteral
src/application/analytics/PredictEngagementUseCase.ts:90:49
     }
 
     // Validate content type
-    const validContentTypes = ["text", "image", "video", "carousel", "story", "reel"];
+    const validContentTypes = ["text", "image", "", "carousel", "story", "reel"];
     if (!validContentTypes.includes(input.contentType)) {
       return err(
killedBy: tests/unit/application/AnalyticsUseCases.test.ts
statusReason: Analytics Use Cases (TDD) > PredictEngagementUseCase > should predict optimal posting times: should predict optimal posting times

[Timeout] StringLiteral
src/application/analytics/PredictEngagementUseCase.ts:90:40
     }
 
     // Validate content type
-    const validContentTypes = ["text", "image", "video", "carousel", "story", "reel"];
+    const validContentTypes = ["text", "", "video", "carousel", "story", "reel"];
     if (!validContentTypes.includes(input.contentType)) {
       return err(

[Timeout] BooleanLiteral
src/application/analytics/PredictEngagementUseCase.ts:91:9
 
     // Validate content type
     const validContentTypes = ["text", "image", "video", "carousel", "story", "reel"];
-    if (!validContentTypes.includes(input.contentType)) {
+    if (validContentTypes.includes(input.contentType)) {
       return err(
         new UseCaseError(

[Survived] ConditionalExpression
src/application/analytics/PredictEngagementUseCase.ts:91:9
 
     // Validate content type
     const validContentTypes = ["text", "image", "video", "carousel", "story", "reel"];
-    if (!validContentTypes.includes(input.contentType)) {
+    if (false) {
       return err(
         new UseCaseError(

[NoCoverage] StringLiteral
src/application/analytics/PredictEngagementUseCase.ts:94:11
     if (!validContentTypes.includes(input.contentType)) {
       return err(
         new UseCaseError(
-          `Invalid content type. Must be one of: ${validContentTypes.join(", ")}`,
+          ``,
           USE_CASE_ERRORS.VALIDATION_FAILED
         )

[NoCoverage] BlockStatement
src/application/analytics/PredictEngagementUseCase.ts:102:51
 
     // Validate provider
     const validProviders = ["X", "FACEBOOK", "INSTAGRAM", "TIKTOK", "YOUTUBE", "LINKEDIN"];
-    if (!validProviders.includes(input.provider)) {
-      return err(
-        new UseCaseError(
-          `Invalid provider. Must be one of: ${validProviders.join(", ")}`,
-          USE_CASE_ERRORS.VALIDATION_FAILED
-        )
-      );
-    }
+    if (!validProviders.includes(input.provider)) {}
 
     try {

[Timeout] BooleanLiteral
src/application/analytics/PredictEngagementUseCase.ts:102:9
 
     // Validate provider
     const validProviders = ["X", "FACEBOOK", "INSTAGRAM", "TIKTOK", "YOUTUBE", "LINKEDIN"];
-    if (!validProviders.includes(input.provider)) {
+    if (validProviders.includes(input.provider)) {
       return err(
         new UseCaseError(

[NoCoverage] StringLiteral
src/application/analytics/PredictEngagementUseCase.ts:105:68
     if (!validProviders.includes(input.provider)) {
       return err(
         new UseCaseError(
-          `Invalid provider. Must be one of: ${validProviders.join(", ")}`,
+          `Invalid provider. Must be one of: ${validProviders.join("")}`,
           USE_CASE_ERRORS.VALIDATION_FAILED
         )

[Survived] EqualityOperator
src/application/analytics/PredictEngagementUseCase.ts:120:13
         contentType: input.contentType,
         provider: input.provider,
         ...(input.scheduledAt && { scheduledTime: new Date(input.scheduledAt) }),
-        ...(input.hashtags !== undefined && { hashtags: input.hashtags }),
+        ...(input.hashtags === undefined && { hashtags: input.hashtags }),
         ...(input.mediaCount !== undefined && { mediaCount: input.mediaCount }),
         ...(input.mediaTypes !== undefined && { mediaTypes: input.mediaTypes }),

[Survived] EqualityOperator
src/application/analytics/PredictEngagementUseCase.ts:121:13
         provider: input.provider,
         ...(input.scheduledAt && { scheduledTime: new Date(input.scheduledAt) }),
         ...(input.hashtags !== undefined && { hashtags: input.hashtags }),
-        ...(input.mediaCount !== undefined && { mediaCount: input.mediaCount }),
+        ...(input.mediaCount === undefined && { mediaCount: input.mediaCount }),
         ...(input.mediaTypes !== undefined && { mediaTypes: input.mediaTypes }),
         ...(input.targetAudience !== undefined && { targetAudience: input.targetAudience }),

[Survived] EqualityOperator
src/application/analytics/PredictEngagementUseCase.ts:122:13
         ...(input.scheduledAt && { scheduledTime: new Date(input.scheduledAt) }),
         ...(input.hashtags !== undefined && { hashtags: input.hashtags }),
         ...(input.mediaCount !== undefined && { mediaCount: input.mediaCount }),
-        ...(input.mediaTypes !== undefined && { mediaTypes: input.mediaTypes }),
+        ...(input.mediaTypes === undefined && { mediaTypes: input.mediaTypes }),
         ...(input.targetAudience !== undefined && { targetAudience: input.targetAudience }),
         ...(input.includeOptimization !== undefined && { includeOptimization: input.includeOptimization }),

[Survived] EqualityOperator
src/application/analytics/PredictEngagementUseCase.ts:123:13
         ...(input.hashtags !== undefined && { hashtags: input.hashtags }),
         ...(input.mediaCount !== undefined && { mediaCount: input.mediaCount }),
         ...(input.mediaTypes !== undefined && { mediaTypes: input.mediaTypes }),
-        ...(input.targetAudience !== undefined && { targetAudience: input.targetAudience }),
+        ...(input.targetAudience === undefined && { targetAudience: input.targetAudience }),
         ...(input.includeOptimization !== undefined && { includeOptimization: input.includeOptimization }),
       });

[Survived] EqualityOperator
src/application/analytics/PredictEngagementUseCase.ts:124:13
         ...(input.mediaCount !== undefined && { mediaCount: input.mediaCount }),
         ...(input.mediaTypes !== undefined && { mediaTypes: input.mediaTypes }),
         ...(input.targetAudience !== undefined && { targetAudience: input.targetAudience }),
-        ...(input.includeOptimization !== undefined && { includeOptimization: input.includeOptimization }),
+        ...(input.includeOptimization === undefined && { includeOptimization: input.includeOptimization }),
       });
 

[Survived] BlockStatement
src/application/analytics/PredictEngagementUseCase.ts:129:88
 
       // Get optimal timing if requested
       let optimalTiming: TimingPrediction | undefined;
-      if (input.predictOptimalTiming && this.engagementPredictor.predictOptimalTiming) {
-        const timingPrediction = await this.engagementPredictor.predictOptimalTiming({
-          accountId: input.accountId,
-          provider: input.provider,
-          contentType: input.contentType,
-        });
-        optimalTiming = {
-          optimalSlots: timingPrediction.optimalSlots,
-          recommendations: timingPrediction.recommendations,
-        };
-      }
+      if (input.predictOptimalTiming && this.engagementPredictor.predictOptimalTiming) {}
 
       return ok({

[Survived] EqualityOperator
src/application/analytics/PredictEngagementUseCase.ts:146:13
         predictedLikes: prediction.predictedLikes,
         predictedComments: prediction.predictedComments,
         predictedShares: prediction.predictedShares,
-        ...(prediction.predictedReach !== undefined && { predictedReach: prediction.predictedReach }),
+        ...(prediction.predictedReach === undefined && { predictedReach: prediction.predictedReach }),
         confidence: prediction.confidence,
         ...(prediction.factors !== undefined && { factors: prediction.factors }),

[NoCoverage] ObjectLiteral
src/application/analytics/PredictEngagementUseCase.ts:146:56
         predictedLikes: prediction.predictedLikes,
         predictedComments: prediction.predictedComments,
         predictedShares: prediction.predictedShares,
-        ...(prediction.predictedReach !== undefined && { predictedReach: prediction.predictedReach }),
+        ...(prediction.predictedReach !== undefined && {}),
         confidence: prediction.confidence,
         ...(prediction.factors !== undefined && { factors: prediction.factors }),

[Survived] EqualityOperator
src/application/analytics/PredictEngagementUseCase.ts:148:13
         predictedShares: prediction.predictedShares,
         ...(prediction.predictedReach !== undefined && { predictedReach: prediction.predictedReach }),
         confidence: prediction.confidence,
-        ...(prediction.factors !== undefined && { factors: prediction.factors }),
+        ...(prediction.factors === undefined && { factors: prediction.factors }),
         ...(prediction.recommendations !== undefined && { recommendations: prediction.recommendations }),
         ...(optimalTiming !== undefined && { optimalTiming }),

[Survived] ObjectLiteral
src/application/analytics/PredictEngagementUseCase.ts:148:49
         predictedShares: prediction.predictedShares,
         ...(prediction.predictedReach !== undefined && { predictedReach: prediction.predictedReach }),
         confidence: prediction.confidence,
-        ...(prediction.factors !== undefined && { factors: prediction.factors }),
+        ...(prediction.factors !== undefined && {}),
         ...(prediction.recommendations !== undefined && { recommendations: prediction.recommendations }),
         ...(optimalTiming !== undefined && { optimalTiming }),

[Killed] EqualityOperator
src/application/analytics/PredictEngagementUseCase.ts:149:13
         ...(prediction.predictedReach !== undefined && { predictedReach: prediction.predictedReach }),
         confidence: prediction.confidence,
         ...(prediction.factors !== undefined && { factors: prediction.factors }),
-        ...(prediction.recommendations !== undefined && { recommendations: prediction.recommendations }),
+        ...(prediction.recommendations === undefined && { recommendations: prediction.recommendations }),
         ...(optimalTiming !== undefined && { optimalTiming }),
       });
killedBy: tests/unit/application/AnalyticsUseCases.test.ts
statusReason: Analytics Use Cases (TDD) > PredictEngagementUseCase > should include optimization suggestions when requested: should include optimization suggestions when requested
