[Killed] StringLiteral
src/application/apiKeys/ApiKeyUseCases.ts:29:23
 const BCRYPT_ROUNDS = 10;
 const PREFIX_LENGTH = 8; // bytes → 16 hex chars
 const KEY_SECRET_LENGTH = 32; // bytes → 64 hex chars
-const PREFIX_HEADER = "op"; // "OmniPost"
+const PREFIX_HEADER = ""; // "OmniPost"
 
 // ─── Helpers ───────────────────────────────────────────────────────────────
killedBy: tests/unit/application/ApiKeyUseCases.test.ts
statusReason: CreateApiKeyUseCase > creates key with default permissions and rateLimit: creates key with default permissions and rateLimit

[Killed] StringLiteral
src/application/apiKeys/ApiKeyUseCases.ts:46:18
 }> {
   const prefixBytes = randomBytes(PREFIX_LENGTH).toString("hex");
   const secretBytes = randomBytes(KEY_SECRET_LENGTH).toString("hex");
-  const prefix = `${PREFIX_HEADER}_${prefixBytes}`;
+  const prefix = ``;
   const rawKey = `${prefix}_${secretBytes}`;
   const keyHash = await bcrypt.hash(rawKey, BCRYPT_ROUNDS);
killedBy: tests/unit/application/ApiKeyUseCases.test.ts
statusReason: CreateApiKeyUseCase > creates key with default permissions and rateLimit: creates key with default permissions and rateLimit

[Killed] StringLiteral
src/application/apiKeys/ApiKeyUseCases.ts:47:18
   const prefixBytes = randomBytes(PREFIX_LENGTH).toString("hex");
   const secretBytes = randomBytes(KEY_SECRET_LENGTH).toString("hex");
   const prefix = `${PREFIX_HEADER}_${prefixBytes}`;
-  const rawKey = `${prefix}_${secretBytes}`;
+  const rawKey = ``;
   const keyHash = await bcrypt.hash(rawKey, BCRYPT_ROUNDS);
   return { rawKey, prefix, keyHash };
killedBy: tests/unit/application/ApiKeyUseCases.test.ts
statusReason: CreateApiKeyUseCase > creates key with default permissions and rateLimit: creates key with default permissions and rateLimit

[Killed] StringLiteral
src/application/apiKeys/ApiKeyUseCases.ts:58:30
  */
 function extractPrefix(rawKey: string): string | null {
   // Key format: "op_{8-byte-hex}_{32-byte-hex}"
-  const parts = rawKey.split("_");
+  const parts = rawKey.split("");
   // "op", "prefixHex", "secretHex"
   if (parts.length < 2 || parts[0] !== PREFIX_HEADER) return null;
killedBy: tests/unit/application/ApiKeyUseCases.test.ts
statusReason: ValidateApiKeyUseCase > returns UNAUTHORIZED when key is expired: returns UNAUTHORIZED when key is expired

[Killed] ConditionalExpression
src/application/apiKeys/ApiKeyUseCases.ts:60:7
   // Key format: "op_{8-byte-hex}_{32-byte-hex}"
   const parts = rawKey.split("_");
   // "op", "prefixHex", "secretHex"
-  if (parts.length < 2 || parts[0] !== PREFIX_HEADER) return null;
+  if (true) return null;
   return `${PREFIX_HEADER}_${parts[1] ?? ""}`;
 }
killedBy: tests/unit/application/ApiKeyUseCases.test.ts
statusReason: ValidateApiKeyUseCase > returns UNAUTHORIZED when key is expired: returns UNAUTHORIZED when key is expired

[Killed] EqualityOperator
src/application/apiKeys/ApiKeyUseCases.ts:60:27
   // Key format: "op_{8-byte-hex}_{32-byte-hex}"
   const parts = rawKey.split("_");
   // "op", "prefixHex", "secretHex"
-  if (parts.length < 2 || parts[0] !== PREFIX_HEADER) return null;
+  if (parts.length < 2 || parts[0] === PREFIX_HEADER) return null;
   return `${PREFIX_HEADER}_${parts[1] ?? ""}`;
 }
killedBy: tests/unit/application/ApiKeyUseCases.test.ts
statusReason: ValidateApiKeyUseCase > returns UNAUTHORIZED when key is expired: returns UNAUTHORIZED when key is expired

[Survived] LogicalOperator
src/application/apiKeys/ApiKeyUseCases.ts:61:30
   const parts = rawKey.split("_");
   // "op", "prefixHex", "secretHex"
   if (parts.length < 2 || parts[0] !== PREFIX_HEADER) return null;
-  return `${PREFIX_HEADER}_${parts[1] ?? ""}`;
+  return `${PREFIX_HEADER}_${parts[1] && ""}`;
 }
 

[Timeout] ConditionalExpression
src/application/apiKeys/ApiKeyUseCases.ts:108:11
 
   async execute(input: CreateApiKeyInput): Promise<Result<CreateApiKeyOutput, UseCaseError>> {
     try {
-      if (!input.name.trim()) {
+      if (false) {
         return err(new UseCaseError("API key name is required", USE_CASE_ERRORS.VALIDATION_FAILED));
       }

[Timeout] BlockStatement
src/application/apiKeys/ApiKeyUseCases.ts:108:31
 
   async execute(input: CreateApiKeyInput): Promise<Result<CreateApiKeyOutput, UseCaseError>> {
     try {
-      if (!input.name.trim()) {
-        return err(new UseCaseError("API key name is required", USE_CASE_ERRORS.VALIDATION_FAILED));
-      }
+      if (!input.name.trim()) {}
 
       if (input.name.length > 100) {

[Killed] StringLiteral
src/application/apiKeys/ApiKeyUseCases.ts:109:37
   async execute(input: CreateApiKeyInput): Promise<Result<CreateApiKeyOutput, UseCaseError>> {
     try {
       if (!input.name.trim()) {
-        return err(new UseCaseError("API key name is required", USE_CASE_ERRORS.VALIDATION_FAILED));
+        return err(new UseCaseError("", USE_CASE_ERRORS.VALIDATION_FAILED));
       }
 
killedBy: tests/unit/application/ApiKeyUseCases.test.ts
statusReason: CreateApiKeyUseCase > returns validation error when name is empty: returns validation error when name is empty

[Killed] EqualityOperator
src/application/apiKeys/ApiKeyUseCases.ts:112:11
         return err(new UseCaseError("API key name is required", USE_CASE_ERRORS.VALIDATION_FAILED));
       }
 
-      if (input.name.length > 100) {
+      if (input.name.length <= 100) {
         return err(
           new UseCaseError("API key name must be ≤ 100 characters", USE_CASE_ERRORS.VALIDATION_FAILED)
killedBy: tests/unit/application/ApiKeyUseCases.test.ts
statusReason: CreateApiKeyUseCase > creates key with default permissions and rateLimit: creates key with default permissions and rateLimit

[Timeout] ConditionalExpression
src/application/apiKeys/ApiKeyUseCases.ts:112:11
         return err(new UseCaseError("API key name is required", USE_CASE_ERRORS.VALIDATION_FAILED));
       }
 
-      if (input.name.length > 100) {
+      if (false) {
         return err(
           new UseCaseError("API key name must be ≤ 100 characters", USE_CASE_ERRORS.VALIDATION_FAILED)

[Killed] StringLiteral
src/application/apiKeys/ApiKeyUseCases.ts:114:28
 
       if (input.name.length > 100) {
         return err(
-          new UseCaseError("API key name must be ≤ 100 characters", USE_CASE_ERRORS.VALIDATION_FAILED)
+          new UseCaseError("", USE_CASE_ERRORS.VALIDATION_FAILED)
         );
       }
killedBy: tests/unit/application/ApiKeyUseCases.test.ts
statusReason: CreateApiKeyUseCase > returns validation error when name exceeds 100 chars: returns validation error when name exceeds 100 chars

[Killed] ConditionalExpression
src/application/apiKeys/ApiKeyUseCases.ts:121:11
       const permissions = input.permissions ?? ["read"];
       const rateLimit = input.rateLimit ?? 1000;
 
-      if (rateLimit < 1 || rateLimit > 100_000) {
+      if (false) {
         return err(
           new UseCaseError("Rate limit must be between 1 and 100,000 req/min", USE_CASE_ERRORS.VALIDATION_FAILED)
killedBy: tests/unit/application/ApiKeyUseCases.test.ts
statusReason: CreateApiKeyUseCase > returns validation error when rateLimit is out of range: returns validation error when rateLimit is out of range

[Killed] ConditionalExpression
src/application/apiKeys/ApiKeyUseCases.ts:121:11
       const permissions = input.permissions ?? ["read"];
       const rateLimit = input.rateLimit ?? 1000;
 
-      if (rateLimit < 1 || rateLimit > 100_000) {
+      if (false || rateLimit > 100_000) {
         return err(
           new UseCaseError("Rate limit must be between 1 and 100,000 req/min", USE_CASE_ERRORS.VALIDATION_FAILED)
killedBy: tests/unit/application/ApiKeyUseCases.test.ts
statusReason: CreateApiKeyUseCase > returns validation error when rateLimit is out of range: returns validation error when rateLimit is out of range

[Killed] StringLiteral
src/application/apiKeys/ApiKeyUseCases.ts:123:28
 
       if (rateLimit < 1 || rateLimit > 100_000) {
         return err(
-          new UseCaseError("Rate limit must be between 1 and 100,000 req/min", USE_CASE_ERRORS.VALIDATION_FAILED)
+          new UseCaseError("", USE_CASE_ERRORS.VALIDATION_FAILED)
         );
       }
killedBy: tests/unit/application/ApiKeyUseCases.test.ts
statusReason: CreateApiKeyUseCase > returns validation error when rateLimit is out of range: returns validation error when rateLimit is out of range

[Killed] ConditionalExpression
src/application/apiKeys/ApiKeyUseCases.ts:127:11
         );
       }
 
-      if (input.expiresAt && input.expiresAt <= new Date()) {
+      if (true) {
         return err(
           new UseCaseError("Expiration date must be in the future", USE_CASE_ERRORS.VALIDATION_FAILED)
killedBy: tests/unit/application/ApiKeyUseCases.test.ts
statusReason: CreateApiKeyUseCase > creates key with default permissions and rateLimit: creates key with default permissions and rateLimit

[Survived] EqualityOperator
src/application/apiKeys/ApiKeyUseCases.ts:127:30
         );
       }
 
-      if (input.expiresAt && input.expiresAt <= new Date()) {
+      if (input.expiresAt && input.expiresAt < new Date()) {
         return err(
           new UseCaseError("Expiration date must be in the future", USE_CASE_ERRORS.VALIDATION_FAILED)

[Survived] MethodExpression
src/application/apiKeys/ApiKeyUseCases.ts:137:15
 
       const key = await this.repo.create({
         accountId: input.accountId,
-        name: input.name.trim(),
+        name: input.name,
         prefix,
         keyHash,

[Survived] EqualityOperator
src/application/apiKeys/ApiKeyUseCases.ts:142:13
         keyHash,
         permissions,
         rateLimit,
-        ...(input.expiresAt !== undefined && { expiresAt: input.expiresAt }),
+        ...(input.expiresAt === undefined && { expiresAt: input.expiresAt }),
         ...(input.rotationSchedule !== undefined && { rotationSchedule: input.rotationSchedule }),
       });

[NoCoverage] ObjectLiteral
src/application/apiKeys/ApiKeyUseCases.ts:142:46
         keyHash,
         permissions,
         rateLimit,
-        ...(input.expiresAt !== undefined && { expiresAt: input.expiresAt }),
+        ...(input.expiresAt !== undefined && {}),
         ...(input.rotationSchedule !== undefined && { rotationSchedule: input.rotationSchedule }),
       });

[Survived] EqualityOperator
src/application/apiKeys/ApiKeyUseCases.ts:143:13
         permissions,
         rateLimit,
         ...(input.expiresAt !== undefined && { expiresAt: input.expiresAt }),
-        ...(input.rotationSchedule !== undefined && { rotationSchedule: input.rotationSchedule }),
+        ...(input.rotationSchedule === undefined && { rotationSchedule: input.rotationSchedule }),
       });
 

[NoCoverage] ObjectLiteral
src/application/apiKeys/ApiKeyUseCases.ts:143:53
         permissions,
         rateLimit,
         ...(input.expiresAt !== undefined && { expiresAt: input.expiresAt }),
-        ...(input.rotationSchedule !== undefined && { rotationSchedule: input.rotationSchedule }),
+        ...(input.rotationSchedule !== undefined && {}),
       });
 

[Killed] StringLiteral
src/application/apiKeys/ApiKeyUseCases.ts:182:37
 
       const key = await this.repo.findActiveByPrefix(prefix);
       if (!key) {
-        return err(new UseCaseError("Invalid or inactive API key", USE_CASE_ERRORS.UNAUTHORIZED));
+        return err(new UseCaseError("", USE_CASE_ERRORS.UNAUTHORIZED));
       }
 
killedBy: tests/unit/application/ApiKeyUseCases.test.ts
statusReason: ValidateApiKeyUseCase > returns UNAUTHORIZED when prefix not found in repo: returns UNAUTHORIZED when prefix not found in repo

[Killed] EqualityOperator
src/application/apiKeys/ApiKeyUseCases.ts:186:42
       }
 
       // Check expiration
-      if (key.expiresAt !== undefined && key.expiresAt <= new Date()) {
+      if (key.expiresAt !== undefined && key.expiresAt > new Date()) {
         return err(new UseCaseError("API key has expired", USE_CASE_ERRORS.UNAUTHORIZED));
       }
killedBy: tests/unit/application/ApiKeyUseCases.test.ts
statusReason: ValidateApiKeyUseCase > returns UNAUTHORIZED when key is expired: returns UNAUTHORIZED when key is expired

[Killed] BlockStatement
src/application/apiKeys/ApiKeyUseCases.ts:186:71
       }
 
       // Check expiration
-      if (key.expiresAt !== undefined && key.expiresAt <= new Date()) {
-        return err(new UseCaseError("API key has expired", USE_CASE_ERRORS.UNAUTHORIZED));
-      }
+      if (key.expiresAt !== undefined && key.expiresAt <= new Date()) {}
 
       // Verify bcrypt hash (expensive — do last)
killedBy: tests/unit/application/ApiKeyUseCases.test.ts
statusReason: ValidateApiKeyUseCase > returns UNAUTHORIZED when key is expired: returns UNAUTHORIZED when key is expired

[NoCoverage] BlockStatement
src/application/apiKeys/ApiKeyUseCases.ts:192:19
 
       // Verify bcrypt hash (expensive — do last)
       const valid = await bcrypt.compare(input.rawKey, key.keyHash);
-      if (!valid) {
-        return err(new UseCaseError("Invalid API key", USE_CASE_ERRORS.UNAUTHORIZED));
-      }
+      if (!valid) {}
 
       // Fire-and-forget usage recording (non-critical)

[NoCoverage] BooleanLiteral
src/application/apiKeys/ApiKeyUseCases.ts:192:11
 
       // Verify bcrypt hash (expensive — do last)
       const valid = await bcrypt.compare(input.rawKey, key.keyHash);
-      if (!valid) {
+      if (valid) {
         return err(new UseCaseError("Invalid API key", USE_CASE_ERRORS.UNAUTHORIZED));
       }

[Killed] BlockStatement
src/application/apiKeys/ApiKeyUseCases.ts:287:23
   async execute(id: string): Promise<Result<void, UseCaseError | ApiKeyNotFoundError>> {
     try {
       const result = await this.repo.deactivate(id);
-      if (!result.ok) {
-        return err(result.error);
-      }
+      if (!result.ok) {}
       return ok(undefined);
     } catch (error) {
killedBy: tests/unit/application/ApiKeyUseCases.test.ts
statusReason: DeactivateApiKeyUseCase > propagates ApiKeyNotFoundError from repo: propagates ApiKeyNotFoundError from repo

[Survived] StringLiteral
src/application/apiKeys/ApiKeyUseCases.ts:294:11
     } catch (error) {
       return err(
         new UseCaseError(
-          "Failed to deactivate API key",
+          "",
           USE_CASE_ERRORS.INTERNAL_ERROR,
           error instanceof Error ? error : new Error(String(error))
