[Killed] ConditionalExpression
src/application/crisis/EnterCrisisModeUseCase.ts:63:9
 
     // Enter crisis mode
     const entered = project.enterCrisisMode(input.reason);
-    if (!entered) {
+    if (false) {
       return err(
         new UseCaseError(
killedBy: tests/unit/application/crisis/crisisUseCases.test.ts
statusReason: EnterCrisisModeUseCase > should fail if already in crisis mode: should fail if already in crisis mode

[Killed] BlockStatement
src/application/crisis/EnterCrisisModeUseCase.ts:63:19
 
     // Enter crisis mode
     const entered = project.enterCrisisMode(input.reason);
-    if (!entered) {
-      return err(
-        new UseCaseError(
-          "Project is already in crisis mode",
-          USE_CASE_ERRORS.CONFLICT
-        )
-      );
-    }
+    if (!entered) {}
 
     // Save the project
killedBy: tests/unit/application/crisis/crisisUseCases.test.ts
statusReason: EnterCrisisModeUseCase > should fail if already in crisis mode: should fail if already in crisis mode

[NoCoverage] BlockStatement
src/application/crisis/EnterCrisisModeUseCase.ts:74:25
 
     // Save the project
     const saveResult = await this.projectRepository.save(project);
-    if (!saveResult.ok) {
-      return err(
-        new UseCaseError(
-          "Failed to save project",
-          USE_CASE_ERRORS.INTERNAL_ERROR,
-          saveResult.error
-        )
-      );
-    }
+    if (!saveResult.ok) {}
 
     // Dispatch domain events

[NoCoverage] StringLiteral
src/application/crisis/EnterCrisisModeUseCase.ts:77:11
     if (!saveResult.ok) {
       return err(
         new UseCaseError(
-          "Failed to save project",
+          "",
           USE_CASE_ERRORS.INTERNAL_ERROR,
           saveResult.error

[Killed] ConditionalExpression
src/application/crisis/EnterCrisisModeUseCase.ts:86:9
 
     // Dispatch domain events
     const events = project.domainEvents;
-    if (events.length > 0) {
+    if (false) {
       await this.eventDispatcher.dispatchAll([...events]);
       project.clearDomainEvents();
killedBy: tests/unit/application/crisis/crisisUseCases.test.ts
statusReason: EnterCrisisModeUseCase > should enter crisis mode successfully: should enter crisis mode successfully

[Killed] BlockStatement
src/application/crisis/EnterCrisisModeUseCase.ts:86:28
 
     // Dispatch domain events
     const events = project.domainEvents;
-    if (events.length > 0) {
-      await this.eventDispatcher.dispatchAll([...events]);
-      project.clearDomainEvents();
-    }
+    if (events.length > 0) {}
 
     // Return output
killedBy: tests/unit/application/crisis/crisisUseCases.test.ts
statusReason: EnterCrisisModeUseCase > should enter crisis mode successfully: should enter crisis mode successfully

[Killed] BooleanLiteral
src/application/crisis/EnterCrisisModeUseCase.ts:94:23
     // Return output
     return ok({
       projectId: project.id.value,
-      isInCrisisMode: true,
+      isInCrisisMode: false,
       reason: input.reason,
       startedAt: project.crisisStartedAt!,
killedBy: tests/unit/application/crisis/crisisUseCases.test.ts
statusReason: EnterCrisisModeUseCase > should enter crisis mode successfully: should enter crisis mode successfully
