[NoCoverage] StringLiteral
src/application/crisis/GetCrisisStatusUseCase.ts:46:11
     if (!findResult.ok) {
       return err(
         new UseCaseError(
-          `Project not found: ${input.projectId}`,
+          ``,
           USE_CASE_ERRORS.NOT_FOUND,
           findResult.error
