[Timeout] EqualityOperator
src/application/events/DispatchQueryUseCase.ts:51:29
     input: DispatchQueryInput
   ): Promise<Result<DispatchQueryOutput, UseCaseError>> {
     // Validate query type
-    if (!input.queryType || input.queryType.trim().length === 0) {
+    if (!input.queryType || input.queryType.trim().length !== 0) {
       return err(
         new UseCaseError("Query type is required", USE_CASE_ERRORS.VALIDATION_FAILED)

[Timeout] BooleanLiteral
src/application/events/DispatchQueryUseCase.ts:51:9
     input: DispatchQueryInput
   ): Promise<Result<DispatchQueryOutput, UseCaseError>> {
     // Validate query type
-    if (!input.queryType || input.queryType.trim().length === 0) {
+    if (input.queryType || input.queryType.trim().length === 0) {
       return err(
         new UseCaseError("Query type is required", USE_CASE_ERRORS.VALIDATION_FAILED)

[Survived] ConditionalExpression
src/application/events/DispatchQueryUseCase.ts:62:11
     try {
       // Build cache key if caching is enabled
       let cacheKey: string | undefined;
-      if (input.enableCache) {
+      if (false) {
         cacheKey = input.cacheKey ?? this.generateCacheKey(input.queryType, input.payload);
       }

[Survived] ConditionalExpression
src/application/events/DispatchQueryUseCase.ts:62:11
     try {
       // Build cache key if caching is enabled
       let cacheKey: string | undefined;
-      if (input.enableCache) {
+      if (true) {
         cacheKey = input.cacheKey ?? this.generateCacheKey(input.queryType, input.payload);
       }

[Survived] LogicalOperator
src/application/events/DispatchQueryUseCase.ts:63:20
       // Build cache key if caching is enabled
       let cacheKey: string | undefined;
       if (input.enableCache) {
-        cacheKey = input.cacheKey ?? this.generateCacheKey(input.queryType, input.payload);
+        cacheKey = input.cacheKey && this.generateCacheKey(input.queryType, input.payload);
       }
 

[Survived] ObjectLiteral
src/application/events/DispatchQueryUseCase.ts:71:19
         type: input.queryType,
         id: queryId,
         payload: input.payload,
-        metadata: {
-          timestamp: new Date().toISOString(),
-          ...(cacheKey && { cacheKey }),
-          ...(input.cacheTtl && { cacheTtl: input.cacheTtl }),
-        },
+        metadata: {},
       };
 

[Survived] ObjectLiteral
src/application/events/DispatchQueryUseCase.ts:73:27
         payload: input.payload,
         metadata: {
           timestamp: new Date().toISOString(),
-          ...(cacheKey && { cacheKey }),
+          ...(cacheKey && {}),
           ...(input.cacheTtl && { cacheTtl: input.cacheTtl }),
         },

[NoCoverage] ObjectLiteral
src/application/events/DispatchQueryUseCase.ts:74:33
         metadata: {
           timestamp: new Date().toISOString(),
           ...(cacheKey && { cacheKey }),
-          ...(input.cacheTtl && { cacheTtl: input.cacheTtl }),
+          ...(input.cacheTtl && {}),
         },
       };

[Killed] ObjectLiteral
src/application/events/DispatchQueryUseCase.ts:87:53
         ...(result.metadata?.executionTime !== undefined && { executionTime: result.metadata.executionTime }),
         ...(result.metadata?.totalCount !== undefined && { totalCount: result.metadata.totalCount }),
         ...(result.metadata?.page !== undefined && { page: result.metadata.page }),
-        ...(result.metadata?.limit !== undefined && { limit: result.metadata.limit }),
+        ...(result.metadata?.limit !== undefined && {}),
       };
 
killedBy: tests/unit/application/EventCQRSUseCases.test.ts
statusReason: Event/CQRS/Saga Use Cases (TDD) > DispatchQueryUseCase > should support pagination in queries: should support pagination in queries

[Killed] ObjectLiteral
src/application/events/DispatchQueryUseCase.ts:94:57
         success: result.success,
         ...(result.data !== undefined && { data: result.data }),
         ...(result.error !== undefined && { error: result.error }),
-        ...(result.metadata?.fromCache !== undefined && { fromCache: result.metadata.fromCache }),
+        ...(result.metadata?.fromCache !== undefined && {}),
         ...(Object.keys(metadata).length > 0 && { metadata }),
       });
killedBy: tests/unit/application/EventCQRSUseCases.test.ts
statusReason: Event/CQRS/Saga Use Cases (TDD) > DispatchQueryUseCase > should return cached result when available: should return cached result when available

[Killed] EqualityOperator
src/application/events/DispatchQueryUseCase.ts:95:13
         ...(result.data !== undefined && { data: result.data }),
         ...(result.error !== undefined && { error: result.error }),
         ...(result.metadata?.fromCache !== undefined && { fromCache: result.metadata.fromCache }),
-        ...(Object.keys(metadata).length > 0 && { metadata }),
+        ...(Object.keys(metadata).length <= 0 && { metadata }),
       });
     } catch (error) {
killedBy: tests/unit/application/EventCQRSUseCases.test.ts
statusReason: Event/CQRS/Saga Use Cases (TDD) > DispatchQueryUseCase > should support pagination in queries: should support pagination in queries

[Survived] ConditionalExpression
src/application/events/DispatchQueryUseCase.ts:95:13
         ...(result.data !== undefined && { data: result.data }),
         ...(result.error !== undefined && { error: result.error }),
         ...(result.metadata?.fromCache !== undefined && { fromCache: result.metadata.fromCache }),
-        ...(Object.keys(metadata).length > 0 && { metadata }),
+        ...(true && { metadata }),
       });
     } catch (error) {

[Survived] MethodExpression
src/application/events/DispatchQueryUseCase.ts:112:28
    */
   private generateCacheKey(queryType: string, payload: Record<string, unknown>): string {
     const payloadHash = JSON.stringify(payload);
-    return `${queryType}:${Buffer.from(payloadHash).toString("base64").slice(0, 32)}`;
+    return `${queryType}:${Buffer.from(payloadHash).toString("base64")}`;
   }
 }

[Survived] StringLiteral
src/application/events/DispatchQueryUseCase.ts:112:12
    */
   private generateCacheKey(queryType: string, payload: Record<string, unknown>): string {
     const payloadHash = JSON.stringify(payload);
-    return `${queryType}:${Buffer.from(payloadHash).toString("base64").slice(0, 32)}`;
+    return ``;
   }
 }
