[Killed] BlockStatement
src/application/events/PublishDomainEventUseCase.ts:37:66
     input: PublishEventInput
   ): Promise<Result<PublishEventOutput, UseCaseError>> {
     // Validate event type
-    if (!input.eventType || input.eventType.trim().length === 0) {
-      return err(
-        new UseCaseError("Event type is required", USE_CASE_ERRORS.VALIDATION_FAILED)
-      );
-    }
+    if (!input.eventType || input.eventType.trim().length === 0) {}
 
     // Validate aggregate ID
killedBy: tests/unit/application/EventCQRSUseCases.test.ts
statusReason: Event/CQRS/Saga Use Cases (TDD) > PublishDomainEventUseCase > should reject empty event type: should reject empty event type

[Killed] ConditionalExpression
src/application/events/PublishDomainEventUseCase.ts:37:9
     input: PublishEventInput
   ): Promise<Result<PublishEventOutput, UseCaseError>> {
     // Validate event type
-    if (!input.eventType || input.eventType.trim().length === 0) {
+    if (false) {
       return err(
         new UseCaseError("Event type is required", USE_CASE_ERRORS.VALIDATION_FAILED)
killedBy: tests/unit/application/EventCQRSUseCases.test.ts
statusReason: Event/CQRS/Saga Use Cases (TDD) > PublishDomainEventUseCase > should reject empty event type: should reject empty event type

[Survived] ConditionalExpression
src/application/events/PublishDomainEventUseCase.ts:44:31
     }
 
     // Validate aggregate ID
-    if (!input.aggregateId || input.aggregateId.trim().length === 0) {
+    if (!input.aggregateId || false) {
       return err(
         new UseCaseError("Aggregate ID is required", USE_CASE_ERRORS.VALIDATION_FAILED)

[Timeout] BlockStatement
src/application/events/PublishDomainEventUseCase.ts:44:70
     }
 
     // Validate aggregate ID
-    if (!input.aggregateId || input.aggregateId.trim().length === 0) {
-      return err(
-        new UseCaseError("Aggregate ID is required", USE_CASE_ERRORS.VALIDATION_FAILED)
-      );
-    }
+    if (!input.aggregateId || input.aggregateId.trim().length === 0) {}
 
     // Validate aggregate type

[Survived] MethodExpression
src/application/events/PublishDomainEventUseCase.ts:51:33
     }
 
     // Validate aggregate type
-    if (!input.aggregateType || input.aggregateType.trim().length === 0) {
+    if (!input.aggregateType || input.aggregateType.length === 0) {
       return err(
         new UseCaseError("Aggregate type is required", USE_CASE_ERRORS.VALIDATION_FAILED)

[Survived] ConditionalExpression
src/application/events/PublishDomainEventUseCase.ts:51:33
     }
 
     // Validate aggregate type
-    if (!input.aggregateType || input.aggregateType.trim().length === 0) {
+    if (!input.aggregateType || false) {
       return err(
         new UseCaseError("Aggregate type is required", USE_CASE_ERRORS.VALIDATION_FAILED)

[NoCoverage] StringLiteral
src/application/events/PublishDomainEventUseCase.ts:53:26
     // Validate aggregate type
     if (!input.aggregateType || input.aggregateType.trim().length === 0) {
       return err(
-        new UseCaseError("Aggregate type is required", USE_CASE_ERRORS.VALIDATION_FAILED)
+        new UseCaseError("", USE_CASE_ERRORS.VALIDATION_FAILED)
       );
     }

[Killed] LogicalOperator
src/application/events/PublishDomainEventUseCase.ts:58:29
     }
 
     try {
-      const correlationId = input.metadata?.correlationId ?? crypto.randomUUID();
+      const correlationId = input.metadata?.correlationId && crypto.randomUUID();
       const timestamp = new Date();
 
killedBy: tests/unit/application/EventCQRSUseCases.test.ts
statusReason: Event/CQRS/Saga Use Cases (TDD) > PublishDomainEventUseCase > should include correlation ID when provided: should include correlation ID when provided

[Killed] EqualityOperator
src/application/events/PublishDomainEventUseCase.ts:76:26
       );
 
       // If batch events are provided, publish all together
-      if (input.batch && input.batch.length > 0) {
+      if (input.batch && input.batch.length <= 0) {
         const allEvents = [mainEvent];
 
killedBy: tests/unit/application/EventCQRSUseCases.test.ts
statusReason: Event/CQRS/Saga Use Cases (TDD) > PublishDomainEventUseCase > should publish multiple events in batch: should publish multiple events in batch

[Survived] ConditionalExpression
src/application/events/PublishDomainEventUseCase.ts:76:26
       );
 
       // If batch events are provided, publish all together
-      if (input.batch && input.batch.length > 0) {
+      if (input.batch && true) {
         const allEvents = [mainEvent];
 

[Killed] ArrayDeclaration
src/application/events/PublishDomainEventUseCase.ts:77:27
 
       // If batch events are provided, publish all together
       if (input.batch && input.batch.length > 0) {
-        const allEvents = [mainEvent];
+        const allEvents = [];
 
         for (const batchItem of input.batch) {
killedBy: tests/unit/application/EventCQRSUseCases.test.ts
statusReason: Event/CQRS/Saga Use Cases (TDD) > PublishDomainEventUseCase > should publish multiple events in batch: should publish multiple events in batch

[Killed] BlockStatement
src/application/events/PublishDomainEventUseCase.ts:79:46
       if (input.batch && input.batch.length > 0) {
         const allEvents = [mainEvent];
 
-        for (const batchItem of input.batch) {
-          const batchEvent = createDomainEvent(
-            batchItem.eventType,
-            batchItem.aggregateId,
-            batchItem.aggregateType,
-            batchItem.data,
-            {
-              source: batchItem.metadata?.source ?? input.metadata?.source ?? "Application",
-              correlationId,
-              ...(batchItem.metadata?.userId && { userId: batchItem.metadata.userId }),
-            }
-          );
-          allEvents.push(batchEvent);
-        }
+        for (const batchItem of input.batch) {}
 
         const batchResult = await this.eventService.publishEvents(allEvents);
killedBy: tests/unit/application/EventCQRSUseCases.test.ts
statusReason: Event/CQRS/Saga Use Cases (TDD) > PublishDomainEventUseCase > should publish multiple events in batch: should publish multiple events in batch

[NoCoverage] ObjectLiteral
src/application/events/PublishDomainEventUseCase.ts:88:49
             {
               source: batchItem.metadata?.source ?? input.metadata?.source ?? "Application",
               correlationId,
-              ...(batchItem.metadata?.userId && { userId: batchItem.metadata.userId }),
+              ...(batchItem.metadata?.userId && {}),
             }
           );

[NoCoverage] BlockStatement
src/application/events/PublishDomainEventUseCase.ts:95:30
         }
 
         const batchResult = await this.eventService.publishEvents(allEvents);
-        if (!batchResult.ok) {
-          return err(
-            new UseCaseError(
-              `Failed to publish events: ${batchResult.error}`,
-              USE_CASE_ERRORS.INTERNAL_ERROR
-            )
-          );
-        }
+        if (!batchResult.ok) {}
 
         return ok({

[NoCoverage] StringLiteral
src/application/events/PublishDomainEventUseCase.ts:98:15
         if (!batchResult.ok) {
           return err(
             new UseCaseError(
-              `Failed to publish events: ${batchResult.error}`,
+              ``,
               USE_CASE_ERRORS.INTERNAL_ERROR
             )

[Survived] BooleanLiteral
src/application/events/PublishDomainEventUseCase.ts:106:22
 
         return ok({
           eventId: mainEvent.id,
-          published: true,
+          published: false,
           ...(correlationId !== undefined && { correlationId }),
           ...(allEvents.length !== undefined && { batchSize: allEvents.length }),

[Survived] EqualityOperator
src/application/events/PublishDomainEventUseCase.ts:107:15
         return ok({
           eventId: mainEvent.id,
           published: true,
-          ...(correlationId !== undefined && { correlationId }),
+          ...(correlationId === undefined && { correlationId }),
           ...(allEvents.length !== undefined && { batchSize: allEvents.length }),
           timestamp,

[Survived] ConditionalExpression
src/application/events/PublishDomainEventUseCase.ts:107:15
         return ok({
           eventId: mainEvent.id,
           published: true,
-          ...(correlationId !== undefined && { correlationId }),
+          ...(true && { correlationId }),
           ...(allEvents.length !== undefined && { batchSize: allEvents.length }),
           timestamp,

[Killed] EqualityOperator
src/application/events/PublishDomainEventUseCase.ts:108:15
           eventId: mainEvent.id,
           published: true,
           ...(correlationId !== undefined && { correlationId }),
-          ...(allEvents.length !== undefined && { batchSize: allEvents.length }),
+          ...(allEvents.length === undefined && { batchSize: allEvents.length }),
           timestamp,
         });
killedBy: tests/unit/application/EventCQRSUseCases.test.ts
statusReason: Event/CQRS/Saga Use Cases (TDD) > PublishDomainEventUseCase > should publish multiple events in batch: should publish multiple events in batch

[Survived] ConditionalExpression
src/application/events/PublishDomainEventUseCase.ts:108:15
           eventId: mainEvent.id,
           published: true,
           ...(correlationId !== undefined && { correlationId }),
-          ...(allEvents.length !== undefined && { batchSize: allEvents.length }),
+          ...(true && { batchSize: allEvents.length }),
           timestamp,
         });

[NoCoverage] BlockStatement
src/application/events/PublishDomainEventUseCase.ts:115:23
 
       // Publish single event
       const result = await this.eventService.publishEvent(mainEvent);
-      if (!result.ok) {
-        return err(
-          new UseCaseError(
-            `Failed to publish event: ${result.error}`,
-            USE_CASE_ERRORS.INTERNAL_ERROR
-          )
-        );
-      }
+      if (!result.ok) {}
 
       return ok({

[NoCoverage] StringLiteral
src/application/events/PublishDomainEventUseCase.ts:118:13
       if (!result.ok) {
         return err(
           new UseCaseError(
-            `Failed to publish event: ${result.error}`,
+            ``,
             USE_CASE_ERRORS.INTERNAL_ERROR
           )
