[NoCoverage] ObjectLiteral
src/application/links/GetTrackedLinkUseCase.ts:58:30
       projectId: link.projectId.value,
       originalUrl: link.originalUrl,
       shortCode: link.shortCode.value,
-      ...(link.vanitySlug && { vanitySlug: link.vanitySlug }),
+      ...(link.vanitySlug && {}),
       clicks: link.clicks,
       isActive: link.isActive,
