[NoCoverage] ObjectLiteral
src/application/posts/CreatePostUseCase.ts:82:26
     const createResult = PostAggregate.create({
       projectId: projectIdResult.value,
       body: input.body,
-      ...(input.title && { title: input.title }),
+      ...(input.title && {}),
       ...(input.summary && { summary: input.summary }),
       ...(input.tags && { tags: input.tags }),

[NoCoverage] BlockStatement
src/application/posts/CreatePostUseCase.ts:103:25
 
     // Persist the post
     const saveResult = await this.postRepository.save(post);
-    if (!saveResult.ok) {
-      return err(
-        new UseCaseError(
-          "Failed to save post",
-          USE_CASE_ERRORS.INTERNAL_ERROR,
-          saveResult.error
-        )
-      );
-    }
+    if (!saveResult.ok) {}
 
     // Dispatch domain events

[NoCoverage] ConditionalExpression
src/application/posts/CreatePostUseCase.ts:115:9
 
     // Dispatch domain events
     const events = post.domainEvents;
-    if (events.length > 0) {
+    if (true) {
       await this.eventDispatcher.dispatchAll([...events]);
       post.clearDomainEvents();

[NoCoverage] EqualityOperator
src/application/posts/CreatePostUseCase.ts:115:9
 
     // Dispatch domain events
     const events = post.domainEvents;
-    if (events.length > 0) {
+    if (events.length <= 0) {
       await this.eventDispatcher.dispatchAll([...events]);
       post.clearDomainEvents();

[NoCoverage] ObjectLiteral
src/application/posts/CreatePostUseCase.ts:128:33
       id: post.id.value,
       projectId: post.projectId.value,
       body: post.content.body,
-      ...(post.content.title && { title: post.content.title }),
+      ...(post.content.title && {}),
       tags: [...post.content.tags],
       locale: post.content.locale,
