[Survived] UnaryOperator
src/domain/entities/Account.ts:30:77
 const TIER_LIMITS: Record<SubscriptionTierValue, { maxProjects: number; maxChannelsPerProject: number; maxPostsPerDay: number }> = {
   [SUBSCRIPTION_TIER.BASIC]: { maxProjects: 1, maxChannelsPerProject: 3, maxPostsPerDay: 10 },
   [SUBSCRIPTION_TIER.PRO]: { maxProjects: 5, maxChannelsPerProject: 10, maxPostsPerDay: 100 },
-  [SUBSCRIPTION_TIER.ENTERPRISE]: { maxProjects: -1, maxChannelsPerProject: -1, maxPostsPerDay: -1 }, // Unlimited
+  [SUBSCRIPTION_TIER.ENTERPRISE]: { maxProjects: -1, maxChannelsPerProject: +1, maxPostsPerDay: -1 }, // Unlimited
 };
 

[Survived] UnaryOperator
src/domain/entities/Account.ts:30:50
 const TIER_LIMITS: Record<SubscriptionTierValue, { maxProjects: number; maxChannelsPerProject: number; maxPostsPerDay: number }> = {
   [SUBSCRIPTION_TIER.BASIC]: { maxProjects: 1, maxChannelsPerProject: 3, maxPostsPerDay: 10 },
   [SUBSCRIPTION_TIER.PRO]: { maxProjects: 5, maxChannelsPerProject: 10, maxPostsPerDay: 100 },
-  [SUBSCRIPTION_TIER.ENTERPRISE]: { maxProjects: -1, maxChannelsPerProject: -1, maxPostsPerDay: -1 }, // Unlimited
+  [SUBSCRIPTION_TIER.ENTERPRISE]: { maxProjects: +1, maxChannelsPerProject: -1, maxPostsPerDay: -1 }, // Unlimited
 };
 

[NoCoverage] BooleanLiteral
src/domain/entities/Account.ts:106:42
     this._name = props.name;
     this._subscription = props.subscription ?? SUBSCRIPTION_TIER.BASIC;
     this._maxProjects = props.maxProjects ?? TIER_LIMITS[this._subscription].maxProjects;
-    this._isOnTrial = props.isOnTrial ?? true;
+    this._isOnTrial = props.isOnTrial ?? false;
     this._trialStartDate = props.trialStartDate ?? new Date();
     this._trialEndDate = props.trialEndDate;

[Survived] BooleanLiteral
src/domain/entities/Account.ts:109:46
     this._isOnTrial = props.isOnTrial ?? true;
     this._trialStartDate = props.trialStartDate ?? new Date();
     this._trialEndDate = props.trialEndDate;
-    this._autoRenewal = props.autoRenewal ?? false;
+    this._autoRenewal = props.autoRenewal ?? true;
     this._billingCycle = props.billingCycle ?? BILLING_CYCLE.MONTHLY;
     this._stripeCustomerId = props.stripeCustomerId;

[NoCoverage] BlockStatement
src/domain/entities/Account.ts:115:26
     this._stripeSubscriptionId = props.stripeSubscriptionId;
     this._projectCount = 0;
 
-    if (props.updatedAt) {
-      this._updatedAt = props.updatedAt;
-    }
+    if (props.updatedAt) {}
   }
 

[Killed] ConditionalExpression
src/domain/entities/Account.ts:125:9
    */
   static create(input: CreateAccountInput): Result<Account, InvalidValueError> {
     // Validate email
-    if (!input.email || !Account.isValidEmail(input.email)) {
+    if (true) {
       return err(new InvalidValueError("email", input.email, "Invalid email address"));
     }
killedBy: tests/unit/domain/entities.test.ts
statusReason: Domain Entities > Account Entity > should create a new account: should create a new account

[Killed] ConditionalExpression
src/domain/entities/Account.ts:125:9
    */
   static create(input: CreateAccountInput): Result<Account, InvalidValueError> {
     // Validate email
-    if (!input.email || !Account.isValidEmail(input.email)) {
+    if (false) {
       return err(new InvalidValueError("email", input.email, "Invalid email address"));
     }
killedBy: tests/unit/domain/entities.test.ts
statusReason: Domain Entities > Account Entity > should reject invalid email: should reject invalid email

[Killed] BlockStatement
src/domain/entities/Account.ts:130:56
     }
 
     // Validate name
-    if (!input.name || input.name.trim().length === 0) {
-      return err(new InvalidValueError("name", input.name, "Name cannot be empty"));
-    }
+    if (!input.name || input.name.trim().length === 0) {}
 
     // Calculate trial end date
killedBy: tests/unit/domain/entities.test.ts
statusReason: Domain Entities > Account Entity > should reject empty name: should reject empty name

[Killed] ConditionalExpression
src/domain/entities/Account.ts:130:9
     }
 
     // Validate name
-    if (!input.name || input.name.trim().length === 0) {
+    if (false) {
       return err(new InvalidValueError("name", input.name, "Name cannot be empty"));
     }
killedBy: tests/unit/domain/entities.test.ts
statusReason: Domain Entities > Account Entity > should reject empty name: should reject empty name

[Survived] StringLiteral
src/domain/entities/Account.ts:131:60
 
     // Validate name
     if (!input.name || input.name.trim().length === 0) {
-      return err(new InvalidValueError("name", input.name, "Name cannot be empty"));
+      return err(new InvalidValueError("name", input.name, ""));
     }
 

[Killed] MethodExpression
src/domain/entities/Account.ts:137:5
     // Calculate trial end date
     const trialDays = input.trialDays ?? 14;
     const trialEndDate = new Date();
-    trialEndDate.setDate(trialEndDate.getDate() + trialDays);
+    trialEndDate.setTime(trialEndDate.getDate() + trialDays);
 
     return ok(
killedBy: tests/unit/domain/entities.test.ts
statusReason: Domain Entities > Account Entity > should track trial days remaining: should track trial days remaining

[Killed] ArithmeticOperator
src/domain/entities/Account.ts:137:26
     // Calculate trial end date
     const trialDays = input.trialDays ?? 14;
     const trialEndDate = new Date();
-    trialEndDate.setDate(trialEndDate.getDate() + trialDays);
+    trialEndDate.setDate(trialEndDate.getDate() - trialDays);
 
     return ok(
killedBy: tests/unit/domain/entities.test.ts
statusReason: Domain Entities > Account Entity > should track trial days remaining: should track trial days remaining

[Killed] MethodExpression
src/domain/entities/Account.ts:141:16
 
     return ok(
       new Account(AccountId.generate(), {
-        email: input.email.toLowerCase().trim(),
+        email: input.email.toUpperCase().trim(),
         name: input.name.trim(),
         subscription: input.subscription ?? SUBSCRIPTION_TIER.BASIC,
killedBy: tests/unit/domain/entities.test.ts
statusReason: Domain Entities > Account Entity > should create a new account: should create a new account

[Survived] MethodExpression
src/domain/entities/Account.ts:141:16
 
     return ok(
       new Account(AccountId.generate(), {
-        email: input.email.toLowerCase().trim(),
+        email: input.email.toLowerCase(),
         name: input.name.trim(),
         subscription: input.subscription ?? SUBSCRIPTION_TIER.BASIC,

[Survived] MethodExpression
src/domain/entities/Account.ts:142:15
     return ok(
       new Account(AccountId.generate(), {
         email: input.email.toLowerCase().trim(),
-        name: input.name.trim(),
+        name: input.name,
         subscription: input.subscription ?? SUBSCRIPTION_TIER.BASIC,
         isOnTrial: true,

[Killed] BooleanLiteral
src/domain/entities/Account.ts:144:20
         email: input.email.toLowerCase().trim(),
         name: input.name.trim(),
         subscription: input.subscription ?? SUBSCRIPTION_TIER.BASIC,
-        isOnTrial: true,
+        isOnTrial: false,
         trialEndDate,
       })
killedBy: tests/unit/domain/entities.test.ts
statusReason: Domain Entities > Account Entity > should create a new account: should create a new account

[Killed] Regex
src/domain/entities/Account.ts:163:24
    * Validate email format
    */
   private static isValidEmail(email: string): boolean {
-    const emailRegex = /^[^\s@]+@[^\s@]+\.[^\s@]+$/;
+    const emailRegex = /^[^\s@]+@[^\s@]+\.[^\S@]+$/;
     return emailRegex.test(email);
   }
killedBy: tests/unit/domain/entities.test.ts
statusReason: Domain Entities > Account Entity > should create a new account: should create a new account

[Killed] Regex
src/domain/entities/Account.ts:163:24
    * Validate email format
    */
   private static isValidEmail(email: string): boolean {
-    const emailRegex = /^[^\s@]+@[^\s@]+\.[^\s@]+$/;
+    const emailRegex = /^[^\s@]+@[^\s@]+\.[^\s@]$/;
     return emailRegex.test(email);
   }
killedBy: tests/unit/domain/entities.test.ts
statusReason: Domain Entities > Account Entity > should create a new account: should create a new account

[NoCoverage] BooleanLiteral
src/domain/entities/Account.ts:234:9
    * Check if trial has expired
    */
   get isTrialExpired(): boolean {
-    if (!this._isOnTrial || !this._trialEndDate) {
+    if (this._isOnTrial || !this._trialEndDate) {
       return false;
     }

[NoCoverage] BooleanLiteral
src/domain/entities/Account.ts:235:14
    */
   get isTrialExpired(): boolean {
     if (!this._isOnTrial || !this._trialEndDate) {
-      return false;
+      return true;
     }
     return this._trialEndDate.getTime() < Date.now();

[NoCoverage] ConditionalExpression
src/domain/entities/Account.ts:237:12
     if (!this._isOnTrial || !this._trialEndDate) {
       return false;
     }
-    return this._trialEndDate.getTime() < Date.now();
+    return false;
   }
 

[NoCoverage] ConditionalExpression
src/domain/entities/Account.ts:237:12
     if (!this._isOnTrial || !this._trialEndDate) {
       return false;
     }
-    return this._trialEndDate.getTime() < Date.now();
+    return true;
   }
 

[NoCoverage] BooleanLiteral
src/domain/entities/Account.ts:244:9
    * Check if account is active (not expired trial or has subscription)
    */
   get isActive(): boolean {
-    if (!this._isOnTrial) {
+    if (this._isOnTrial) {
       return true; // Paid subscription
     }

[NoCoverage] ConditionalExpression
src/domain/entities/Account.ts:244:9
    * Check if account is active (not expired trial or has subscription)
    */
   get isActive(): boolean {
-    if (!this._isOnTrial) {
+    if (true) {
       return true; // Paid subscription
     }

[NoCoverage] BooleanLiteral
src/domain/entities/Account.ts:245:14
    */
   get isActive(): boolean {
     if (!this._isOnTrial) {
-      return true; // Paid subscription
+      return false; // Paid subscription
     }
     return !this.isTrialExpired;

[NoCoverage] BooleanLiteral
src/domain/entities/Account.ts:247:12
     if (!this._isOnTrial) {
       return true; // Paid subscription
     }
-    return !this.isTrialExpired;
+    return this.isTrialExpired;
   }
 

[Killed] BooleanLiteral
src/domain/entities/Account.ts:254:9
    * Get remaining trial days
    */
   get trialDaysRemaining(): number {
-    if (!this._isOnTrial || !this._trialEndDate) {
+    if (this._isOnTrial || !this._trialEndDate) {
       return 0;
     }
killedBy: tests/unit/domain/entities.test.ts
statusReason: Domain Entities > Account Entity > should track trial days remaining: should track trial days remaining

[Killed] ArithmeticOperator
src/domain/entities/Account.ts:257:23
     if (!this._isOnTrial || !this._trialEndDate) {
       return 0;
     }
-    const remaining = this._trialEndDate.getTime() - Date.now();
+    const remaining = this._trialEndDate.getTime() + Date.now();
     return Math.max(0, Math.ceil(remaining / (24 * 60 * 60 * 1000)));
   }
killedBy: tests/unit/domain/entities.test.ts
statusReason: Domain Entities > Account Entity > should track trial days remaining: should track trial days remaining

[Killed] ArithmeticOperator
src/domain/entities/Account.ts:258:34
       return 0;
     }
     const remaining = this._trialEndDate.getTime() - Date.now();
-    return Math.max(0, Math.ceil(remaining / (24 * 60 * 60 * 1000)));
+    return Math.max(0, Math.ceil(remaining * (24 * 60 * 60 * 1000)));
   }
 
killedBy: tests/unit/domain/entities.test.ts
statusReason: Domain Entities > Account Entity > should track trial days remaining: should track trial days remaining

[Killed] ArithmeticOperator
src/domain/entities/Account.ts:258:47
       return 0;
     }
     const remaining = this._trialEndDate.getTime() - Date.now();
-    return Math.max(0, Math.ceil(remaining / (24 * 60 * 60 * 1000)));
+    return Math.max(0, Math.ceil(remaining / (24 * 60 * 60 / 1000)));
   }
 
killedBy: tests/unit/domain/entities.test.ts
statusReason: Domain Entities > Account Entity > should track trial days remaining: should track trial days remaining

[Killed] ConditionalExpression
src/domain/entities/Account.ts:265:9
    * Check if account can create more projects
    */
   get canCreateProject(): boolean {
-    if (this._maxProjects === -1) return true; // Unlimited
+    if (true) return true; // Unlimited
     return this._projectCount < this._maxProjects;
   }
killedBy: tests/unit/domain/entities.test.ts
statusReason: Domain Entities > Account Entity > should manage project count: should manage project count

[Killed] UnaryOperator
src/domain/entities/Account.ts:265:31
    * Check if account can create more projects
    */
   get canCreateProject(): boolean {
-    if (this._maxProjects === -1) return true; // Unlimited
+    if (this._maxProjects === +1) return true; // Unlimited
     return this._projectCount < this._maxProjects;
   }
killedBy: tests/unit/domain/entities.test.ts
statusReason: Domain Entities > Account Entity > should manage project count: should manage project count

[Killed] ConditionalExpression
src/domain/entities/Account.ts:266:12
    */
   get canCreateProject(): boolean {
     if (this._maxProjects === -1) return true; // Unlimited
-    return this._projectCount < this._maxProjects;
+    return true;
   }
 
killedBy: tests/unit/domain/entities.test.ts
statusReason: Domain Entities > Account Entity > should manage project count: should manage project count

[Killed] EqualityOperator
src/domain/entities/Account.ts:266:12
    */
   get canCreateProject(): boolean {
     if (this._maxProjects === -1) return true; // Unlimited
-    return this._projectCount < this._maxProjects;
+    return this._projectCount >= this._maxProjects;
   }
 
killedBy: tests/unit/domain/entities.test.ts
statusReason: Domain Entities > Account Entity > should manage project count: should manage project count

[NoCoverage] ConditionalExpression
src/domain/entities/Account.ts:275:21
    * Update account name
    */
   updateName(newName: string): Result<void, InvalidValueError> {
-    if (!newName || newName.trim().length === 0) {
+    if (!newName || false) {
       return err(new InvalidValueError("name", newName, "Name cannot be empty"));
     }

[NoCoverage] ConditionalExpression
src/domain/entities/Account.ts:275:9
    * Update account name
    */
   updateName(newName: string): Result<void, InvalidValueError> {
-    if (!newName || newName.trim().length === 0) {
+    if (true) {
       return err(new InvalidValueError("name", newName, "Name cannot be empty"));
     }

[NoCoverage] StringLiteral
src/domain/entities/Account.ts:276:40
    */
   updateName(newName: string): Result<void, InvalidValueError> {
     if (!newName || newName.trim().length === 0) {
-      return err(new InvalidValueError("name", newName, "Name cannot be empty"));
+      return err(new InvalidValueError("", newName, "Name cannot be empty"));
     }
 

[NoCoverage] MethodExpression
src/domain/entities/Account.ts:279:18
       return err(new InvalidValueError("name", newName, "Name cannot be empty"));
     }
 
-    this._name = newName.trim();
+    this._name = newName;
     this.markUpdated();
 

[NoCoverage] ConditionalExpression
src/domain/entities/Account.ts:289:9
    * Update email address
    */
   updateEmail(newEmail: string): Result<void, InvalidValueError> {
-    if (!newEmail || !Account.isValidEmail(newEmail)) {
+    if (false) {
       return err(new InvalidValueError("email", newEmail, "Invalid email address"));
     }

[NoCoverage] LogicalOperator
src/domain/entities/Account.ts:289:9
    * Update email address
    */
   updateEmail(newEmail: string): Result<void, InvalidValueError> {
-    if (!newEmail || !Account.isValidEmail(newEmail)) {
+    if (!newEmail && !Account.isValidEmail(newEmail)) {
       return err(new InvalidValueError("email", newEmail, "Invalid email address"));
     }

[NoCoverage] StringLiteral
src/domain/entities/Account.ts:290:40
    */
   updateEmail(newEmail: string): Result<void, InvalidValueError> {
     if (!newEmail || !Account.isValidEmail(newEmail)) {
-      return err(new InvalidValueError("email", newEmail, "Invalid email address"));
+      return err(new InvalidValueError("", newEmail, "Invalid email address"));
     }
 

[NoCoverage] MethodExpression
src/domain/entities/Account.ts:293:19
       return err(new InvalidValueError("email", newEmail, "Invalid email address"));
     }
 
-    this._email = newEmail.toLowerCase().trim();
+    this._email = newEmail.toLowerCase();
     this.markUpdated();
 

[NoCoverage] MethodExpression
src/domain/entities/Account.ts:293:19
       return err(new InvalidValueError("email", newEmail, "Invalid email address"));
     }
 
-    this._email = newEmail.toLowerCase().trim();
+    this._email = newEmail.toUpperCase().trim();
     this.markUpdated();
 

[Killed] ConditionalExpression
src/domain/entities/Account.ts:305:9
   upgradeTo(tier: SubscriptionTierValue): Result<void, InvariantViolationError> {
     const tierOrder = { BASIC: 0, PRO: 1, ENTERPRISE: 2 };
 
-    if (tierOrder[tier] <= tierOrder[this._subscription]) {
+    if (true) {
       return err(new InvariantViolationError(`Cannot upgrade from ${this._subscription} to ${tier}`));
     }
killedBy: tests/unit/domain/entities.test.ts
statusReason: Domain Entities > Account Entity > should upgrade subscription: should upgrade subscription

[Killed] ConditionalExpression
src/domain/entities/Account.ts:305:9
   upgradeTo(tier: SubscriptionTierValue): Result<void, InvariantViolationError> {
     const tierOrder = { BASIC: 0, PRO: 1, ENTERPRISE: 2 };
 
-    if (tierOrder[tier] <= tierOrder[this._subscription]) {
+    if (false) {
       return err(new InvariantViolationError(`Cannot upgrade from ${this._subscription} to ${tier}`));
     }
killedBy: tests/unit/domain/entities.test.ts
statusReason: Domain Entities > Account Entity > should not allow upgrading to same or lower tier: should not allow upgrading to same or lower tier

[Survived] StringLiteral
src/domain/entities/Account.ts:306:46
     const tierOrder = { BASIC: 0, PRO: 1, ENTERPRISE: 2 };
 
     if (tierOrder[tier] <= tierOrder[this._subscription]) {
-      return err(new InvariantViolationError(`Cannot upgrade from ${this._subscription} to ${tier}`));
+      return err(new InvariantViolationError(``));
     }
 

[Killed] BooleanLiteral
src/domain/entities/Account.ts:311:23
 
     this._subscription = tier;
     this._maxProjects = TIER_LIMITS[tier].maxProjects;
-    this._isOnTrial = false;
+    this._isOnTrial = true;
     this.markUpdated();
 
killedBy: tests/unit/domain/entities.test.ts
statusReason: Domain Entities > Account Entity > should upgrade subscription: should upgrade subscription

[NoCoverage] BlockStatement
src/domain/entities/Account.ts:323:59
   downgradeTo(tier: SubscriptionTierValue): Result<void, InvariantViolationError | InvalidStateTransitionError> {
     const tierOrder = { BASIC: 0, PRO: 1, ENTERPRISE: 2 };
 
-    if (tierOrder[tier] >= tierOrder[this._subscription]) {
-      return err(new InvariantViolationError(`Cannot downgrade from ${this._subscription} to ${tier}`));
-    }
+    if (tierOrder[tier] >= tierOrder[this._subscription]) {}
 
     // Check if current usage exceeds new tier limits

[NoCoverage] ConditionalExpression
src/domain/entities/Account.ts:323:9
   downgradeTo(tier: SubscriptionTierValue): Result<void, InvariantViolationError | InvalidStateTransitionError> {
     const tierOrder = { BASIC: 0, PRO: 1, ENTERPRISE: 2 };
 
-    if (tierOrder[tier] >= tierOrder[this._subscription]) {
+    if (false) {
       return err(new InvariantViolationError(`Cannot downgrade from ${this._subscription} to ${tier}`));
     }

[NoCoverage] StringLiteral
src/domain/entities/Account.ts:324:46
     const tierOrder = { BASIC: 0, PRO: 1, ENTERPRISE: 2 };
 
     if (tierOrder[tier] >= tierOrder[this._subscription]) {
-      return err(new InvariantViolationError(`Cannot downgrade from ${this._subscription} to ${tier}`));
+      return err(new InvariantViolationError(``));
     }
 

[NoCoverage] EqualityOperator
src/domain/entities/Account.ts:329:41
 
     // Check if current usage exceeds new tier limits
     const newLimits = TIER_LIMITS[tier];
-    if (newLimits.maxProjects !== -1 && this._projectCount > newLimits.maxProjects) {
+    if (newLimits.maxProjects !== -1 && this._projectCount <= newLimits.maxProjects) {
       return err(
         new InvalidStateTransitionError(

[NoCoverage] UnaryOperator
src/domain/entities/Account.ts:329:35
 
     // Check if current usage exceeds new tier limits
     const newLimits = TIER_LIMITS[tier];
-    if (newLimits.maxProjects !== -1 && this._projectCount > newLimits.maxProjects) {
+    if (newLimits.maxProjects !== +1 && this._projectCount > newLimits.maxProjects) {
       return err(
         new InvalidStateTransitionError(

[NoCoverage] BlockStatement
src/domain/entities/Account.ts:349:79
   /**
    * End trial and convert to paid subscription
    */
-  convertToPaid(stripeCustomerId: string, stripeSubscriptionId: string): void {
-    this._isOnTrial = false;
-    this._stripeCustomerId = stripeCustomerId;
-    this._stripeSubscriptionId = stripeSubscriptionId;
-    this.markUpdated();
-  }
+  convertToPaid(stripeCustomerId: string, stripeSubscriptionId: string): void {}
 
   /**

[NoCoverage] BooleanLiteral
src/domain/entities/Account.ts:350:23
    * End trial and convert to paid subscription
    */
   convertToPaid(stripeCustomerId: string, stripeSubscriptionId: string): void {
-    this._isOnTrial = false;
+    this._isOnTrial = true;
     this._stripeCustomerId = stripeCustomerId;
     this._stripeSubscriptionId = stripeSubscriptionId;

[Killed] ConditionalExpression
src/domain/entities/Account.ts:360:9
    * Extend trial period
    */
   extendTrial(additionalDays: number): Result<void, InvariantViolationError> {
-    if (!this._isOnTrial) {
+    if (true) {
       return err(new InvariantViolationError("Cannot extend trial for paid account"));
     }
killedBy: tests/unit/domain/entities.test.ts
statusReason: Domain Entities > Account Entity > should extend trial: should extend trial

[Killed] BooleanLiteral
src/domain/entities/Account.ts:360:9
    * Extend trial period
    */
   extendTrial(additionalDays: number): Result<void, InvariantViolationError> {
-    if (!this._isOnTrial) {
+    if (this._isOnTrial) {
       return err(new InvariantViolationError("Cannot extend trial for paid account"));
     }
killedBy: tests/unit/domain/entities.test.ts
statusReason: Domain Entities > Account Entity > should extend trial: should extend trial

[Killed] EqualityOperator
src/domain/entities/Account.ts:364:9
       return err(new InvariantViolationError("Cannot extend trial for paid account"));
     }
 
-    if (additionalDays <= 0) {
+    if (additionalDays > 0) {
       return err(new InvariantViolationError("Additional days must be positive"));
     }
killedBy: tests/unit/domain/entities.test.ts
statusReason: Domain Entities > Account Entity > should extend trial: should extend trial

[Killed] ConditionalExpression
src/domain/entities/Account.ts:364:9
       return err(new InvariantViolationError("Cannot extend trial for paid account"));
     }
 
-    if (additionalDays <= 0) {
+    if (true) {
       return err(new InvariantViolationError("Additional days must be positive"));
     }
killedBy: tests/unit/domain/entities.test.ts
statusReason: Domain Entities > Account Entity > should extend trial: should extend trial

[Killed] ArithmeticOperator
src/domain/entities/Account.ts:369:29
     }
 
     const currentEnd = this._trialEndDate ?? new Date();
-    const newEnd = new Date(currentEnd.getTime() + additionalDays * 24 * 60 * 60 * 1000);
+    const newEnd = new Date(currentEnd.getTime() - additionalDays * 24 * 60 * 60 * 1000);
     this._trialEndDate = newEnd;
     this.markUpdated();
killedBy: tests/unit/domain/entities.test.ts
statusReason: Domain Entities > Account Entity > should extend trial: should extend trial

[Survived] ArithmeticOperator
src/domain/entities/Account.ts:369:52
     }
 
     const currentEnd = this._trialEndDate ?? new Date();
-    const newEnd = new Date(currentEnd.getTime() + additionalDays * 24 * 60 * 60 * 1000);
+    const newEnd = new Date(currentEnd.getTime() + additionalDays * 24 / 60 * 60 * 1000);
     this._trialEndDate = newEnd;
     this.markUpdated();

[NoCoverage] BlockStatement
src/domain/entities/Account.ts:379:42
   /**
    * Toggle auto-renewal
    */
-  setAutoRenewal(enabled: boolean): void {
-    this._autoRenewal = enabled;
-    this.markUpdated();
-  }
+  setAutoRenewal(enabled: boolean): void {}
 
   /**

[NoCoverage] BlockStatement
src/domain/entities/Account.ts:387:51
   /**
    * Change billing cycle
    */
-  setBillingCycle(cycle: BillingCycleValue): void {
-    this._billingCycle = cycle;
-    this.markUpdated();
-  }
+  setBillingCycle(cycle: BillingCycleValue): void {}
 
   /**

[Killed] ConditionalExpression
src/domain/entities/Account.ts:396:9
    * Increment project count (called when project is created)
    */
   incrementProjectCount(): Result<void, InvariantViolationError> {
-    if (!this.canCreateProject) {
+    if (true) {
       return err(new InvariantViolationError(`Account has reached maximum projects limit (${this._maxProjects})`));
     }
killedBy: tests/unit/domain/entities.test.ts
statusReason: Domain Entities > Account Entity > should manage project count: should manage project count

[Killed] BooleanLiteral
src/domain/entities/Account.ts:396:9
    * Increment project count (called when project is created)
    */
   incrementProjectCount(): Result<void, InvariantViolationError> {
-    if (!this.canCreateProject) {
+    if (this.canCreateProject) {
       return err(new InvariantViolationError(`Account has reached maximum projects limit (${this._maxProjects})`));
     }
killedBy: tests/unit/domain/entities.test.ts
statusReason: Domain Entities > Account Entity > should manage project count: should manage project count

[Killed] AssignmentOperator
src/domain/entities/Account.ts:399:5
     if (!this.canCreateProject) {
       return err(new InvariantViolationError(`Account has reached maximum projects limit (${this._maxProjects})`));
     }
-    this._projectCount += 1;
+    this._projectCount -= 1;
     return ok(undefined);
   }
killedBy: tests/unit/domain/entities.test.ts
statusReason: Domain Entities > Account Entity > should manage project count: should manage project count

[NoCoverage] BlockStatement
src/domain/entities/Account.ts:406:33
   /**
    * Decrement project count (called when project is deleted)
    */
-  decrementProjectCount(): void {
-    if (this._projectCount > 0) {
-      this._projectCount -= 1;
-    }
-  }
+  decrementProjectCount(): void {}
 
   toJSON(): Record<string, unknown> {

[NoCoverage] EqualityOperator
src/domain/entities/Account.ts:407:9
    * Decrement project count (called when project is deleted)
    */
   decrementProjectCount(): void {
-    if (this._projectCount > 0) {
+    if (this._projectCount >= 0) {
       this._projectCount -= 1;
     }

[NoCoverage] EqualityOperator
src/domain/entities/Account.ts:407:9
    * Decrement project count (called when project is deleted)
    */
   decrementProjectCount(): void {
-    if (this._projectCount > 0) {
+    if (this._projectCount <= 0) {
       this._projectCount -= 1;
     }

[NoCoverage] AssignmentOperator
src/domain/entities/Account.ts:408:7
    */
   decrementProjectCount(): void {
     if (this._projectCount > 0) {
-      this._projectCount -= 1;
+      this._projectCount += 1;
     }
   }

[NoCoverage] ObjectLiteral
src/domain/entities/Account.ts:422:33
       projectCount: this._projectCount,
       isOnTrial: this._isOnTrial,
       trialStartDate: this._trialStartDate.toISOString(),
-      ...(this._trialEndDate && { trialEndDate: this._trialEndDate.toISOString() }),
+      ...(this._trialEndDate && {}),
       trialDaysRemaining: this.trialDaysRemaining,
       isActive: this.isActive,
