[Killed] BlockStatement
src/domain/entities/TrackedLink.ts:64:41
     this._projectId = props.projectId;
     this._originalUrl = props.originalUrl;
     this._shortCode = props.shortCode;
-    if (props.vanitySlug !== undefined) {
-      this._vanitySlug = props.vanitySlug;
-    }
+    if (props.vanitySlug !== undefined) {}
     this._clicks = props.clicks;
     this._isActive = props.isActive;
killedBy: tests/unit/domain/linkTracking.test.ts
statusReason: Link Tracking Domain > TrackedLink Entity > should create tracked link with custom vanity slug: should create tracked link with custom vanity slug

[Killed] ConditionalExpression
src/domain/entities/TrackedLink.ts:78:9
     props: TrackedLinkCreateProps
   ): Result<TrackedLink, InvalidUrlError> {
     // Validate URL
-    if (!TrackedLink.isValidUrl(props.originalUrl)) {
+    if (false) {
       return err(new InvalidUrlError(props.originalUrl));
     }
killedBy: tests/unit/domain/linkTracking.test.ts
statusReason: Link Tracking Domain > TrackedLink Entity > should reject invalid URL: should reject invalid URL

[Killed] BlockStatement
src/domain/entities/TrackedLink.ts:78:53
     props: TrackedLinkCreateProps
   ): Result<TrackedLink, InvalidUrlError> {
     // Validate URL
-    if (!TrackedLink.isValidUrl(props.originalUrl)) {
-      return err(new InvalidUrlError(props.originalUrl));
-    }
+    if (!TrackedLink.isValidUrl(props.originalUrl)) {}
 
     // Generate or validate short code
killedBy: tests/unit/domain/linkTracking.test.ts
statusReason: Link Tracking Domain > TrackedLink Entity > should reject invalid URL: should reject invalid URL

[Killed] BooleanLiteral
src/domain/entities/TrackedLink.ts:102:19
         shortCode,
         ...(props.vanitySlug && { vanitySlug: props.vanitySlug }),
         clicks: 0,
-        isActive: true,
+        isActive: false,
       })
     );
killedBy: tests/unit/domain/linkTracking.test.ts
statusReason: Link Tracking Domain > TrackedLink Entity > should deactivate a link: should deactivate a link

[Killed] EqualityOperator
src/domain/entities/TrackedLink.ts:120:45
   private static isValidUrl(url: string): boolean {
     try {
       const parsed = new URL(url);
-      return parsed.protocol === "http:" || parsed.protocol === "https:";
+      return parsed.protocol === "http:" || parsed.protocol !== "https:";
     } catch {
       return false;
killedBy: tests/unit/domain/linkTracking.test.ts
statusReason: Link Tracking Domain > TrackedLink Entity > should create a tracked link with valid URL: should create a tracked link with valid URL

[Killed] ConditionalExpression
src/domain/entities/TrackedLink.ts:120:45
   private static isValidUrl(url: string): boolean {
     try {
       const parsed = new URL(url);
-      return parsed.protocol === "http:" || parsed.protocol === "https:";
+      return parsed.protocol === "http:" || false;
     } catch {
       return false;
killedBy: tests/unit/domain/linkTracking.test.ts
statusReason: Link Tracking Domain > TrackedLink Entity > should create a tracked link with valid URL: should create a tracked link with valid URL

[Killed] BooleanLiteral
src/domain/entities/TrackedLink.ts:122:14
       const parsed = new URL(url);
       return parsed.protocol === "http:" || parsed.protocol === "https:";
     } catch {
-      return false;
+      return true;
     }
   }
killedBy: tests/unit/domain/linkTracking.test.ts
statusReason: Link Tracking Domain > TrackedLink Entity > should reject invalid URL: should reject invalid URL

[Killed] BlockStatement
src/domain/entities/TrackedLink.ts:168:23
   /**
    * Record a click on this link
    */
-  recordClick(): void {
-    this._clicks += 1;
-    this.markUpdated();
-  }
+  recordClick(): void {}
 
   /**
killedBy: tests/unit/domain/linkTracking.test.ts
statusReason: Link Tracking Domain > TrackedLink Entity > should increment click count: should increment click count

[Killed] AssignmentOperator
src/domain/entities/TrackedLink.ts:169:5
    * Record a click on this link
    */
   recordClick(): void {
-    this._clicks += 1;
+    this._clicks -= 1;
     this.markUpdated();
   }
killedBy: tests/unit/domain/linkTracking.test.ts
statusReason: Link Tracking Domain > TrackedLink Entity > should increment click count: should increment click count

[Killed] BlockStatement
src/domain/entities/TrackedLink.ts:176:22
   /**
    * Deactivate the link (stops redirects)
    */
-  deactivate(): void {
-    this._isActive = false;
-    this.markUpdated();
-  }
+  deactivate(): void {}
 
   /**
killedBy: tests/unit/domain/linkTracking.test.ts
statusReason: Link Tracking Domain > TrackedLink Entity > should deactivate a link: should deactivate a link

[Killed] BooleanLiteral
src/domain/entities/TrackedLink.ts:177:22
    * Deactivate the link (stops redirects)
    */
   deactivate(): void {
-    this._isActive = false;
+    this._isActive = true;
     this.markUpdated();
   }
killedBy: tests/unit/domain/linkTracking.test.ts
statusReason: Link Tracking Domain > TrackedLink Entity > should deactivate a link: should deactivate a link

[Killed] BlockStatement
src/domain/entities/TrackedLink.ts:184:20
   /**
    * Reactivate the link
    */
-  activate(): void {
-    this._isActive = true;
-    this.markUpdated();
-  }
+  activate(): void {}
 
   /**
killedBy: tests/unit/domain/linkTracking.test.ts
statusReason: Link Tracking Domain > TrackedLink Entity > should reactivate a deactivated link: should reactivate a deactivated link

[Killed] BooleanLiteral
src/domain/entities/TrackedLink.ts:185:22
    * Reactivate the link
    */
   activate(): void {
-    this._isActive = true;
+    this._isActive = false;
     this.markUpdated();
   }
killedBy: tests/unit/domain/linkTracking.test.ts
statusReason: Link Tracking Domain > TrackedLink Entity > should reactivate a deactivated link: should reactivate a deactivated link
