[Killed] ConditionalExpression
src/domain/value-objects/MediaAttachment.ts:135:9
    */
   static create(props: MediaAttachmentProps): Result<MediaAttachment, InvalidValueError | EmptyValueError> {
     // Validate type
-    if (!MEDIA_TYPES.includes(props.type)) {
+    if (false) {
       return err(new InvalidValueError("type", props.type, `Invalid media type: "${props.type}". Valid types: ${MEDIA_TYPES.join(", ")}`));
     }
killedBy: tests/unit/domain/value-objects.test.ts
statusReason: Domain Value Objects > MediaAttachment > should reject invalid media type: should reject invalid media type

[Killed] BlockStatement
src/domain/value-objects/MediaAttachment.ts:135:44
    */
   static create(props: MediaAttachmentProps): Result<MediaAttachment, InvalidValueError | EmptyValueError> {
     // Validate type
-    if (!MEDIA_TYPES.includes(props.type)) {
-      return err(new InvalidValueError("type", props.type, `Invalid media type: "${props.type}". Valid types: ${MEDIA_TYPES.join(", ")}`));
-    }
+    if (!MEDIA_TYPES.includes(props.type)) {}
 
     // Validate URL
killedBy: tests/unit/domain/value-objects.test.ts
statusReason: Domain Value Objects > MediaAttachment > should reject invalid media type: should reject invalid media type

[Survived] StringLiteral
src/domain/value-objects/MediaAttachment.ts:136:130
   static create(props: MediaAttachmentProps): Result<MediaAttachment, InvalidValueError | EmptyValueError> {
     // Validate type
     if (!MEDIA_TYPES.includes(props.type)) {
-      return err(new InvalidValueError("type", props.type, `Invalid media type: "${props.type}". Valid types: ${MEDIA_TYPES.join(", ")}`));
+      return err(new InvalidValueError("type", props.type, `Invalid media type: "${props.type}". Valid types: ${MEDIA_TYPES.join("")}`));
     }
 

[Killed] BooleanLiteral
src/domain/value-objects/MediaAttachment.ts:140:9
     }
 
     // Validate URL
-    if (!props.url || props.url.trim().length === 0) {
+    if (props.url || props.url.trim().length === 0) {
       return err(new EmptyValueError("url"));
     }
killedBy: tests/unit/domain/value-objects.test.ts
statusReason: Domain Value Objects > MediaAttachment > should create image attachment: should create image attachment

[Killed] EqualityOperator
src/domain/value-objects/MediaAttachment.ts:140:23
     }
 
     // Validate URL
-    if (!props.url || props.url.trim().length === 0) {
+    if (!props.url || props.url.trim().length !== 0) {
       return err(new EmptyValueError("url"));
     }
killedBy: tests/unit/domain/value-objects.test.ts
statusReason: Domain Value Objects > MediaAttachment > should create image attachment: should create image attachment

[Survived] StringLiteral
src/domain/value-objects/MediaAttachment.ts:141:38
 
     // Validate URL
     if (!props.url || props.url.trim().length === 0) {
-      return err(new EmptyValueError("url"));
+      return err(new EmptyValueError(""));
     }
 

[Killed] BlockStatement
src/domain/value-objects/MediaAttachment.ts:145:9
     }
 
     // Validate URL format
-    try {
-      new URL(props.url);
-    } catch {
+    try {} catch {
       return err(new InvalidValueError("url", props.url, "Invalid URL format"));
     }
killedBy: tests/unit/domain/value-objects.test.ts
statusReason: Domain Value Objects > MediaAttachment > should reject invalid URL: should reject invalid URL

[Killed] BlockStatement
src/domain/value-objects/MediaAttachment.ts:147:13
     // Validate URL format
     try {
       new URL(props.url);
-    } catch {
-      return err(new InvalidValueError("url", props.url, "Invalid URL format"));
-    }
+    } catch {}
 
     // Validate dimensions if provided
killedBy: tests/unit/domain/value-objects.test.ts
statusReason: Domain Value Objects > MediaAttachment > should reject invalid URL: should reject invalid URL

[Survived] StringLiteral
src/domain/value-objects/MediaAttachment.ts:148:58
     try {
       new URL(props.url);
     } catch {
-      return err(new InvalidValueError("url", props.url, "Invalid URL format"));
+      return err(new InvalidValueError("url", props.url, ""));
     }
 

[Killed] ConditionalExpression
src/domain/value-objects/MediaAttachment.ts:152:38
     }
 
     // Validate dimensions if provided
-    if (props.width !== undefined && props.width <= 0) {
+    if (props.width !== undefined && true) {
       return err(new InvalidValueError("width", props.width, "Width must be a positive number"));
     }
killedBy: tests/unit/domain/value-objects.test.ts
statusReason: Domain Value Objects > MediaAttachment > should create image attachment: should create image attachment

[Killed] EqualityOperator
src/domain/value-objects/MediaAttachment.ts:152:38
     }
 
     // Validate dimensions if provided
-    if (props.width !== undefined && props.width <= 0) {
+    if (props.width !== undefined && props.width > 0) {
       return err(new InvalidValueError("width", props.width, "Width must be a positive number"));
     }
killedBy: tests/unit/domain/value-objects.test.ts
statusReason: Domain Value Objects > MediaAttachment > should create image attachment: should create image attachment

[NoCoverage] StringLiteral
src/domain/value-objects/MediaAttachment.ts:153:62
 
     // Validate dimensions if provided
     if (props.width !== undefined && props.width <= 0) {
-      return err(new InvalidValueError("width", props.width, "Width must be a positive number"));
+      return err(new InvalidValueError("width", props.width, ""));
     }
 

[Killed] EqualityOperator
src/domain/value-objects/MediaAttachment.ts:156:39
       return err(new InvalidValueError("width", props.width, "Width must be a positive number"));
     }
 
-    if (props.height !== undefined && props.height <= 0) {
+    if (props.height !== undefined && props.height > 0) {
       return err(new InvalidValueError("height", props.height, "Height must be a positive number"));
     }
killedBy: tests/unit/domain/value-objects.test.ts
statusReason: Domain Value Objects > MediaAttachment > should create image attachment: should create image attachment

[Killed] ConditionalExpression
src/domain/value-objects/MediaAttachment.ts:156:39
       return err(new InvalidValueError("width", props.width, "Width must be a positive number"));
     }
 
-    if (props.height !== undefined && props.height <= 0) {
+    if (props.height !== undefined && true) {
       return err(new InvalidValueError("height", props.height, "Height must be a positive number"));
     }
killedBy: tests/unit/domain/value-objects.test.ts
statusReason: Domain Value Objects > MediaAttachment > should create image attachment: should create image attachment

[Killed] EqualityOperator
src/domain/value-objects/MediaAttachment.ts:161:43
     }
 
     // Validate duration for video/gif
-    if (props.durationMs !== undefined && props.durationMs <= 0) {
+    if (props.durationMs !== undefined && props.durationMs > 0) {
       return err(new InvalidValueError("durationMs", props.durationMs, "Duration must be a positive number"));
     }
killedBy: tests/unit/domain/value-objects.test.ts
statusReason: Domain Value Objects > MediaAttachment > should create video attachment: should create video attachment

[Killed] ConditionalExpression
src/domain/value-objects/MediaAttachment.ts:161:43
     }
 
     // Validate duration for video/gif
-    if (props.durationMs !== undefined && props.durationMs <= 0) {
+    if (props.durationMs !== undefined && true) {
       return err(new InvalidValueError("durationMs", props.durationMs, "Duration must be a positive number"));
     }
killedBy: tests/unit/domain/value-objects.test.ts
statusReason: Domain Value Objects > MediaAttachment > should create video attachment: should create video attachment

[NoCoverage] StringLiteral
src/domain/value-objects/MediaAttachment.ts:162:40
 
     // Validate duration for video/gif
     if (props.durationMs !== undefined && props.durationMs <= 0) {
-      return err(new InvalidValueError("durationMs", props.durationMs, "Duration must be a positive number"));
+      return err(new InvalidValueError("", props.durationMs, "Duration must be a positive number"));
     }
 

[NoCoverage] EqualityOperator
src/domain/value-objects/MediaAttachment.ts:166:46
     }
 
     // Validate file size
-    if (props.fileSizeBytes !== undefined && props.fileSizeBytes <= 0) {
+    if (props.fileSizeBytes !== undefined && props.fileSizeBytes > 0) {
       return err(new InvalidValueError("fileSizeBytes", props.fileSizeBytes, "File size must be a positive number"));
     }

[Survived] ConditionalExpression
src/domain/value-objects/MediaAttachment.ts:166:9
     }
 
     // Validate file size
-    if (props.fileSizeBytes !== undefined && props.fileSizeBytes <= 0) {
+    if (false) {
       return err(new InvalidValueError("fileSizeBytes", props.fileSizeBytes, "File size must be a positive number"));
     }

[Survived] MethodExpression
src/domain/value-objects/MediaAttachment.ts:174:14
       new MediaAttachment({
         id: props.id ?? MediaId.generate(),
         type: props.type,
-        url: props.url.trim(),
+        url: props.url,
         ...(props.width !== undefined && { width: props.width }),
         ...(props.height !== undefined && { height: props.height }),

[Killed] EqualityOperator
src/domain/value-objects/MediaAttachment.ts:175:13
         id: props.id ?? MediaId.generate(),
         type: props.type,
         url: props.url.trim(),
-        ...(props.width !== undefined && { width: props.width }),
+        ...(props.width === undefined && { width: props.width }),
         ...(props.height !== undefined && { height: props.height }),
         ...(props.durationMs !== undefined && { durationMs: props.durationMs }),
killedBy: tests/unit/domain/value-objects.test.ts
statusReason: Domain Value Objects > MediaAttachment > should create image attachment: should create image attachment

[Killed] ObjectLiteral
src/domain/value-objects/MediaAttachment.ts:175:42
         id: props.id ?? MediaId.generate(),
         type: props.type,
         url: props.url.trim(),
-        ...(props.width !== undefined && { width: props.width }),
+        ...(props.width !== undefined && {}),
         ...(props.height !== undefined && { height: props.height }),
         ...(props.durationMs !== undefined && { durationMs: props.durationMs }),
killedBy: tests/unit/domain/value-objects.test.ts
statusReason: Domain Value Objects > MediaAttachment > should create image attachment: should create image attachment

[Killed] EqualityOperator
src/domain/value-objects/MediaAttachment.ts:176:13
         type: props.type,
         url: props.url.trim(),
         ...(props.width !== undefined && { width: props.width }),
-        ...(props.height !== undefined && { height: props.height }),
+        ...(props.height === undefined && { height: props.height }),
         ...(props.durationMs !== undefined && { durationMs: props.durationMs }),
         ...(props.fileSizeBytes !== undefined && { fileSizeBytes: props.fileSizeBytes }),
killedBy: tests/unit/domain/value-objects.test.ts
statusReason: Domain Value Objects > MediaAttachment > should calculate aspect ratio: should calculate aspect ratio

[Killed] ObjectLiteral
src/domain/value-objects/MediaAttachment.ts:176:43
         type: props.type,
         url: props.url.trim(),
         ...(props.width !== undefined && { width: props.width }),
-        ...(props.height !== undefined && { height: props.height }),
+        ...(props.height !== undefined && {}),
         ...(props.durationMs !== undefined && { durationMs: props.durationMs }),
         ...(props.fileSizeBytes !== undefined && { fileSizeBytes: props.fileSizeBytes }),
killedBy: tests/unit/domain/value-objects.test.ts
statusReason: Domain Value Objects > MediaAttachment > should calculate aspect ratio: should calculate aspect ratio

[Killed] EqualityOperator
src/domain/value-objects/MediaAttachment.ts:177:13
         url: props.url.trim(),
         ...(props.width !== undefined && { width: props.width }),
         ...(props.height !== undefined && { height: props.height }),
-        ...(props.durationMs !== undefined && { durationMs: props.durationMs }),
+        ...(props.durationMs === undefined && { durationMs: props.durationMs }),
         ...(props.fileSizeBytes !== undefined && { fileSizeBytes: props.fileSizeBytes }),
         ...(props.altText && { altText: props.altText.trim() }),
killedBy: tests/unit/domain/value-objects.test.ts
statusReason: Domain Value Objects > MediaAttachment > should create video attachment: should create video attachment

[Survived] EqualityOperator
src/domain/value-objects/MediaAttachment.ts:178:13
         ...(props.width !== undefined && { width: props.width }),
         ...(props.height !== undefined && { height: props.height }),
         ...(props.durationMs !== undefined && { durationMs: props.durationMs }),
-        ...(props.fileSizeBytes !== undefined && { fileSizeBytes: props.fileSizeBytes }),
+        ...(props.fileSizeBytes === undefined && { fileSizeBytes: props.fileSizeBytes }),
         ...(props.altText && { altText: props.altText.trim() }),
         ...(props.hash && { hash: props.hash }),

[Survived] MethodExpression
src/domain/value-objects/MediaAttachment.ts:179:41
         ...(props.height !== undefined && { height: props.height }),
         ...(props.durationMs !== undefined && { durationMs: props.durationMs }),
         ...(props.fileSizeBytes !== undefined && { fileSizeBytes: props.fileSizeBytes }),
-        ...(props.altText && { altText: props.altText.trim() }),
+        ...(props.altText && { altText: props.altText }),
         ...(props.hash && { hash: props.hash }),
       })

[Killed] ObjectLiteral
src/domain/value-objects/MediaAttachment.ts:179:30
         ...(props.height !== undefined && { height: props.height }),
         ...(props.durationMs !== undefined && { durationMs: props.durationMs }),
         ...(props.fileSizeBytes !== undefined && { fileSizeBytes: props.fileSizeBytes }),
-        ...(props.altText && { altText: props.altText.trim() }),
+        ...(props.altText && {}),
         ...(props.hash && { hash: props.hash }),
       })
killedBy: tests/unit/domain/value-objects.test.ts
statusReason: Domain Value Objects > MediaAttachment > should create image attachment: should create image attachment

[Killed] ConditionalExpression
src/domain/value-objects/MediaAttachment.ts:228:12
    * Check if this is a video
    */
   isVideo(): boolean {
-    return this._type === "video";
+    return false;
   }
 
killedBy: tests/unit/domain/value-objects.test.ts
statusReason: Domain Value Objects > MediaAttachment > should create video attachment: should create video attachment

[Killed] EqualityOperator
src/domain/value-objects/MediaAttachment.ts:228:12
    * Check if this is a video
    */
   isVideo(): boolean {
-    return this._type === "video";
+    return this._type !== "video";
   }
 
killedBy: tests/unit/domain/value-objects.test.ts
statusReason: Domain Value Objects > MediaAttachment > should create video attachment: should create video attachment

[Killed] EqualityOperator
src/domain/value-objects/MediaAttachment.ts:235:12
    * Check if this is an image
    */
   isImage(): boolean {
-    return this._type === "image";
+    return this._type !== "image";
   }
 
killedBy: tests/unit/domain/value-objects.test.ts
statusReason: Domain Value Objects > MediaAttachment > should create image attachment: should create image attachment

[Killed] ConditionalExpression
src/domain/value-objects/MediaAttachment.ts:235:12
    * Check if this is an image
    */
   isImage(): boolean {
-    return this._type === "image";
+    return false;
   }
 
killedBy: tests/unit/domain/value-objects.test.ts
statusReason: Domain Value Objects > MediaAttachment > should create image attachment: should create image attachment

[NoCoverage] EqualityOperator
src/domain/value-objects/MediaAttachment.ts:242:12
    * Check if this is a GIF
    */
   isGif(): boolean {
-    return this._type === "gif";
+    return this._type !== "gif";
   }
 

[NoCoverage] ConditionalExpression
src/domain/value-objects/MediaAttachment.ts:242:12
    * Check if this is a GIF
    */
   isGif(): boolean {
-    return this._type === "gif";
+    return false;
   }
 

[Killed] BlockStatement
src/domain/value-objects/MediaAttachment.ts:249:38
    * Calculate aspect ratio if dimensions are available
    */
   get aspectRatio(): number | undefined {
-    if (this._width && this._height) {
-      return this._width / this._height;
-    }
+    if (this._width && this._height) {}
     return undefined;
   }
killedBy: tests/unit/domain/value-objects.test.ts
statusReason: Domain Value Objects > MediaAttachment > should calculate aspect ratio: should calculate aspect ratio

[Killed] ArithmeticOperator
src/domain/value-objects/MediaAttachment.ts:250:14
    */
   get aspectRatio(): number | undefined {
     if (this._width && this._height) {
-      return this._width / this._height;
+      return this._width * this._height;
     }
     return undefined;
killedBy: tests/unit/domain/value-objects.test.ts
statusReason: Domain Value Objects > MediaAttachment > should calculate aspect ratio: should calculate aspect ratio

[Killed] BlockStatement
src/domain/value-objects/MediaAttachment.ts:262:59
     const constraints = PLATFORM_MEDIA_CONSTRAINTS[platform];
 
     // Check if type is supported
-    if (!constraints.supportedTypes.includes(this._type)) {
-      return err(
-        new InvalidValueError("type", this._type, `${platform} does not support ${this._type}. Supported types: ${constraints.supportedTypes.join(", ")}`)
-      );
-    }
+    if (!constraints.supportedTypes.includes(this._type)) {}
 
     // Check file size
killedBy: tests/unit/domain/value-objects.test.ts
statusReason: Domain Value Objects > MediaAttachment > should check platform compatibility: should check platform compatibility

[Killed] BooleanLiteral
src/domain/value-objects/MediaAttachment.ts:262:9
     const constraints = PLATFORM_MEDIA_CONSTRAINTS[platform];
 
     // Check if type is supported
-    if (!constraints.supportedTypes.includes(this._type)) {
+    if (constraints.supportedTypes.includes(this._type)) {
       return err(
         new InvalidValueError("type", this._type, `${platform} does not support ${this._type}. Supported types: ${constraints.supportedTypes.join(", ")}`)
killedBy: tests/unit/domain/value-objects.test.ts
statusReason: Domain Value Objects > MediaAttachment > should check platform compatibility: should check platform compatibility

[Survived] StringLiteral
src/domain/value-objects/MediaAttachment.ts:264:51
     // Check if type is supported
     if (!constraints.supportedTypes.includes(this._type)) {
       return err(
-        new InvalidValueError("type", this._type, `${platform} does not support ${this._type}. Supported types: ${constraints.supportedTypes.join(", ")}`)
+        new InvalidValueError("type", this._type, ``)
       );
     }

[Survived] StringLiteral
src/domain/value-objects/MediaAttachment.ts:264:31
     // Check if type is supported
     if (!constraints.supportedTypes.includes(this._type)) {
       return err(
-        new InvalidValueError("type", this._type, `${platform} does not support ${this._type}. Supported types: ${constraints.supportedTypes.join(", ")}`)
+        new InvalidValueError("", this._type, `${platform} does not support ${this._type}. Supported types: ${constraints.supportedTypes.join(", ")}`)
       );
     }

[NoCoverage] BlockStatement
src/domain/value-objects/MediaAttachment.ts:269:44
     }
 
     // Check file size
-    if (this._fileSizeBytes !== undefined) {
-      const maxSize = this._type === "image" && "maxImageSizeBytes" in constraints ? constraints.maxImageSizeBytes : constraints.maxFileSizeBytes;
-
-      if (this._fileSizeBytes > maxSize) {
-        return err(new InvalidValueError("fileSizeBytes", this._fileSizeBytes, `File size exceeds ${platform} limit of ${maxSize} bytes`));
-      }
-    }
+    if (this._fileSizeBytes !== undefined) {}
 
     // Check video duration

[NoCoverage] EqualityOperator
src/domain/value-objects/MediaAttachment.ts:270:23
 
     // Check file size
     if (this._fileSizeBytes !== undefined) {
-      const maxSize = this._type === "image" && "maxImageSizeBytes" in constraints ? constraints.maxImageSizeBytes : constraints.maxFileSizeBytes;
+      const maxSize = this._type !== "image" && "maxImageSizeBytes" in constraints ? constraints.maxImageSizeBytes : constraints.maxFileSizeBytes;
 
       if (this._fileSizeBytes > maxSize) {

[NoCoverage] ConditionalExpression
src/domain/value-objects/MediaAttachment.ts:270:23
 
     // Check file size
     if (this._fileSizeBytes !== undefined) {
-      const maxSize = this._type === "image" && "maxImageSizeBytes" in constraints ? constraints.maxImageSizeBytes : constraints.maxFileSizeBytes;
+      const maxSize = true && "maxImageSizeBytes" in constraints ? constraints.maxImageSizeBytes : constraints.maxFileSizeBytes;
 
       if (this._fileSizeBytes > maxSize) {

[NoCoverage] EqualityOperator
src/domain/value-objects/MediaAttachment.ts:272:11
     if (this._fileSizeBytes !== undefined) {
       const maxSize = this._type === "image" && "maxImageSizeBytes" in constraints ? constraints.maxImageSizeBytes : constraints.maxFileSizeBytes;
 
-      if (this._fileSizeBytes > maxSize) {
+      if (this._fileSizeBytes <= maxSize) {
         return err(new InvalidValueError("fileSizeBytes", this._fileSizeBytes, `File size exceeds ${platform} limit of ${maxSize} bytes`));
       }

[NoCoverage] EqualityOperator
src/domain/value-objects/MediaAttachment.ts:272:11
     if (this._fileSizeBytes !== undefined) {
       const maxSize = this._type === "image" && "maxImageSizeBytes" in constraints ? constraints.maxImageSizeBytes : constraints.maxFileSizeBytes;
 
-      if (this._fileSizeBytes > maxSize) {
+      if (this._fileSizeBytes >= maxSize) {
         return err(new InvalidValueError("fileSizeBytes", this._fileSizeBytes, `File size exceeds ${platform} limit of ${maxSize} bytes`));
       }

[Survived] ConditionalExpression
src/domain/value-objects/MediaAttachment.ts:278:9
     }
 
     // Check video duration
-    if (this._type === "video" && this._durationMs !== undefined) {
+    if (true && this._durationMs !== undefined) {
       if (this._durationMs > constraints.maxVideoDurationMs) {
         return err(

[Survived] EqualityOperator
src/domain/value-objects/MediaAttachment.ts:278:9
     }
 
     // Check video duration
-    if (this._type === "video" && this._durationMs !== undefined) {
+    if (this._type !== "video" && this._durationMs !== undefined) {
       if (this._durationMs > constraints.maxVideoDurationMs) {
         return err(

[NoCoverage] EqualityOperator
src/domain/value-objects/MediaAttachment.ts:279:11
 
     // Check video duration
     if (this._type === "video" && this._durationMs !== undefined) {
-      if (this._durationMs > constraints.maxVideoDurationMs) {
+      if (this._durationMs >= constraints.maxVideoDurationMs) {
         return err(
           new InvalidValueError("durationMs", this._durationMs, `Video duration exceeds ${platform} limit of ${constraints.maxVideoDurationMs}ms`)

[NoCoverage] EqualityOperator
src/domain/value-objects/MediaAttachment.ts:279:11
 
     // Check video duration
     if (this._type === "video" && this._durationMs !== undefined) {
-      if (this._durationMs > constraints.maxVideoDurationMs) {
+      if (this._durationMs <= constraints.maxVideoDurationMs) {
         return err(
           new InvalidValueError("durationMs", this._durationMs, `Video duration exceeds ${platform} limit of ${constraints.maxVideoDurationMs}ms`)

[NoCoverage] StringLiteral
src/domain/value-objects/MediaAttachment.ts:281:33
     if (this._type === "video" && this._durationMs !== undefined) {
       if (this._durationMs > constraints.maxVideoDurationMs) {
         return err(
-          new InvalidValueError("durationMs", this._durationMs, `Video duration exceeds ${platform} limit of ${constraints.maxVideoDurationMs}ms`)
+          new InvalidValueError("", this._durationMs, `Video duration exceeds ${platform} limit of ${constraints.maxVideoDurationMs}ms`)
         );
       }

[Survived] BooleanLiteral
src/domain/value-objects/MediaAttachment.ts:286:15
       }
     }
 
-    return ok(true);
+    return ok(false);
   }
 

[NoCoverage] ObjectLiteral
src/domain/value-objects/MediaAttachment.ts:297:40
       id: this._id,
       type: this._type,
       url: this._url,
-      ...(this._width !== undefined && { width: this._width }),
+      ...(this._width !== undefined && {}),
       ...(this._height !== undefined && { height: this._height }),
       ...(this._durationMs !== undefined && { durationMs: this._durationMs }),

[NoCoverage] ObjectLiteral
src/domain/value-objects/MediaAttachment.ts:298:41
       type: this._type,
       url: this._url,
       ...(this._width !== undefined && { width: this._width }),
-      ...(this._height !== undefined && { height: this._height }),
+      ...(this._height !== undefined && {}),
       ...(this._durationMs !== undefined && { durationMs: this._durationMs }),
       ...(this._fileSizeBytes !== undefined && { fileSizeBytes: this._fileSizeBytes }),

[NoCoverage] ObjectLiteral
src/domain/value-objects/MediaAttachment.ts:300:48
       ...(this._width !== undefined && { width: this._width }),
       ...(this._height !== undefined && { height: this._height }),
       ...(this._durationMs !== undefined && { durationMs: this._durationMs }),
-      ...(this._fileSizeBytes !== undefined && { fileSizeBytes: this._fileSizeBytes }),
+      ...(this._fileSizeBytes !== undefined && {}),
       altText: altText.trim(),
       ...(this._hash && { hash: this._hash }),

[NoCoverage] MethodExpression
src/domain/value-objects/MediaAttachment.ts:301:16
       ...(this._height !== undefined && { height: this._height }),
       ...(this._durationMs !== undefined && { durationMs: this._durationMs }),
       ...(this._fileSizeBytes !== undefined && { fileSizeBytes: this._fileSizeBytes }),
-      altText: altText.trim(),
+      altText: altText,
       ...(this._hash && { hash: this._hash }),
     });

[NoCoverage] ConditionalExpression
src/domain/value-objects/MediaAttachment.ts:318:11
       id: this._id.toString(),
       type: this._type,
       url: this._url,
-      ...(this._width !== undefined && { width: this._width }),
+      ...(true && { width: this._width }),
       ...(this._height !== undefined && { height: this._height }),
       ...(this._durationMs !== undefined && { durationMs: this._durationMs }),

[NoCoverage] EqualityOperator
src/domain/value-objects/MediaAttachment.ts:318:11
       id: this._id.toString(),
       type: this._type,
       url: this._url,
-      ...(this._width !== undefined && { width: this._width }),
+      ...(this._width === undefined && { width: this._width }),
       ...(this._height !== undefined && { height: this._height }),
       ...(this._durationMs !== undefined && { durationMs: this._durationMs }),

[NoCoverage] ConditionalExpression
src/domain/value-objects/MediaAttachment.ts:319:11
       type: this._type,
       url: this._url,
       ...(this._width !== undefined && { width: this._width }),
-      ...(this._height !== undefined && { height: this._height }),
+      ...(true && { height: this._height }),
       ...(this._durationMs !== undefined && { durationMs: this._durationMs }),
       ...(this._fileSizeBytes !== undefined && { fileSizeBytes: this._fileSizeBytes }),

[NoCoverage] EqualityOperator
src/domain/value-objects/MediaAttachment.ts:319:11
       type: this._type,
       url: this._url,
       ...(this._width !== undefined && { width: this._width }),
-      ...(this._height !== undefined && { height: this._height }),
+      ...(this._height === undefined && { height: this._height }),
       ...(this._durationMs !== undefined && { durationMs: this._durationMs }),
       ...(this._fileSizeBytes !== undefined && { fileSizeBytes: this._fileSizeBytes }),

[NoCoverage] ConditionalExpression
src/domain/value-objects/MediaAttachment.ts:320:11
       url: this._url,
       ...(this._width !== undefined && { width: this._width }),
       ...(this._height !== undefined && { height: this._height }),
-      ...(this._durationMs !== undefined && { durationMs: this._durationMs }),
+      ...(true && { durationMs: this._durationMs }),
       ...(this._fileSizeBytes !== undefined && { fileSizeBytes: this._fileSizeBytes }),
       ...(this._altText && { altText: this._altText }),

[NoCoverage] EqualityOperator
src/domain/value-objects/MediaAttachment.ts:320:11
       url: this._url,
       ...(this._width !== undefined && { width: this._width }),
       ...(this._height !== undefined && { height: this._height }),
-      ...(this._durationMs !== undefined && { durationMs: this._durationMs }),
+      ...(this._durationMs === undefined && { durationMs: this._durationMs }),
       ...(this._fileSizeBytes !== undefined && { fileSizeBytes: this._fileSizeBytes }),
       ...(this._altText && { altText: this._altText }),

[NoCoverage] ConditionalExpression
src/domain/value-objects/MediaAttachment.ts:321:11
       ...(this._width !== undefined && { width: this._width }),
       ...(this._height !== undefined && { height: this._height }),
       ...(this._durationMs !== undefined && { durationMs: this._durationMs }),
-      ...(this._fileSizeBytes !== undefined && { fileSizeBytes: this._fileSizeBytes }),
+      ...(true && { fileSizeBytes: this._fileSizeBytes }),
       ...(this._altText && { altText: this._altText }),
       ...(this._hash && { hash: this._hash }),
