[NoCoverage] BlockStatement
src/domain/events/DomainEvent.ts:39:19
     this.eventId = randomUUID();
     this.occurredAt = new Date();
     this.version = version;
-    if (metadata) {
-      (this as { metadata?: Record<string, unknown> }).metadata = metadata;
-    }
+    if (metadata) {}
   }
 

[Killed] BlockStatement
src/domain/events/DomainEvent.ts:87:92
 export class InMemoryEventDispatcher implements EventDispatcher {
   private handlers: Map<string, DomainEventHandler<DomainEvent>[]> = new Map();
 
-  register<T extends DomainEvent>(eventType: string, handler: DomainEventHandler<T>): void {
-    const existing = this.handlers.get(eventType) ?? [];
-    existing.push(handler as DomainEventHandler<DomainEvent>);
-    this.handlers.set(eventType, existing);
-  }
+  register<T extends DomainEvent>(eventType: string, handler: DomainEventHandler<T>): void {}
 
   async dispatch(event: DomainEvent): Promise<void> {
killedBy: tests/unit/domain/aggregates.test.ts
statusReason: Domain Aggregates & Events > Event Dispatcher > should dispatch events to handlers: should dispatch events to handlers

[Killed] BlockStatement
src/domain/events/DomainEvent.ts:93:53
     this.handlers.set(eventType, existing);
   }
 
-  async dispatch(event: DomainEvent): Promise<void> {
-    const handlers = this.handlers.get(event.eventType) ?? [];
-    await Promise.all(handlers.map((handler) => handler.handle(event)));
-  }
+  async dispatch(event: DomainEvent): Promise<void> {}
 
   async dispatchAll(events: DomainEvent[]): Promise<void> {
killedBy: tests/unit/domain/aggregates.test.ts
statusReason: Domain Aggregates & Events > Event Dispatcher > should dispatch events to handlers: should dispatch events to handlers

[Killed] ArrowFunction
src/domain/events/DomainEvent.ts:95:36
 
   async dispatch(event: DomainEvent): Promise<void> {
     const handlers = this.handlers.get(event.eventType) ?? [];
-    await Promise.all(handlers.map((handler) => handler.handle(event)));
+    await Promise.all(handlers.map(() => undefined));
   }
 
killedBy: tests/unit/domain/aggregates.test.ts
statusReason: Domain Aggregates & Events > Event Dispatcher > should dispatch events to handlers: should dispatch events to handlers

[Killed] BlockStatement
src/domain/events/DomainEvent.ts:98:59
     await Promise.all(handlers.map((handler) => handler.handle(event)));
   }
 
-  async dispatchAll(events: DomainEvent[]): Promise<void> {
-    for (const event of events) {
-      await this.dispatch(event);
-    }
-  }
+  async dispatchAll(events: DomainEvent[]): Promise<void> {}
 }
 
killedBy: tests/unit/domain/aggregates.test.ts
statusReason: Domain Aggregates & Events > Event Dispatcher > should dispatch events to handlers: should dispatch events to handlers

[Killed] BlockStatement
src/domain/events/DomainEvent.ts:99:33
   }
 
   async dispatchAll(events: DomainEvent[]): Promise<void> {
-    for (const event of events) {
-      await this.dispatch(event);
-    }
+    for (const event of events) {}
   }
 }
killedBy: tests/unit/domain/aggregates.test.ts
statusReason: Domain Aggregates & Events > Event Dispatcher > should dispatch events to handlers: should dispatch events to handlers
