[Killed] StringLiteral
src/domain/errors/DomainError.ts:44:20
   public readonly value: unknown;
 
   constructor(field: string, value: unknown, message: string) {
-    super(message, "INVALID_VALUE");
+    super(message, "");
     this.field = field;
     this.value = value;
killedBy: tests/unit/domain/domain-errors.test.ts
statusReason: Domain Errors > DomainError (base class) > should provide error code on all domain errors: should provide error code on all domain errors

[Killed] StringLiteral
src/domain/errors/DomainError.ts:63:11
   public readonly field: string;
 
   constructor(field: string) {
-    super(`${field} cannot be empty`, "EMPTY_VALUE");
+    super(``, "EMPTY_VALUE");
     this.field = field;
   }
killedBy: tests/unit/domain/domain-errors.test.ts
statusReason: Domain Errors > EmptyValueError > should create error with field name: should create error with field name

[Killed] StringLiteral
src/domain/errors/DomainError.ts:74:84
   public readonly actualLength: number;
 
   constructor(field: string, maxLength: number, actualLength: number) {
-    super(`${field} exceeds maximum length of ${maxLength} (was ${actualLength})`, "VALUE_TOO_LONG");
+    super(`${field} exceeds maximum length of ${maxLength} (was ${actualLength})`, "");
     this.field = field;
     this.maxLength = maxLength;
killedBy: tests/unit/domain/domain-errors.test.ts
statusReason: Domain Errors > ValueTooLongError > should create error with field, maxLength, and actualLength: should create error with field, maxLength, and actualLength

[Killed] StringLiteral
src/domain/errors/DomainError.ts:89:78
   public readonly toState: string;
 
   constructor(fromState: string, toState: string, entityType: string) {
-    super(`Cannot transition ${entityType} from ${fromState} to ${toState}`, "INVALID_STATE_TRANSITION");
+    super(`Cannot transition ${entityType} from ${fromState} to ${toState}`, "");
     this.fromState = fromState;
     this.toState = toState;
killedBy: tests/unit/domain/domain-errors.test.ts
statusReason: Domain Errors > InvalidStateTransitionError > should create error with state transition info: should create error with state transition info

[Killed] StringLiteral
src/domain/errors/DomainError.ts:100:11
   public readonly entityId: string;
 
   constructor(entityType: string, entityId: string) {
-    super(`${entityType} with id "${entityId}" not found`, "ENTITY_NOT_FOUND");
+    super(``, "ENTITY_NOT_FOUND");
     this.entityType = entityType;
     this.entityId = entityId;
killedBy: tests/unit/domain/domain-errors.test.ts
statusReason: Domain Errors > EntityNotFoundError > should format message correctly: should format message correctly

[Killed] StringLiteral
src/domain/errors/DomainError.ts:100:60
   public readonly entityId: string;
 
   constructor(entityType: string, entityId: string) {
-    super(`${entityType} with id "${entityId}" not found`, "ENTITY_NOT_FOUND");
+    super(`${entityType} with id "${entityId}" not found`, "");
     this.entityType = entityType;
     this.entityId = entityId;
killedBy: tests/unit/domain/domain-errors.test.ts
statusReason: Domain Errors > EntityNotFoundError > should create error with entityType and entityId: should create error with entityType and entityId

[Killed] StringLiteral
src/domain/errors/DomainError.ts:110:47
   public readonly invariant: string;
 
   constructor(invariant: string) {
-    super(`Invariant violated: ${invariant}`, "INVARIANT_VIOLATION");
+    super(`Invariant violated: ${invariant}`, "");
     this.invariant = invariant;
   }
killedBy: tests/unit/domain/domain-errors.test.ts
statusReason: Domain Errors > InvariantViolationError > should create error with invariant description: should create error with invariant description
