[Survived] StringLiteral
src/billing/handlers/SubscriptionTrialHandler.ts:20:25
 } from "../subscriptionSchemas.js";
 
 export class SubscriptionTrialHandler extends BaseRouteHandler {
-  protected routeName = "subscription-trial";
+  protected routeName = "";
 
   constructor(private readonly subscriptionService: SubscriptionService) {

[Killed] ObjectLiteral
src/billing/handlers/SubscriptionTrialHandler.ts:32:13
     const validated = await this.validateRequest<{
       params: z.infer<typeof ParamsWithAccountIdSchema>;
       body: z.infer<typeof StartTrialSchema>;
-    }>(ctx, {
-      params: ParamsWithAccountIdSchema,
-      body: StartTrialSchema,
-    });
+    }>(ctx, {});
 
     if (!validated.ok) {
killedBy: subscriptionRoutes - Trials, Reporting and Auto-Renewals POST /admin/billing/accounts/:accountId/trial/start should start trial for account
statusReason: expected 500 to be 200 // Object.is equality

[Killed] ConditionalExpression
src/billing/handlers/SubscriptionTrialHandler.ts:37:9
       body: StartTrialSchema,
     });
 
-    if (!validated.ok) {
+    if (false) {
       return this.sendError(ctx, 400, "Invalid request parameters");
     }
killedBy: subscriptionRoutes - Trials, Reporting and Auto-Renewals POST /admin/billing/accounts/:accountId/trial/start should reject invalid trial duration
statusReason: expected 500 to be 400 // Object.is equality

[Survived] OptionalChaining
src/billing/handlers/SubscriptionTrialHandler.ts:43:29
 
     const { accountId } = validated.value.params;
     const trialRequest = validated.value.body;
-    const startedByUserId = request.user?.id;
+    const startedByUserId = request.user.id;
 
     const result = await this.subscriptionService.startTrial(

[NoCoverage] BlockStatement
src/billing/handlers/SubscriptionTrialHandler.ts:57:48
       if (result.error === "NOT_FOUND") {
         return this.sendError(ctx, 404, "Account not found");
       }
-      if (result.error === "ALREADY_ON_TRIAL") {
-        return this.sendError(ctx, 409, "Account is already on trial");
-      }
+      if (result.error === "ALREADY_ON_TRIAL") {}
       if (result.error === "TRIAL_EXPIRED") {
         return this.sendError(ctx, 409, "Trial has already expired for this account");

[NoCoverage] ConditionalExpression
src/billing/handlers/SubscriptionTrialHandler.ts:57:11
       if (result.error === "NOT_FOUND") {
         return this.sendError(ctx, 404, "Account not found");
       }
-      if (result.error === "ALREADY_ON_TRIAL") {
+      if (false) {
         return this.sendError(ctx, 409, "Account is already on trial");
       }

[NoCoverage] StringLiteral
src/billing/handlers/SubscriptionTrialHandler.ts:58:41
         return this.sendError(ctx, 404, "Account not found");
       }
       if (result.error === "ALREADY_ON_TRIAL") {
-        return this.sendError(ctx, 409, "Account is already on trial");
+        return this.sendError(ctx, 409, "");
       }
       if (result.error === "TRIAL_EXPIRED") {

[NoCoverage] EqualityOperator
src/billing/handlers/SubscriptionTrialHandler.ts:60:11
       if (result.error === "ALREADY_ON_TRIAL") {
         return this.sendError(ctx, 409, "Account is already on trial");
       }
-      if (result.error === "TRIAL_EXPIRED") {
+      if (result.error !== "TRIAL_EXPIRED") {
         return this.sendError(ctx, 409, "Trial has already expired for this account");
       }

[NoCoverage] ConditionalExpression
src/billing/handlers/SubscriptionTrialHandler.ts:60:11
       if (result.error === "ALREADY_ON_TRIAL") {
         return this.sendError(ctx, 409, "Account is already on trial");
       }
-      if (result.error === "TRIAL_EXPIRED") {
+      if (true) {
         return this.sendError(ctx, 409, "Trial has already expired for this account");
       }

[Survived] StringLiteral
src/billing/handlers/SubscriptionTrialHandler.ts:66:23
       return this.sendError(ctx, 500, "Internal server error");
     }
 
-    this.logInfo(ctx, "Started trial", {
+    this.logInfo(ctx, "", {
       accountId,
       trialDurationDays: trialRequest.trialDurationDays,

[NoCoverage] OptionalChaining
src/billing/handlers/SubscriptionTrialHandler.ts:94:27
 
     const { accountId } = validated.value.params;
     const { reason } = validated.value.body;
-    const endedByUserId = request.user?.id;
+    const endedByUserId = request.user.id;
 
     const result = await this.subscriptionService.endTrial(accountId, reason, endedByUserId);

[NoCoverage] BlockStatement
src/billing/handlers/SubscriptionTrialHandler.ts:98:21
 
     const result = await this.subscriptionService.endTrial(accountId, reason, endedByUserId);
 
-    if (!result.ok) {
-      if (result.error === "NOT_FOUND") {
-        return this.sendError(ctx, 404, "Account not found");
-      }
-      if (result.error === "NOT_ON_TRIAL") {
-        return this.sendError(ctx, 409, "Account is not on trial");
-      }
-      return this.sendError(ctx, 500, "Internal server error");
-    }
+    if (!result.ok) {}
 
     this.logInfo(ctx, "Ended trial", { accountId, reason });

[NoCoverage] ConditionalExpression
src/billing/handlers/SubscriptionTrialHandler.ts:102:11
       if (result.error === "NOT_FOUND") {
         return this.sendError(ctx, 404, "Account not found");
       }
-      if (result.error === "NOT_ON_TRIAL") {
+      if (false) {
         return this.sendError(ctx, 409, "Account is not on trial");
       }

[NoCoverage] EqualityOperator
src/billing/handlers/SubscriptionTrialHandler.ts:102:11
       if (result.error === "NOT_FOUND") {
         return this.sendError(ctx, 404, "Account not found");
       }
-      if (result.error === "NOT_ON_TRIAL") {
+      if (result.error !== "NOT_ON_TRIAL") {
         return this.sendError(ctx, 409, "Account is not on trial");
       }

[NoCoverage] StringLiteral
src/billing/handlers/SubscriptionTrialHandler.ts:105:39
       if (result.error === "NOT_ON_TRIAL") {
         return this.sendError(ctx, 409, "Account is not on trial");
       }
-      return this.sendError(ctx, 500, "Internal server error");
+      return this.sendError(ctx, 500, "");
     }
 

[NoCoverage] ObjectLiteral
src/billing/handlers/SubscriptionTrialHandler.ts:108:38
       return this.sendError(ctx, 500, "Internal server error");
     }
 
-    this.logInfo(ctx, "Ended trial", { accountId, reason });
+    this.logInfo(ctx, "Ended trial", {});
     return this.sendSuccess(ctx, {
       subscription: result.value,

[NoCoverage] StringLiteral
src/billing/handlers/SubscriptionTrialHandler.ts:111:16
     this.logInfo(ctx, "Ended trial", { accountId, reason });
     return this.sendSuccess(ctx, {
       subscription: result.value,
-      message: "Trial ended successfully",
+      message: "",
       timestamp: new Date().toISOString(),
     });

[NoCoverage] OptionalChaining
src/billing/handlers/SubscriptionTrialHandler.ts:133:31
 
     const { accountId } = validated.value.params;
     const { billingCycle } = validated.value.body;
-    const convertedByUserId = request.user?.id;
+    const convertedByUserId = request.user.id;
 
     const result = await this.subscriptionService.convertTrialToPaid(

[NoCoverage] ConditionalExpression
src/billing/handlers/SubscriptionTrialHandler.ts:145:11
       if (result.error === "NOT_FOUND") {
         return this.sendError(ctx, 404, "Account not found");
       }
-      if (result.error === "NOT_ON_TRIAL") {
+      if (true) {
         return this.sendError(ctx, 409, "Account is not on trial");
       }

[NoCoverage] StringLiteral
src/billing/handlers/SubscriptionTrialHandler.ts:146:41
         return this.sendError(ctx, 404, "Account not found");
       }
       if (result.error === "NOT_ON_TRIAL") {
-        return this.sendError(ctx, 409, "Account is not on trial");
+        return this.sendError(ctx, 409, "");
       }
       return this.sendError(ctx, 500, "Internal server error");

[NoCoverage] StringLiteral
src/billing/handlers/SubscriptionTrialHandler.ts:151:23
       return this.sendError(ctx, 500, "Internal server error");
     }
 
-    this.logInfo(ctx, "Converted trial", { accountId, billingCycle });
+    this.logInfo(ctx, "", { accountId, billingCycle });
     return this.sendSuccess(ctx, {
       subscription: result.value,

[Killed] ObjectLiteral
src/billing/handlers/SubscriptionTrialHandler.ts:160:31
   }
 
   async getExpiringTrials(request: FastifyRequest, reply: FastifyReply): Promise<void> {
-    const ctx: RouteContext = { request, reply };
+    const ctx: RouteContext = {};
 
     const validated = await this.validateRequest<{
killedBy: subscriptionRoutes - Trials, Reporting and Auto-Renewals GET /admin/billing/trials/expiring should get expiring trials
statusReason: expected 500 to be 200 // Object.is equality

[Survived] StringLiteral
src/billing/handlers/SubscriptionTrialHandler.ts:169:39
     });
 
     if (!validated.ok) {
-      return this.sendError(ctx, 400, "Invalid query parameters");
+      return this.sendError(ctx, 400, "");
     }
 

[Killed] BlockStatement
src/billing/handlers/SubscriptionTrialHandler.ts:188:90
     });
   }
 
-  async processAutoRenewals(request: FastifyRequest, reply: FastifyReply): Promise<void> {
-    const ctx: RouteContext = { request, reply };
-
-    const result = await this.subscriptionService.processAutoRenewals();
-
-    if (!result.ok) {
-      return this.sendError(ctx, 500, "Failed to process auto-renewals");
-    }
-
-    this.logInfo(ctx, "Processed auto-renewals", {
-      processed: result.value.processed,
-      failed: result.value.failed,
-    });
-    return this.sendSuccess(ctx, {
-      processed: result.value.processed,
-      failed: result.value.failed,
-      message: "Auto-renewals processed",
-      timestamp: new Date().toISOString(),
-    });
-  }
+  async processAutoRenewals(request: FastifyRequest, reply: FastifyReply): Promise<void> {}
 
   async getTrialStats(request: FastifyRequest, reply: FastifyReply): Promise<void> {
killedBy: subscriptionRoutes - Trials, Reporting and Auto-Renewals POST /admin/billing/auto-renewals/process should process auto-renewals with super admin
statusReason: Unexpected end of JSON input

[NoCoverage] StringLiteral
src/billing/handlers/SubscriptionTrialHandler.ts:194:39
     const result = await this.subscriptionService.processAutoRenewals();
 
     if (!result.ok) {
-      return this.sendError(ctx, 500, "Failed to process auto-renewals");
+      return this.sendError(ctx, 500, "");
     }
 

[Survived] StringLiteral
src/billing/handlers/SubscriptionTrialHandler.ts:204:16
     return this.sendSuccess(ctx, {
       processed: result.value.processed,
       failed: result.value.failed,
-      message: "Auto-renewals processed",
+      message: "",
       timestamp: new Date().toISOString(),
     });

[Killed] ObjectLiteral
src/billing/handlers/SubscriptionTrialHandler.ts:210:31
   }
 
   async getTrialStats(request: FastifyRequest, reply: FastifyReply): Promise<void> {
-    const ctx: RouteContext = { request, reply };
+    const ctx: RouteContext = {};
 
     const { prisma } = await import("@infra/prisma");
killedBy: subscriptionRoutes - Trials, Reporting and Auto-Renewals GET /admin/billing/trials/stats should get trial statistics
statusReason: expected 500 to be 200 // Object.is equality

[Survived] ArithmeticOperator
src/billing/handlers/SubscriptionTrialHandler.ts:214:52
 
     const { prisma } = await import("@infra/prisma");
     const now = new Date();
-    const thirtyDaysAgo = new Date(now.getTime() - 30 * 24 * 60 * 60 * 1000);
+    const thirtyDaysAgo = new Date(now.getTime() - 30 * 24 * 60 / 60 * 1000);
 
     const [totalTrials, activeTrials, expiredTrials, convertedTrials, trialsStartedThisMonth] =

[Survived] ArithmeticOperator
src/billing/handlers/SubscriptionTrialHandler.ts:214:52
 
     const { prisma } = await import("@infra/prisma");
     const now = new Date();
-    const thirtyDaysAgo = new Date(now.getTime() - 30 * 24 * 60 * 60 * 1000);
+    const thirtyDaysAgo = new Date(now.getTime() - 30 * 24 / 60 * 60 * 1000);
 
     const [totalTrials, activeTrials, expiredTrials, convertedTrials, trialsStartedThisMonth] =

[Survived] ObjectLiteral
src/billing/handlers/SubscriptionTrialHandler.ts:218:30
 
     const [totalTrials, activeTrials, expiredTrials, convertedTrials, trialsStartedThisMonth] =
       await Promise.all([
-        prisma.account.count({
-          where: { isOnTrial: true },
-        }),
+        prisma.account.count({}),
         prisma.account.count({
           where: {

[Survived] BooleanLiteral
src/billing/handlers/SubscriptionTrialHandler.ts:219:31
     const [totalTrials, activeTrials, expiredTrials, convertedTrials, trialsStartedThisMonth] =
       await Promise.all([
         prisma.account.count({
-          where: { isOnTrial: true },
+          where: { isOnTrial: false },
         }),
         prisma.account.count({

[Survived] BooleanLiteral
src/billing/handlers/SubscriptionTrialHandler.ts:223:24
         }),
         prisma.account.count({
           where: {
-            isOnTrial: true,
+            isOnTrial: false,
             trialEndDate: { gte: now },
           },

[Survived] ObjectLiteral
src/billing/handlers/SubscriptionTrialHandler.ts:227:30
             trialEndDate: { gte: now },
           },
         }),
-        prisma.account.count({
-          where: {
-            isOnTrial: true,
-            trialEndDate: { lt: now },
-          },
-        }),
+        prisma.account.count({}),
         prisma.account.count({
           where: {

[Survived] ObjectLiteral
src/billing/handlers/SubscriptionTrialHandler.ts:228:18
           },
         }),
         prisma.account.count({
-          where: {
-            isOnTrial: true,
-            trialEndDate: { lt: now },
-          },
+          where: {},
         }),
         prisma.account.count({

[Survived] BooleanLiteral
src/billing/handlers/SubscriptionTrialHandler.ts:235:24
         }),
         prisma.account.count({
           where: {
-            isOnTrial: false,
+            isOnTrial: true,
             trialEndDate: { not: null },
           },

[Survived] ObjectLiteral
src/billing/handlers/SubscriptionTrialHandler.ts:241:29
         }),
         prisma.account.count({
           where: {
-            trialStartDate: { gte: thirtyDaysAgo },
+            trialStartDate: {},
           },
         }),

[Survived] EqualityOperator
src/billing/handlers/SubscriptionTrialHandler.ts:247:7
       ]);
 
     const conversionRate =
-      totalTrials > 0 ? Math.round((convertedTrials / (totalTrials + convertedTrials)) * 100) : 0;
+      totalTrials >= 0 ? Math.round((convertedTrials / (totalTrials + convertedTrials)) * 100) : 0;
 
     this.logInfo(ctx, "Retrieved trial statistics", {

[NoCoverage] ArithmeticOperator
src/billing/handlers/SubscriptionTrialHandler.ts:247:36
       ]);
 
     const conversionRate =
-      totalTrials > 0 ? Math.round((convertedTrials / (totalTrials + convertedTrials)) * 100) : 0;
+      totalTrials > 0 ? Math.round(convertedTrials / (totalTrials + convertedTrials) / 100) : 0;
 
     this.logInfo(ctx, "Retrieved trial statistics", {

[Survived] ObjectLiteral
src/billing/handlers/SubscriptionTrialHandler.ts:249:53
     const conversionRate =
       totalTrials > 0 ? Math.round((convertedTrials / (totalTrials + convertedTrials)) * 100) : 0;
 
-    this.logInfo(ctx, "Retrieved trial statistics", {
-      totalTrials,
-      activeTrials,
-      conversionRate,
-    });
+    this.logInfo(ctx, "Retrieved trial statistics", {});
 
     return this.sendSuccess(ctx, {

[Survived] StringLiteral
src/billing/handlers/SubscriptionTrialHandler.ts:249:23
     const conversionRate =
       totalTrials > 0 ? Math.round((convertedTrials / (totalTrials + convertedTrials)) * 100) : 0;
 
-    this.logInfo(ctx, "Retrieved trial statistics", {
+    this.logInfo(ctx, "", {
       totalTrials,
       activeTrials,

[Killed] ObjectLiteral
src/billing/handlers/SubscriptionTrialHandler.ts:255:34
       conversionRate,
     });
 
-    return this.sendSuccess(ctx, {
-      stats: {
-        totalTrials,
-        activeTrials,
-        expiredTrials,
-        convertedTrials,
-        trialsStartedThisMonth,
-        conversionRate,
-        expiringIn24Hours: 0,
-      },
-      timestamp: new Date().toISOString(),
-    });
+    return this.sendSuccess(ctx, {});
   }
 }
killedBy: subscriptionRoutes - Trials, Reporting and Auto-Renewals GET /admin/billing/trials/stats should get trial statistics
statusReason: expected undefined to be truthy
