[Timeout] BlockStatement
src/billing/subscription/BillingService.ts:12:17
  * Service responsible for billing events, invoices, and payment logic
  */
 export class BillingService extends AuditableService {
-  constructor() {
-    super("BillingService");
-  }
+  constructor() {}
 
   /**

[Timeout] StringLiteral
src/billing/subscription/BillingService.ts:13:11
  */
 export class BillingService extends AuditableService {
   constructor() {
-    super("BillingService");
+    super("");
   }
 

[Killed] BlockStatement
src/billing/subscription/BillingService.ts:19:93
   /**
    * Get change type for billing events
    */
-  getChangeType(fromTier: SubscriptionTier, toTier: SubscriptionTier): BillingEvent["type"] {
-    const tierOrder = { BASIC: 1, PRO: 2, ENTERPRISE: 3 };
-    return tierOrder[toTier] > tierOrder[fromTier] ? "UPGRADE" : "DOWNGRADE";
-  }
+  getChangeType(fromTier: SubscriptionTier, toTier: SubscriptionTier): BillingEvent["type"] {}
 
   /**
killedBy: BillingService getChangeType returns UPGRADE when moving from BASIC to PRO
statusReason: Expected values to be strictly equal:
+ actual - expected

+ undefined
- 'UPGRADE'

[Killed] EqualityOperator
src/billing/subscription/BillingService.ts:21:12
    */
   getChangeType(fromTier: SubscriptionTier, toTier: SubscriptionTier): BillingEvent["type"] {
     const tierOrder = { BASIC: 1, PRO: 2, ENTERPRISE: 3 };
-    return tierOrder[toTier] > tierOrder[fromTier] ? "UPGRADE" : "DOWNGRADE";
+    return tierOrder[toTier] >= tierOrder[fromTier] ? "UPGRADE" : "DOWNGRADE";
   }
 
killedBy: BillingService getChangeType returns DOWNGRADE when same tier (not strictly upgrade)
statusReason: Expected values to be strictly equal:
+ actual - expected

+ 'UPGRADE'
- 'DOWNGRADE'

[Killed] EqualityOperator
src/billing/subscription/BillingService.ts:21:12
    */
   getChangeType(fromTier: SubscriptionTier, toTier: SubscriptionTier): BillingEvent["type"] {
     const tierOrder = { BASIC: 1, PRO: 2, ENTERPRISE: 3 };
-    return tierOrder[toTier] > tierOrder[fromTier] ? "UPGRADE" : "DOWNGRADE";
+    return tierOrder[toTier] <= tierOrder[fromTier] ? "UPGRADE" : "DOWNGRADE";
   }
 
killedBy: BillingService getChangeType returns UPGRADE when moving from BASIC to PRO
statusReason: Expected values to be strictly equal:
+ actual - expected

+ 'DOWNGRADE'
- 'UPGRADE'

[Survived] ConditionalExpression
src/billing/subscription/BillingService.ts:32:17
       id: crypto.randomUUID(),
       timestamp: new Date(),
       ...event,
-      currency: event.currency || "USD",
+      currency: true,
     };
 

[Survived] LogicalOperator
src/billing/subscription/BillingService.ts:32:17
       id: crypto.randomUUID(),
       timestamp: new Date(),
       ...event,
-      currency: event.currency || "USD",
+      currency: event.currency && "USD",
     };
 

[Survived] BlockStatement
src/billing/subscription/BillingService.ts:39:28
     log.info({ billingEvent }, "Billing event logged");
 
     // Use logAccountAction for billing events
-    if (event.processedBy) {
-      // Convert BillingEvent to plain object for details
-      const eventDetails: Record<string, unknown> = {
-        type: billingEvent.type,
-        fromTier: billingEvent.fromTier,
-        toTier: billingEvent.toTier,
-        amount: billingEvent.amount,
-        currency: billingEvent.currency,
-        reason: billingEvent.reason,
-        metadata: billingEvent.metadata,
-      };
-
-      await this.logAccountAction(event.processedBy, {
-        accountId: event.accountId,
-        action: `BILLING_${event.type}`,
-        category: "ACCOUNT",
-        severity: "MEDIUM",
-        details: eventDetails,
-      });
-    }
+    if (event.processedBy) {}
   }
 

[Survived] ConditionalExpression
src/billing/subscription/BillingService.ts:39:9
     log.info({ billingEvent }, "Billing event logged");
 
     // Use logAccountAction for billing events
-    if (event.processedBy) {
+    if (true) {
       // Convert BillingEvent to plain object for details
       const eventDetails: Record<string, unknown> = {

[Killed] BlockStatement
src/billing/subscription/BillingService.ts:64:99
   /**
    * Calculate next billing date
    */
-  calculateNextBillingDate(billingCycle: "monthly" | "yearly", fromDate: Date = new Date()): Date {
-    const nextBilling = new Date(fromDate);
-
-    if (billingCycle === "yearly") {
-      nextBilling.setFullYear(nextBilling.getFullYear() + 1);
-    } else {
-      nextBilling.setMonth(nextBilling.getMonth() + 1);
-    }
-
-    return nextBilling;
-  }
+  calculateNextBillingDate(billingCycle: "monthly" | "yearly", fromDate: Date = new Date()): Date {}
 
   /**
killedBy: BillingService calculateNextBillingDate adds 1 month for monthly billing cycle
statusReason: Cannot read properties of undefined (reading 'getMonth')

[Killed] ConditionalExpression
src/billing/subscription/BillingService.ts:67:9
   calculateNextBillingDate(billingCycle: "monthly" | "yearly", fromDate: Date = new Date()): Date {
     const nextBilling = new Date(fromDate);
 
-    if (billingCycle === "yearly") {
+    if (false) {
       nextBilling.setFullYear(nextBilling.getFullYear() + 1);
     } else {
killedBy: BillingService calculateNextBillingDate adds 1 year for yearly billing cycle
statusReason: Expected values to be strictly equal:

2025 !== 2026

[Killed] BlockStatement
src/billing/subscription/BillingService.ts:67:36
   calculateNextBillingDate(billingCycle: "monthly" | "yearly", fromDate: Date = new Date()): Date {
     const nextBilling = new Date(fromDate);
 
-    if (billingCycle === "yearly") {
-      nextBilling.setFullYear(nextBilling.getFullYear() + 1);
-    } else {
+    if (billingCycle === "yearly") {} else {
       nextBilling.setMonth(nextBilling.getMonth() + 1);
     }
killedBy: BillingService calculateNextBillingDate adds 1 year for yearly billing cycle
statusReason: Expected values to be strictly equal:

2025 !== 2026

[Killed] ArithmeticOperator
src/billing/subscription/BillingService.ts:68:31
     const nextBilling = new Date(fromDate);
 
     if (billingCycle === "yearly") {
-      nextBilling.setFullYear(nextBilling.getFullYear() + 1);
+      nextBilling.setFullYear(nextBilling.getFullYear() - 1);
     } else {
       nextBilling.setMonth(nextBilling.getMonth() + 1);
killedBy: BillingService calculateNextBillingDate adds 1 year for yearly billing cycle
statusReason: Expected values to be strictly equal:

2024 !== 2026

[Killed] MethodExpression
src/billing/subscription/BillingService.ts:68:7
     const nextBilling = new Date(fromDate);
 
     if (billingCycle === "yearly") {
-      nextBilling.setFullYear(nextBilling.getFullYear() + 1);
+      nextBilling.setMonth(nextBilling.getFullYear() + 1);
     } else {
       nextBilling.setMonth(nextBilling.getMonth() + 1);
killedBy: BillingService calculateNextBillingDate adds 1 year for yearly billing cycle
statusReason: Expected values to be strictly equal:

2193 !== 2026

[Killed] BlockStatement
src/billing/subscription/BillingService.ts:69:12
 
     if (billingCycle === "yearly") {
       nextBilling.setFullYear(nextBilling.getFullYear() + 1);
-    } else {
-      nextBilling.setMonth(nextBilling.getMonth() + 1);
-    }
+    } else {}
 
     return nextBilling;
killedBy: BillingService calculateNextBillingDate adds 1 month for monthly billing cycle
statusReason: Expected values to be strictly equal:

2 !== 3

[Killed] ArithmeticOperator
src/billing/subscription/BillingService.ts:70:28
     if (billingCycle === "yearly") {
       nextBilling.setFullYear(nextBilling.getFullYear() + 1);
     } else {
-      nextBilling.setMonth(nextBilling.getMonth() + 1);
+      nextBilling.setMonth(nextBilling.getMonth() - 1);
     }
 
killedBy: BillingService calculateNextBillingDate adds 1 month for monthly billing cycle
statusReason: Expected values to be strictly equal:

1 !== 3

[Killed] MethodExpression
src/billing/subscription/BillingService.ts:70:7
     if (billingCycle === "yearly") {
       nextBilling.setFullYear(nextBilling.getFullYear() + 1);
     } else {
-      nextBilling.setMonth(nextBilling.getMonth() + 1);
+      nextBilling.setFullYear(nextBilling.getMonth() + 1);
     }
 
killedBy: BillingService calculateNextBillingDate adds 1 month for monthly billing cycle
statusReason: Expected values to be strictly equal:

2 !== 3

[Killed] BlockStatement
src/billing/subscription/BillingService.ts:83:13
     monthlyPrice: number,
     yearlyPrice: number,
     billingCycle: "monthly" | "yearly"
-  ): number {
-    return billingCycle === "yearly" ? yearlyPrice : monthlyPrice;
-  }
+  ): number {}
 }
 
killedBy: BillingService calculateBillingAmount returns monthly price for monthly cycle
statusReason: Expected values to be strictly equal:
+ actual - expected

+ undefined
- 9.99

[Killed] ConditionalExpression
src/billing/subscription/BillingService.ts:84:12
     yearlyPrice: number,
     billingCycle: "monthly" | "yearly"
   ): number {
-    return billingCycle === "yearly" ? yearlyPrice : monthlyPrice;
+    return false ? yearlyPrice : monthlyPrice;
   }
 }
killedBy: BillingService calculateBillingAmount returns yearly price for yearly cycle
statusReason: Expected values to be strictly equal:

9.99 !== 99.99

[Killed] ConditionalExpression
src/billing/subscription/BillingService.ts:84:12
     yearlyPrice: number,
     billingCycle: "monthly" | "yearly"
   ): number {
-    return billingCycle === "yearly" ? yearlyPrice : monthlyPrice;
+    return true ? yearlyPrice : monthlyPrice;
   }
 }
killedBy: BillingService calculateBillingAmount returns monthly price for monthly cycle
statusReason: Expected values to be strictly equal:

99.99 !== 9.99
