[Timeout] StringLiteral
src/billing/subscription/SubscriptionManagementService.ts:36:11
  */
 export class SubscriptionManagementService extends AuditableService {
   constructor(private readonly accountQueryRepo: AccountQueryRepositoryPort) {
-    super("SubscriptionManagementService");
+    super("");
   }
 

[Killed] BlockStatement
src/billing/subscription/SubscriptionManagementService.ts:46:9
     accountId: string
   ): Promise<Result<AccountSubscriptionInfo, "NOT_FOUND" | "DATABASE_ERROR">> {
     const startTime = Date.now();
-    try {
-      const accountResult = await this.accountQueryRepo.findWithProjects(accountId);
-
-      if (!accountResult.ok) {
-        return err("NOT_FOUND");
-      }
-
-      const account = accountResult.value;
-      const subscriptionInfo = subscriptionPlanService.mapAccountToSubscriptionInfo(account);
-
-      return ok(subscriptionInfo);
-    } catch (error) {
+    try {} catch (error) {
       const serviceError = this.createServiceError(error, {
         serviceName: this.serviceName,
killedBy: subscriptionRoutes - Account Operations and Billing Analytics POST /admin/billing/accounts/:accountId/validate-limits should validate CREATE_PROJECT limit
statusReason: expected 500 to be 200 // Object.is equality

[Killed] BlockStatement
src/billing/subscription/SubscriptionManagementService.ts:49:30
     try {
       const accountResult = await this.accountQueryRepo.findWithProjects(accountId);
 
-      if (!accountResult.ok) {
-        return err("NOT_FOUND");
-      }
+      if (!accountResult.ok) {}
 
       const account = accountResult.value;
killedBy: subscriptionRoutes - Plans and Subscription Management GET /admin/billing/accounts/:accountId/subscription should reject non-existent account
statusReason: expected 500 to be 404 // Object.is equality

[Killed] ConditionalExpression
src/billing/subscription/SubscriptionManagementService.ts:49:11
     try {
       const accountResult = await this.accountQueryRepo.findWithProjects(accountId);
 
-      if (!accountResult.ok) {
+      if (true) {
         return err("NOT_FOUND");
       }
killedBy: subscriptionRoutes - Plans and Subscription Management GET /admin/billing/accounts/:accountId/subscription should get account subscription
statusReason: expected 404 to be 200 // Object.is equality

[Killed] StringLiteral
src/billing/subscription/SubscriptionManagementService.ts:50:20
       const accountResult = await this.accountQueryRepo.findWithProjects(accountId);
 
       if (!accountResult.ok) {
-        return err("NOT_FOUND");
+        return err("");
       }
 
killedBy: subscriptionRoutes - Plans and Subscription Management GET /admin/billing/accounts/:accountId/subscription should reject non-existent account
statusReason: expected 500 to be 404 // Object.is equality

[NoCoverage] BlockStatement
src/billing/subscription/SubscriptionManagementService.ts:57:21
       const subscriptionInfo = subscriptionPlanService.mapAccountToSubscriptionInfo(account);
 
       return ok(subscriptionInfo);
-    } catch (error) {
-      const serviceError = this.createServiceError(error, {
-        serviceName: this.serviceName,
-        operation: "getAccountSubscription",
-        accountId,
-      });
-      this.logError(
-        { serviceName: this.serviceName, operation: "getAccountSubscription", accountId },
-        serviceError,
-        Date.now() - startTime
-      );
-      return err("DATABASE_ERROR");
-    }
+    } catch (error) {}
   }
 

[NoCoverage] ObjectLiteral
src/billing/subscription/SubscriptionManagementService.ts:64:9
         accountId,
       });
       this.logError(
-        { serviceName: this.serviceName, operation: "getAccountSubscription", accountId },
+        {},
         serviceError,
         Date.now() - startTime

[NoCoverage] ArithmeticOperator
src/billing/subscription/SubscriptionManagementService.ts:66:9
       this.logError(
         { serviceName: this.serviceName, operation: "getAccountSubscription", accountId },
         serviceError,
-        Date.now() - startTime
+        Date.now() + startTime
       );
       return err("DATABASE_ERROR");

[NoCoverage] StringLiteral
src/billing/subscription/SubscriptionManagementService.ts:68:18
         serviceError,
         Date.now() - startTime
       );
-      return err("DATABASE_ERROR");
+      return err("");
     }
   }

[Killed] BooleanLiteral
src/billing/subscription/SubscriptionManagementService.ts:86:11
     try {
       const accountResult = await this.accountQueryRepo.findWithProjects(accountId);
 
-      if (!accountResult.ok) {
+      if (accountResult.ok) {
         return err("NOT_FOUND");
       }
killedBy: subscriptionRoutes - Plans and Subscription Management PUT /admin/billing/accounts/:accountId/subscription should update account subscription
statusReason: expected 404 to be 200 // Object.is equality

[Killed] BlockStatement
src/billing/subscription/SubscriptionManagementService.ts:92:59
 
       const account = accountResult.value;
 
-      if (account.subscription === changeRequest.newTier) {
-        return err("NO_CHANGE");
-      }
+      if (account.subscription === changeRequest.newTier) {}
 
       const newPlan = subscriptionPlanService.getSubscriptionPlan(changeRequest.newTier);
killedBy: Subscription Updates should return NO_CHANGE when updating to same tier
statusReason: expected true to be falsy

[Killed] ConditionalExpression
src/billing/subscription/SubscriptionManagementService.ts:92:11
 
       const account = accountResult.value;
 
-      if (account.subscription === changeRequest.newTier) {
+      if (false) {
         return err("NO_CHANGE");
       }
killedBy: Subscription Updates should return NO_CHANGE when updating to same tier
statusReason: expected true to be falsy

[Killed] BooleanLiteral
src/billing/subscription/SubscriptionManagementService.ts:97:11
       }
 
       const newPlan = subscriptionPlanService.getSubscriptionPlan(changeRequest.newTier);
-      if (!newPlan) {
+      if (newPlan) {
         return err("INVALID_TIER");
       }
killedBy: subscriptionRoutes - Plans and Subscription Management PUT /admin/billing/accounts/:accountId/subscription should update account subscription
statusReason: expected 400 to be 200 // Object.is equality

[Killed] ConditionalExpression
src/billing/subscription/SubscriptionManagementService.ts:97:11
       }
 
       const newPlan = subscriptionPlanService.getSubscriptionPlan(changeRequest.newTier);
-      if (!newPlan) {
+      if (true) {
         return err("INVALID_TIER");
       }
killedBy: Subscription Updates should upgrade from BASIC to PRO
statusReason: expected false to be truthy

[NoCoverage] StringLiteral
src/billing/subscription/SubscriptionManagementService.ts:98:20
 
       const newPlan = subscriptionPlanService.getSubscriptionPlan(changeRequest.newTier);
       if (!newPlan) {
-        return err("INVALID_TIER");
+        return err("");
       }
 

[Survived] ConditionalExpression
src/billing/subscription/SubscriptionManagementService.ts:103:9
 
       // Validate upgrade/downgrade
       const isUpgrade =
-        billingService.getChangeType(account.subscription, changeRequest.newTier) === "UPGRADE";
+        true;
       const validationResult = isUpgrade
         ? subscriptionPlanService.validateUpgrade(

[Survived] EqualityOperator
src/billing/subscription/SubscriptionManagementService.ts:103:9
 
       // Validate upgrade/downgrade
       const isUpgrade =
-        billingService.getChangeType(account.subscription, changeRequest.newTier) === "UPGRADE";
+        billingService.getChangeType(account.subscription, changeRequest.newTier) !== "UPGRADE";
       const validationResult = isUpgrade
         ? subscriptionPlanService.validateUpgrade(

[Survived] ConditionalExpression
src/billing/subscription/SubscriptionManagementService.ts:115:11
             account.projects.length
           );
 
-      if (!validationResult.allowed) {
+      if (false) {
         this.logWarning(
           { operation: "updateSubscription", accountId },

[Survived] BooleanLiteral
src/billing/subscription/SubscriptionManagementService.ts:115:11
             account.projects.length
           );
 
-      if (!validationResult.allowed) {
+      if (validationResult.allowed) {
         this.logWarning(
           { operation: "updateSubscription", accountId },

[NoCoverage] ConditionalExpression
src/billing/subscription/SubscriptionManagementService.ts:118:11
       if (!validationResult.allowed) {
         this.logWarning(
           { operation: "updateSubscription", accountId },
-          validationResult.reason || "Subscription change validation failed"
+          true
         );
       }

[NoCoverage] ConditionalExpression
src/billing/subscription/SubscriptionManagementService.ts:118:11
       if (!validationResult.allowed) {
         this.logWarning(
           { operation: "updateSubscription", accountId },
-          validationResult.reason || "Subscription change validation failed"
+          false
         );
       }

[Survived] ConditionalExpression
src/billing/subscription/SubscriptionManagementService.ts:126:11
       const currentProjects = account.projects.length;
 
       // Check if downgrading would exceed project limits
-      if (currentProjects > newPlan.maxProjects) {
+      if (true) {
         this.logWarning(
           { operation: "updateSubscription", accountId },

[NoCoverage] BlockStatement
src/billing/subscription/SubscriptionManagementService.ts:126:50
       const currentProjects = account.projects.length;
 
       // Check if downgrading would exceed project limits
-      if (currentProjects > newPlan.maxProjects) {
-        this.logWarning(
-          { operation: "updateSubscription", accountId },
-          `Account has ${currentProjects} projects but new tier allows only ${newPlan.maxProjects}`
-        );
-      }
+      if (currentProjects > newPlan.maxProjects) {}
 
       // Update subscription

[NoCoverage] StringLiteral
src/billing/subscription/SubscriptionManagementService.ts:128:24
       // Check if downgrading would exceed project limits
       if (currentProjects > newPlan.maxProjects) {
         this.logWarning(
-          { operation: "updateSubscription", accountId },
+          { operation: "", accountId },
           `Account has ${currentProjects} projects but new tier allows only ${newPlan.maxProjects}`
         );

[Survived] BooleanLiteral
src/billing/subscription/SubscriptionManagementService.ts:142:21
           updatedAt: new Date(),
         },
         include: {
-          projects: true,
+          projects: false,
         },
       });

[Survived] ConditionalExpression
src/billing/subscription/SubscriptionManagementService.ts:147:11
       });
 
       // Log account action for audit trail
-      if (updatedByUserId) {
+      if (true) {
         await this.logAccountAction(updatedByUserId, {
           accountId,

[Survived] BlockStatement
src/billing/subscription/SubscriptionManagementService.ts:147:28
       });
 
       // Log account action for audit trail
-      if (updatedByUserId) {
-        await this.logAccountAction(updatedByUserId, {
-          accountId,
-          action: "SUBSCRIPTION_UPDATE",
-          category: "BILLING",
-          severity: "MEDIUM",
-          details: {
-            email: account.email,
-            fromTier: oldTier,
-            toTier: changeRequest.newTier,
-            billingCycle: changeRequest.billingCycle,
-            reason: changeRequest.reason,
-          },
-        });
-      }
+      if (updatedByUserId) {}
 
       // Log billing event

[Survived] StringLiteral
src/billing/subscription/SubscriptionManagementService.ts:151:21
         await this.logAccountAction(updatedByUserId, {
           accountId,
           action: "SUBSCRIPTION_UPDATE",
-          category: "BILLING",
+          category: "",
           severity: "MEDIUM",
           details: {

[Survived] ObjectLiteral
src/billing/subscription/SubscriptionManagementService.ts:153:20
           action: "SUBSCRIPTION_UPDATE",
           category: "BILLING",
           severity: "MEDIUM",
-          details: {
-            email: account.email,
-            fromTier: oldTier,
-            toTier: changeRequest.newTier,
-            billingCycle: changeRequest.billingCycle,
-            reason: changeRequest.reason,
-          },
+          details: {},
         });
       }

[Survived] StringLiteral
src/billing/subscription/SubscriptionManagementService.ts:174:19
           newPlan.yearlyPrice,
           changeRequest.billingCycle
         ),
-        currency: "USD",
+        currency: "",
         ...(changeRequest.reason && { reason: changeRequest.reason }),
         ...(updatedByUserId && { processedBy: updatedByUserId }),

[Survived] LogicalOperator
src/billing/subscription/SubscriptionManagementService.ts:175:13
           changeRequest.billingCycle
         ),
         currency: "USD",
-        ...(changeRequest.reason && { reason: changeRequest.reason }),
+        ...(changeRequest.reason || {
+  reason: changeRequest.reason
+}),
         ...(updatedByUserId && { processedBy: updatedByUserId }),
         metadata: {

[Survived] ConditionalExpression
src/billing/subscription/SubscriptionManagementService.ts:175:13
           changeRequest.billingCycle
         ),
         currency: "USD",
-        ...(changeRequest.reason && { reason: changeRequest.reason }),
+        ...(false),
         ...(updatedByUserId && { processedBy: updatedByUserId }),
         metadata: {

[Survived] LogicalOperator
src/billing/subscription/SubscriptionManagementService.ts:176:13
         ),
         currency: "USD",
         ...(changeRequest.reason && { reason: changeRequest.reason }),
-        ...(updatedByUserId && { processedBy: updatedByUserId }),
+        ...(updatedByUserId || {
+  processedBy: updatedByUserId
+}),
         metadata: {
           billingCycle: changeRequest.billingCycle,

[Survived] ConditionalExpression
src/billing/subscription/SubscriptionManagementService.ts:176:13
         ),
         currency: "USD",
         ...(changeRequest.reason && { reason: changeRequest.reason }),
-        ...(updatedByUserId && { processedBy: updatedByUserId }),
+        ...(true),
         metadata: {
           billingCycle: changeRequest.billingCycle,

[NoCoverage] BlockStatement
src/billing/subscription/SubscriptionManagementService.ts:184:21
       });
 
       return this.getAccountSubscription(accountId);
-    } catch (error) {
-      const serviceError = this.createServiceError(error, {
-        serviceName: this.serviceName,
-        operation: "updateSubscription",
-        accountId,
-        ...(updatedByUserId !== undefined && { userId: updatedByUserId }),
-      });
-      this.logError(
-        {
-          serviceName: this.serviceName,
-          operation: "updateSubscription",
-          accountId,
-          ...(updatedByUserId !== undefined && { userId: updatedByUserId }),
-        },
-        serviceError,
-        Date.now() - startTime
-      );
-      return err("DATABASE_ERROR");
-    }
+    } catch (error) {}
   }
 

[NoCoverage] EqualityOperator
src/billing/subscription/SubscriptionManagementService.ts:189:13
         serviceName: this.serviceName,
         operation: "updateSubscription",
         accountId,
-        ...(updatedByUserId !== undefined && { userId: updatedByUserId }),
+        ...(updatedByUserId === undefined && { userId: updatedByUserId }),
       });
       this.logError(

[NoCoverage] ConditionalExpression
src/billing/subscription/SubscriptionManagementService.ts:189:13
         serviceName: this.serviceName,
         operation: "updateSubscription",
         accountId,
-        ...(updatedByUserId !== undefined && { userId: updatedByUserId }),
+        ...(false),
       });
       this.logError(

[NoCoverage] ConditionalExpression
src/billing/subscription/SubscriptionManagementService.ts:196:15
           serviceName: this.serviceName,
           operation: "updateSubscription",
           accountId,
-          ...(updatedByUserId !== undefined && { userId: updatedByUserId }),
+          ...(true),
         },
         serviceError,

[NoCoverage] ConditionalExpression
src/billing/subscription/SubscriptionManagementService.ts:196:15
           serviceName: this.serviceName,
           operation: "updateSubscription",
           accountId,
-          ...(updatedByUserId !== undefined && { userId: updatedByUserId }),
+          ...(true && { userId: updatedByUserId }),
         },
         serviceError,

[Survived] ArithmeticOperator
src/billing/subscription/SubscriptionManagementService.ts:225:23
   > {
     const startTime = Date.now();
     try {
-      const offset = (page - 1) * limit;
+      const offset = (page + 1) * limit;
 
       // Build where clause with proper types

[Survived] ArithmeticOperator
src/billing/subscription/SubscriptionManagementService.ts:225:22
   > {
     const startTime = Date.now();
     try {
-      const offset = (page - 1) * limit;
+      const offset = (page - 1) / limit;
 
       // Build where clause with proper types

[Survived] ConditionalExpression
src/billing/subscription/SubscriptionManagementService.ts:230:11
       // Build where clause with proper types
       const where: PrismaAccountWhereInput = {};
 
-      if (filters.tier) {
+      if (false) {
         where.subscription = filters.tier;
       }

[Survived] BlockStatement
src/billing/subscription/SubscriptionManagementService.ts:230:25
       // Build where clause with proper types
       const where: PrismaAccountWhereInput = {};
 
-      if (filters.tier) {
-        where.subscription = filters.tier;
-      }
+      if (filters.tier) {}
 
       if (filters.search) {

[Killed] ConditionalExpression
src/billing/subscription/SubscriptionManagementService.ts:234:11
         where.subscription = filters.tier;
       }
 
-      if (filters.search) {
+      if (true) {
         where.OR = [
           { email: { contains: filters.search, mode: "insensitive" } },
killedBy: List Account Subscriptions should list all subscriptions with pagination
statusReason: expected false to be truthy

[Survived] BlockStatement
src/billing/subscription/SubscriptionManagementService.ts:234:27
         where.subscription = filters.tier;
       }
 
-      if (filters.search) {
-        where.OR = [
-          { email: { contains: filters.search, mode: "insensitive" } },
-          { name: { contains: filters.search, mode: "insensitive" } },
-        ];
-      }
+      if (filters.search) {}
 
       // Build orderBy clause with proper types

[Survived] ObjectLiteral
src/billing/subscription/SubscriptionManagementService.ts:236:20
 
       if (filters.search) {
         where.OR = [
-          { email: { contains: filters.search, mode: "insensitive" } },
+          { email: {} },
           { name: { contains: filters.search, mode: "insensitive" } },
         ];

[Survived] StringLiteral
src/billing/subscription/SubscriptionManagementService.ts:237:53
       if (filters.search) {
         where.OR = [
           { email: { contains: filters.search, mode: "insensitive" } },
-          { name: { contains: filters.search, mode: "insensitive" } },
+          { name: { contains: filters.search, mode: "" } },
         ];
       }

[Survived] ConditionalExpression
src/billing/subscription/SubscriptionManagementService.ts:243:11
 
       // Build orderBy clause with proper types
       const orderBy: PrismaAccountOrderByInput = {};
-      if (filters.sortBy) {
+      if (true) {
         orderBy[filters.sortBy] = filters.sortOrder || "desc";
       } else {

[Survived] BlockStatement
src/billing/subscription/SubscriptionManagementService.ts:243:27
 
       // Build orderBy clause with proper types
       const orderBy: PrismaAccountOrderByInput = {};
-      if (filters.sortBy) {
-        orderBy[filters.sortBy] = filters.sortOrder || "desc";
-      } else {
+      if (filters.sortBy) {} else {
         orderBy.createdAt = "desc";
       }

[Survived] ConditionalExpression
src/billing/subscription/SubscriptionManagementService.ts:244:35
       // Build orderBy clause with proper types
       const orderBy: PrismaAccountOrderByInput = {};
       if (filters.sortBy) {
-        orderBy[filters.sortBy] = filters.sortOrder || "desc";
+        orderBy[filters.sortBy] = true;
       } else {
         orderBy.createdAt = "desc";

[Survived] LogicalOperator
src/billing/subscription/SubscriptionManagementService.ts:244:35
       // Build orderBy clause with proper types
       const orderBy: PrismaAccountOrderByInput = {};
       if (filters.sortBy) {
-        orderBy[filters.sortBy] = filters.sortOrder || "desc";
+        orderBy[filters.sortBy] = filters.sortOrder && "desc";
       } else {
         orderBy.createdAt = "desc";

[Survived] BlockStatement
src/billing/subscription/SubscriptionManagementService.ts:245:14
       const orderBy: PrismaAccountOrderByInput = {};
       if (filters.sortBy) {
         orderBy[filters.sortBy] = filters.sortOrder || "desc";
-      } else {
-        orderBy.createdAt = "desc";
-      }
+      } else {}
 
       // Get total count

[Killed] ObjectLiteral
src/billing/subscription/SubscriptionManagementService.ts:258:18
         orderBy,
         skip: offset,
         take: limit,
-        include: {
-          projects: true,
-        },
+        include: {},
       });
 
killedBy: subscriptionRoutes - Plans and Subscription Management GET /admin/billing/subscriptions should list all subscriptions
statusReason: expected 500 to be 200 // Object.is equality

[Killed] ArrowFunction
src/billing/subscription/SubscriptionManagementService.ts:264:42
       });
 
       // Map accounts to subscription info
-      const subscriptions = accounts.map((account) =>
-        subscriptionPlanService.mapAccountToSubscriptionInfo(account)
+      const subscriptions = accounts.map(() => undefined
       );
 
killedBy: subscriptionRoutes - Trials, Reporting and Auto-Renewals GET /admin/billing/export should export subscriptions as CSV
statusReason: expected 500 to be 200 // Object.is equality

[Killed] ObjectLiteral
src/billing/subscription/SubscriptionManagementService.ts:268:17
         subscriptionPlanService.mapAccountToSubscriptionInfo(account)
       );
 
-      return ok({
-        subscriptions,
-        total,
-        page,
-        limit,
-      });
+      return ok({});
     } catch (error) {
       const serviceError = this.createServiceError(error, {
killedBy: subscriptionRoutes - Plans and Subscription Management GET /admin/billing/subscriptions should list all subscriptions
statusReason: expected 500 to be 200 // Object.is equality

[NoCoverage] BlockStatement
src/billing/subscription/SubscriptionManagementService.ts:274:21
         page,
         limit,
       });
-    } catch (error) {
-      const serviceError = this.createServiceError(error, {
-        serviceName: this.serviceName,
-        operation: "listAccountSubscriptions",
-      });
-      this.logError(
-        { serviceName: this.serviceName, operation: "listAccountSubscriptions" },
-        serviceError,
-        Date.now() - startTime
-      );
-      return err("DATABASE_ERROR");
-    }
+    } catch (error) {}
   }
 

[NoCoverage] StringLiteral
src/billing/subscription/SubscriptionManagementService.ts:277:20
     } catch (error) {
       const serviceError = this.createServiceError(error, {
         serviceName: this.serviceName,
-        operation: "listAccountSubscriptions",
+        operation: "",
       });
       this.logError(

[NoCoverage] StringLiteral
src/billing/subscription/SubscriptionManagementService.ts:280:53
         operation: "listAccountSubscriptions",
       });
       this.logError(
-        { serviceName: this.serviceName, operation: "listAccountSubscriptions" },
+        { serviceName: this.serviceName, operation: "" },
         serviceError,
         Date.now() - startTime

[Killed] BlockStatement
src/billing/subscription/SubscriptionManagementService.ts:302:9
     >
   > {
     const startTime = Date.now();
-    try {
-      const subscriptionResult = await this.getAccountSubscription(accountId);
-      if (!subscriptionResult.ok) {
-        return subscriptionResult as Result<
-          { allowed: boolean; limit: number; current: number; remaining: number },
-          "NOT_FOUND" | "DATABASE_ERROR"
-        >;
-      }
-
-      return subscriptionPlanService.validateSubscriptionLimits(
-        subscriptionResult.value,
-        operation,
-        amount
-      );
-    } catch (error) {
+    try {} catch (error) {
       const serviceError = this.createServiceError(error, {
         serviceName: this.serviceName,
killedBy: subscriptionRoutes - Account Operations and Billing Analytics POST /admin/billing/accounts/:accountId/validate-limits should validate CREATE_PROJECT limit
statusReason: expected 500 to be 200 // Object.is equality

[Killed] BlockStatement
src/billing/subscription/SubscriptionManagementService.ts:304:35
     const startTime = Date.now();
     try {
       const subscriptionResult = await this.getAccountSubscription(accountId);
-      if (!subscriptionResult.ok) {
-        return subscriptionResult as Result<
-          { allowed: boolean; limit: number; current: number; remaining: number },
-          "NOT_FOUND" | "DATABASE_ERROR"
-        >;
-      }
+      if (!subscriptionResult.ok) {}
 
       return subscriptionPlanService.validateSubscriptionLimits(
killedBy: Subscription Limits Validation should return NOT_FOUND for non-existent account
statusReason: Cannot destructure property 'plan' of 'subscriptionInfo' as it is undefined.

[Killed] BooleanLiteral
src/billing/subscription/SubscriptionManagementService.ts:304:11
     const startTime = Date.now();
     try {
       const subscriptionResult = await this.getAccountSubscription(accountId);
-      if (!subscriptionResult.ok) {
+      if (subscriptionResult.ok) {
         return subscriptionResult as Result<
           { allowed: boolean; limit: number; current: number; remaining: number },
killedBy: Subscription Limits Validation should validate CREATE_PROJECT operation within limits
statusReason: expected undefined to be truthy

[NoCoverage] BlockStatement
src/billing/subscription/SubscriptionManagementService.ts:316:21
         operation,
         amount
       );
-    } catch (error) {
-      const serviceError = this.createServiceError(error, {
-        serviceName: this.serviceName,
-        operation: "validateSubscriptionLimits",
-        accountId,
-      });
-      this.logError(
-        { serviceName: this.serviceName, operation: "validateSubscriptionLimits", accountId },
-        serviceError,
-        Date.now() - startTime
-      );
-      return err("DATABASE_ERROR");
-    }
+    } catch (error) {}
   }
 

[NoCoverage] ObjectLiteral
src/billing/subscription/SubscriptionManagementService.ts:317:59
         amount
       );
     } catch (error) {
-      const serviceError = this.createServiceError(error, {
-        serviceName: this.serviceName,
-        operation: "validateSubscriptionLimits",
-        accountId,
-      });
+      const serviceError = this.createServiceError(error, {});
       this.logError(
         { serviceName: this.serviceName, operation: "validateSubscriptionLimits", accountId },

[NoCoverage] ObjectLiteral
src/billing/subscription/SubscriptionManagementService.ts:323:9
         accountId,
       });
       this.logError(
-        { serviceName: this.serviceName, operation: "validateSubscriptionLimits", accountId },
+        {},
         serviceError,
         Date.now() - startTime

[Survived] ConditionalExpression
src/billing/subscription/SubscriptionManagementService.ts:350:11
       const account = accountResult.value;
 
       // Log account action for audit trail
-      if (suspendedByUserId) {
+      if (true) {
         await this.logAccountAction(suspendedByUserId, {
           accountId,

[Survived] ConditionalExpression
src/billing/subscription/SubscriptionManagementService.ts:350:11
       const account = accountResult.value;
 
       // Log account action for audit trail
-      if (suspendedByUserId) {
+      if (false) {
         await this.logAccountAction(suspendedByUserId, {
           accountId,

[Survived] ObjectLiteral
src/billing/subscription/SubscriptionManagementService.ts:351:56
 
       // Log account action for audit trail
       if (suspendedByUserId) {
-        await this.logAccountAction(suspendedByUserId, {
-          accountId,
-          action: "SUBSCRIPTION_SUSPEND",
-          category: "BILLING",
-          severity: "HIGH",
-          details: {
-            email: account.email,
-            tier: account.subscription,
-            reason,
-          },
-        });
+        await this.logAccountAction(suspendedByUserId, {});
       }
 

[Survived] StringLiteral
src/billing/subscription/SubscriptionManagementService.ts:353:19
       if (suspendedByUserId) {
         await this.logAccountAction(suspendedByUserId, {
           accountId,
-          action: "SUBSCRIPTION_SUSPEND",
+          action: "",
           category: "BILLING",
           severity: "HIGH",

[Survived] ConditionalExpression
src/billing/subscription/SubscriptionManagementService.ts:370:13
         type: "SUSPENSION",
         currency: "USD",
         reason,
-        ...(suspendedByUserId && { processedBy: suspendedByUserId }),
+        ...(false),
       });
 

[Survived] ConditionalExpression
src/billing/subscription/SubscriptionManagementService.ts:370:13
         type: "SUSPENSION",
         currency: "USD",
         reason,
-        ...(suspendedByUserId && { processedBy: suspendedByUserId }),
+        ...(true),
       });
 
