[NoCoverage] LogicalOperator
src/billing/subscription/TrialManagementService.ts:390:13
         serviceName: this.serviceName,
         operation: "convertTrialToPaid",
         accountId,
-        ...(convertedByUserId !== undefined && { userId: convertedByUserId }),
+        ...(convertedByUserId !== undefined || {
+  userId: convertedByUserId
+}),
       });
       this.logError(

[NoCoverage] ConditionalExpression
src/billing/subscription/TrialManagementService.ts:390:13
         serviceName: this.serviceName,
         operation: "convertTrialToPaid",
         accountId,
-        ...(convertedByUserId !== undefined && { userId: convertedByUserId }),
+        ...(false),
       });
       this.logError(

[NoCoverage] ConditionalExpression
src/billing/subscription/TrialManagementService.ts:397:15
           serviceName: this.serviceName,
           operation: "convertTrialToPaid",
           accountId,
-          ...(convertedByUserId !== undefined && { userId: convertedByUserId }),
+          ...(true),
         },
         serviceError,

[NoCoverage] ConditionalExpression
src/billing/subscription/TrialManagementService.ts:397:15
           serviceName: this.serviceName,
           operation: "convertTrialToPaid",
           accountId,
-          ...(convertedByUserId !== undefined && { userId: convertedByUserId }),
+          ...(true && { userId: convertedByUserId }),
         },
         serviceError,

[Survived] ObjectLiteral
src/billing/subscription/TrialManagementService.ts:424:66
       const now = new Date();
 
       // Find accounts with expired trials and auto-renewal enabled
-      const expiredTrialAccounts = await prisma.account.findMany({
-        where: {
-          isOnTrial: true,
-          autoRenewal: true,
-          trialEndDate: {
-            lte: now,
-          },
-        },
-        include: {
-          projects: true,
-        },
-      });
+      const expiredTrialAccounts = await prisma.account.findMany({});
 
       const results = await Promise.allSettled(

[Survived] ObjectLiteral
src/billing/subscription/TrialManagementService.ts:425:16
 
       // Find accounts with expired trials and auto-renewal enabled
       const expiredTrialAccounts = await prisma.account.findMany({
-        where: {
-          isOnTrial: true,
-          autoRenewal: true,
-          trialEndDate: {
-            lte: now,
-          },
-        },
+        where: {},
         include: {
           projects: true,

[Survived] BooleanLiteral
src/billing/subscription/TrialManagementService.ts:427:24
       const expiredTrialAccounts = await prisma.account.findMany({
         where: {
           isOnTrial: true,
-          autoRenewal: true,
+          autoRenewal: false,
           trialEndDate: {
             lte: now,

[Survived] ObjectLiteral
src/billing/subscription/TrialManagementService.ts:428:25
         where: {
           isOnTrial: true,
           autoRenewal: true,
-          trialEndDate: {
-            lte: now,
-          },
+          trialEndDate: {},
         },
         include: {

[NoCoverage] ObjectLiteral
src/billing/subscription/TrialManagementService.ts:453:22
             );
 
             await prisma.account.update({
-              where: { id: account.id },
+              where: {},
               data: {
                 isOnTrial: false,

[NoCoverage] ObjectLiteral
src/billing/subscription/TrialManagementService.ts:478:50
             });
 
             // Log billing event
-            await billingService.logBillingEvent({
-              accountId: account.id,
-              type: "AUTO_RENEWAL",
-              toTier: account.subscription,
-              amount,
-              currency: "USD",
-              reason: "Automatic renewal after trial period",
-              metadata: {
-                billingCycle: account.billingCycle,
-                nextBillingDate: nextBilling.toISOString(),
-                previousTrialEndDate: account.trialEndDate?.toISOString(),
-              },
-            });
+            await billingService.logBillingEvent({});
 
             return { accountId: account.id, status: "success" as const };

[NoCoverage] StringLiteral
src/billing/subscription/TrialManagementService.ts:480:21
             // Log billing event
             await billingService.logBillingEvent({
               accountId: account.id,
-              type: "AUTO_RENEWAL",
+              type: "",
               toTier: account.subscription,
               amount,

[NoCoverage] StringLiteral
src/billing/subscription/TrialManagementService.ts:484:23
               toTier: account.subscription,
               amount,
               currency: "USD",
-              reason: "Automatic renewal after trial period",
+              reason: "",
               metadata: {
                 billingCycle: account.billingCycle,

[NoCoverage] OptionalChaining
src/billing/subscription/TrialManagementService.ts:488:39
               metadata: {
                 billingCycle: account.billingCycle,
                 nextBillingDate: nextBilling.toISOString(),
-                previousTrialEndDate: account.trialEndDate?.toISOString(),
+                previousTrialEndDate: account.trialEndDate.toISOString(),
               },
             });

[NoCoverage] BlockStatement
src/billing/subscription/TrialManagementService.ts:493:37
             });
 
             return { accountId: account.id, status: "success" as const };
-          } catch (_error: unknown) {
-            log.error({ err: _error, accountId: account.id }, "Auto-renewal failed for account");
-            return {
-              accountId: account.id,
-              status: "failed" as const,
-              error: _error instanceof Error ? _error.message : "Unknown error",
-            };
-          }
+          } catch (_error: unknown) {}
         })
       );

[Survived] ArrowFunction
src/billing/subscription/TrialManagementService.ts:504:35
         })
       );
 
-      const details = results.map((result) =>
-        result.status === "fulfilled"
-          ? result.value
-          : { accountId: "unknown", status: "failed" as const, error: "Promise rejected" }
+      const details = results.map(() => undefined
       );
 

[NoCoverage] ConditionalExpression
src/billing/subscription/TrialManagementService.ts:505:9
       );
 
       const details = results.map((result) =>
-        result.status === "fulfilled"
+        true
           ? result.value
           : { accountId: "unknown", status: "failed" as const, error: "Promise rejected" }

[NoCoverage] ConditionalExpression
src/billing/subscription/TrialManagementService.ts:505:9
       );
 
       const details = results.map((result) =>
-        result.status === "fulfilled"
+        false
           ? result.value
           : { accountId: "unknown", status: "failed" as const, error: "Promise rejected" }

[NoCoverage] StringLiteral
src/billing/subscription/TrialManagementService.ts:507:26
       const details = results.map((result) =>
         result.status === "fulfilled"
           ? result.value
-          : { accountId: "unknown", status: "failed" as const, error: "Promise rejected" }
+          : { accountId: "", status: "failed" as const, error: "Promise rejected" }
       );
 

[NoCoverage] ObjectLiteral
src/billing/subscription/TrialManagementService.ts:507:13
       const details = results.map((result) =>
         result.status === "fulfilled"
           ? result.value
-          : { accountId: "unknown", status: "failed" as const, error: "Promise rejected" }
+          : {}
       );
 

[NoCoverage] ConditionalExpression
src/billing/subscription/TrialManagementService.ts:510:47
           : { accountId: "unknown", status: "failed" as const, error: "Promise rejected" }
       );
 
-      const processed = details.filter((d) => d.status === "success").length;
+      const processed = details.filter((d) => true).length;
       const failed = details.filter((d) => d.status === "failed").length;
 

[NoCoverage] ConditionalExpression
src/billing/subscription/TrialManagementService.ts:510:47
           : { accountId: "unknown", status: "failed" as const, error: "Promise rejected" }
       );
 
-      const processed = details.filter((d) => d.status === "success").length;
+      const processed = details.filter((d) => false).length;
       const failed = details.filter((d) => d.status === "failed").length;
 

[NoCoverage] EqualityOperator
src/billing/subscription/TrialManagementService.ts:511:44
       );
 
       const processed = details.filter((d) => d.status === "success").length;
-      const failed = details.filter((d) => d.status === "failed").length;
+      const failed = details.filter((d) => d.status !== "failed").length;
 
       return ok({

[NoCoverage] ConditionalExpression
src/billing/subscription/TrialManagementService.ts:511:44
       );
 
       const processed = details.filter((d) => d.status === "success").length;
-      const failed = details.filter((d) => d.status === "failed").length;
+      const failed = details.filter((d) => false).length;
 
       return ok({

[NoCoverage] BlockStatement
src/billing/subscription/TrialManagementService.ts:518:21
         failed,
         details,
       });
-    } catch (error) {
-      const serviceError = this.createServiceError(error, {
-        serviceName: this.serviceName,
-        operation: "processAutoRenewals",
-      });
-      this.logError(
-        { serviceName: this.serviceName, operation: "processAutoRenewals" },
-        serviceError,
-        Date.now() - startTime
-      );
-      return err("DATABASE_ERROR");
-    }
+    } catch (error) {}
   }
 }

[NoCoverage] ObjectLiteral
src/billing/subscription/TrialManagementService.ts:519:59
         details,
       });
     } catch (error) {
-      const serviceError = this.createServiceError(error, {
-        serviceName: this.serviceName,
-        operation: "processAutoRenewals",
-      });
+      const serviceError = this.createServiceError(error, {});
       this.logError(
         { serviceName: this.serviceName, operation: "processAutoRenewals" },

[NoCoverage] StringLiteral
src/billing/subscription/TrialManagementService.ts:524:53
         operation: "processAutoRenewals",
       });
       this.logError(
-        { serviceName: this.serviceName, operation: "processAutoRenewals" },
+        { serviceName: this.serviceName, operation: "" },
         serviceError,
         Date.now() - startTime

[NoCoverage] ObjectLiteral
src/billing/subscription/TrialManagementService.ts:524:9
         operation: "processAutoRenewals",
       });
       this.logError(
-        { serviceName: this.serviceName, operation: "processAutoRenewals" },
+        {},
         serviceError,
         Date.now() - startTime
