[Killed] BlockStatement
src/billing/subscription/index.ts:59:65
  */
 export class SubscriptionService {
   // Plan operations
-  getSubscriptionPlan(tier: SubscriptionTier): SubscriptionPlan {
-    return subscriptionPlanService.getSubscriptionPlan(tier);
-  }
+  getSubscriptionPlan(tier: SubscriptionTier): SubscriptionPlan {}
 
   getAllPlans(): SubscriptionPlan[] {
killedBy: subscriptionRoutes - Plans and Subscription Management GET /admin/billing/plans/:tier should get BASIC plan
statusReason: expected undefined to be 'BASIC' // Object.is equality

[Killed] BlockStatement
src/billing/subscription/index.ts:63:37
     return subscriptionPlanService.getSubscriptionPlan(tier);
   }
 
-  getAllPlans(): SubscriptionPlan[] {
-    return subscriptionPlanService.getAllPlans();
-  }
+  getAllPlans(): SubscriptionPlan[] {}
 
   // Account subscription operations
killedBy: subscriptionRoutes - Plans and Subscription Management GET /admin/billing/plans should get all subscription plans
statusReason: expected 500 to be 200 // Object.is equality

[Killed] BlockStatement
src/billing/subscription/index.ts:70:79
   // Account subscription operations
   async getAccountSubscription(
     accountId: string
-  ): Promise<Result<AccountSubscriptionInfo, "NOT_FOUND" | "DATABASE_ERROR">> {
-    return subscriptionManagementService.getAccountSubscription(accountId);
-  }
+  ): Promise<Result<AccountSubscriptionInfo, "NOT_FOUND" | "DATABASE_ERROR">> {}
 
   async updateSubscription(
killedBy: subscriptionRoutes - Plans and Subscription Management GET /admin/billing/accounts/:accountId/subscription should get account subscription
statusReason: expected 500 to be 200 // Object.is equality

[Killed] BlockStatement
src/billing/subscription/index.ts:80:5
     updatedByUserId?: string
   ): Promise<
     Result<AccountSubscriptionInfo, "NOT_FOUND" | "INVALID_TIER" | "NO_CHANGE" | "DATABASE_ERROR">
-  > {
-    return subscriptionManagementService.updateSubscription(
-      accountId,
-      changeRequest,
-      updatedByUserId
-    );
-  }
+  > {}
 
   async listAccountSubscriptions(
killedBy: subscriptionRoutes - Plans and Subscription Management PUT /admin/billing/accounts/:accountId/subscription should update account subscription
statusReason: expected 500 to be 200 // Object.is equality

[Killed] BlockStatement
src/billing/subscription/index.ts:102:5
       { subscriptions: AccountSubscriptionInfo[]; total: number; page: number; limit: number },
       "DATABASE_ERROR"
     >
-  > {
-    return subscriptionManagementService.listAccountSubscriptions(filters, page, limit);
-  }
+  > {}
 
   async validateSubscriptionLimits(
killedBy: subscriptionRoutes - Plans and Subscription Management GET /admin/billing/subscriptions should list all subscriptions
statusReason: expected 500 to be 200 // Object.is equality

[Killed] BlockStatement
src/billing/subscription/index.ts:115:5
       { allowed: boolean; limit: number; current: number; remaining: number },
       "NOT_FOUND" | "DATABASE_ERROR"
     >
-  > {
-    return subscriptionManagementService.validateSubscriptionLimits(accountId, operation, amount);
-  }
+  > {}
 
   async suspendSubscription(
killedBy: subscriptionRoutes - Account Operations and Billing Analytics POST /admin/billing/accounts/:accountId/validate-limits should validate CREATE_PROJECT limit
statusReason: expected 500 to be 200 // Object.is equality

[Killed] BlockStatement
src/billing/subscription/index.ts:123:60
     accountId: string,
     reason: string,
     suspendedByUserId?: string
-  ): Promise<Result<void, "NOT_FOUND" | "DATABASE_ERROR">> {
-    return subscriptionManagementService.suspendSubscription(accountId, reason, suspendedByUserId);
-  }
+  ): Promise<Result<void, "NOT_FOUND" | "DATABASE_ERROR">> {}
 
   // Trial operations (delegated to TrialManagementService)
killedBy: subscriptionRoutes - Account Operations and Billing Analytics POST /admin/billing/accounts/:accountId/suspend should suspend account subscription
statusReason: expected 500 to be 200 // Object.is equality

[Killed] BlockStatement
src/billing/subscription/index.ts:136:5
       AccountSubscriptionInfo,
       "NOT_FOUND" | "ALREADY_ON_TRIAL" | "TRIAL_EXPIRED" | "DATABASE_ERROR"
     >
-  > {
-    return trialManagementService.startTrial(request, startedByUserId);
-  }
+  > {}
 
   async endTrial(
killedBy: subscriptionRoutes - Trials, Reporting and Auto-Renewals POST /admin/billing/accounts/:accountId/trial/start should start trial for account
statusReason: expected 500 to be 200 // Object.is equality

[Killed] BlockStatement
src/billing/subscription/index.ts:144:96
     accountId: string,
     reason: string,
     endedByUserId?: string
-  ): Promise<Result<AccountSubscriptionInfo, "NOT_FOUND" | "NOT_ON_TRIAL" | "DATABASE_ERROR">> {
-    return trialManagementService.endTrial(accountId, reason, endedByUserId);
-  }
+  ): Promise<Result<AccountSubscriptionInfo, "NOT_FOUND" | "NOT_ON_TRIAL" | "DATABASE_ERROR">> {}
 
   async processAutoRenewals(): Promise<
killedBy: Trial Period Management should end trial period successfully
statusReason: Cannot read properties of undefined (reading 'ok')

[Killed] BlockStatement
src/billing/subscription/index.ts:157:5
       },
       "DATABASE_ERROR"
     >
-  > {
-    return trialManagementService.processAutoRenewals();
-  }
+  > {}
 
   async getExpiringTrials(
killedBy: subscriptionRoutes - Trials, Reporting and Auto-Renewals POST /admin/billing/auto-renewals/process should process auto-renewals with super admin
statusReason: expected 500 to be 200 // Object.is equality

[Killed] BlockStatement
src/billing/subscription/index.ts:163:67
 
   async getExpiringTrials(
     daysBeforeExpiration?: number
-  ): Promise<Result<AccountSubscriptionInfo[], "DATABASE_ERROR">> {
-    return trialManagementService.getExpiringTrials(daysBeforeExpiration);
-  }
+  ): Promise<Result<AccountSubscriptionInfo[], "DATABASE_ERROR">> {}
 
   async convertTrialToPaid(
killedBy: Expiring Trials Management should get expiring trials
statusReason: Cannot read properties of undefined (reading 'ok')

[NoCoverage] BlockStatement
src/billing/subscription/index.ts:171:96
     accountId: string,
     billingCycle?: "monthly" | "yearly",
     convertedByUserId?: string
-  ): Promise<Result<AccountSubscriptionInfo, "NOT_FOUND" | "NOT_ON_TRIAL" | "DATABASE_ERROR">> {
-    return trialManagementService.convertTrialToPaid(accountId, billingCycle, convertedByUserId);
-  }
+  ): Promise<Result<AccountSubscriptionInfo, "NOT_FOUND" | "NOT_ON_TRIAL" | "DATABASE_ERROR">> {}
 
   // Statistics operations

[Killed] BlockStatement
src/billing/subscription/index.ts:176:86
   }
 
   // Statistics operations
-  async getSubscriptionStats(): Promise<Result<SubscriptionStats, "DATABASE_ERROR">> {
-    return subscriptionStatsService.getSubscriptionStats();
-  }
+  async getSubscriptionStats(): Promise<Result<SubscriptionStats, "DATABASE_ERROR">> {}
 
   // Billing operations
killedBy: Subscription Statistics should get subscription statistics
statusReason: Cannot read properties of undefined (reading 'ok')

[NoCoverage] BlockStatement
src/billing/subscription/index.ts:183:20
   // Billing operations
   async logBillingEvent(
     event: Parameters<typeof billingService.logBillingEvent>[0]
-  ): Promise<void> {
-    return billingService.logBillingEvent(event);
-  }
+  ): Promise<void> {}
 }
 
