[Killed] ObjectLiteral
src/billing/subscription/types.ts:140:10
 
 // Subscription plan definitions
 export const SUBSCRIPTION_PLANS: Record<SubscriptionTier, SubscriptionPlan> = {
-  BASIC: {
-    tier: "BASIC",
-    name: "Basic Plan",
-    description: "Perfect for individuals and small projects",
-    monthlyPrice: 9.99,
-    yearlyPrice: 99.99,
-    maxProjects: 1,
-    features: [
-      "Up to 1 project",
-      "100 posts per month",
-      "1GB media storage",
-      "2 social accounts",
-      "Basic analytics",
-      "Email support",
-    ],
-    limits: {
-      postsPerMonth: 100,
-      mediaStorageGB: 1,
-      teamMembers: 1,
-      apiRequestsPerDay: 1000,
-      analyticsRetentionDays: 30,
-    },
-  },
+  BASIC: {},
   PRO: {
     tier: "PRO",
killedBy: subscriptionRoutes - Plans and Subscription Management GET /admin/billing/plans/:tier should get BASIC plan
statusReason: expected undefined to be 'BASIC' // Object.is equality

[Timeout] StringLiteral
src/billing/subscription/types.ts:142:11
 export const SUBSCRIPTION_PLANS: Record<SubscriptionTier, SubscriptionPlan> = {
   BASIC: {
     tier: "BASIC",
-    name: "Basic Plan",
+    name: "",
     description: "Perfect for individuals and small projects",
     monthlyPrice: 9.99,

[Timeout] StringLiteral
src/billing/subscription/types.ts:143:18
   BASIC: {
     tier: "BASIC",
     name: "Basic Plan",
-    description: "Perfect for individuals and small projects",
+    description: "",
     monthlyPrice: 9.99,
     yearlyPrice: 99.99,

[Timeout] ArrayDeclaration
src/billing/subscription/types.ts:147:15
     monthlyPrice: 9.99,
     yearlyPrice: 99.99,
     maxProjects: 1,
-    features: [
-      "Up to 1 project",
-      "100 posts per month",
-      "1GB media storage",
-      "2 social accounts",
-      "Basic analytics",
-      "Email support",
-    ],
+    features: [],
     limits: {
       postsPerMonth: 100,

[Timeout] StringLiteral
src/billing/subscription/types.ts:149:7
     maxProjects: 1,
     features: [
       "Up to 1 project",
-      "100 posts per month",
+      "",
       "1GB media storage",
       "2 social accounts",

[Timeout] StringLiteral
src/billing/subscription/types.ts:151:7
       "Up to 1 project",
       "100 posts per month",
       "1GB media storage",
-      "2 social accounts",
+      "",
       "Basic analytics",
       "Email support",

[Timeout] ObjectLiteral
src/billing/subscription/types.ts:155:13
       "Basic analytics",
       "Email support",
     ],
-    limits: {
-      postsPerMonth: 100,
-      mediaStorageGB: 1,
-      teamMembers: 1,
-      apiRequestsPerDay: 1000,
-      analyticsRetentionDays: 30,
-    },
+    limits: {},
   },
   PRO: {

[Killed] ObjectLiteral
src/billing/subscription/types.ts:163:8
       analyticsRetentionDays: 30,
     },
   },
-  PRO: {
-    tier: "PRO",
-    name: "Pro Plan",
-    description: "Great for growing businesses and teams",
-    monthlyPrice: 29.99,
-    yearlyPrice: 299.99,
-    maxProjects: 5,
-    features: [
-      "Up to 5 projects",
-      "1,000 posts per month",
-      "10GB media storage",
-      "10 social accounts",
-      "Advanced analytics",
-      "Team collaboration",
-      "Priority support",
-    ],
-    limits: {
-      postsPerMonth: 1000,
-      mediaStorageGB: 10,
-      teamMembers: 5,
-      apiRequestsPerDay: 10000,
-      analyticsRetentionDays: 90,
-    },
-  },
+  PRO: {},
   ENTERPRISE: {
     tier: "ENTERPRISE",
killedBy: subscriptionRoutes - Plans and Subscription Management GET /admin/billing/plans/:tier should get PRO plan
statusReason: expected undefined to be 'PRO' // Object.is equality

[Killed] StringLiteral
src/billing/subscription/types.ts:164:11
     },
   },
   PRO: {
-    tier: "PRO",
+    tier: "",
     name: "Pro Plan",
     description: "Great for growing businesses and teams",
killedBy: subscriptionRoutes - Plans and Subscription Management GET /admin/billing/plans/:tier should get PRO plan
statusReason: expected '' to be 'PRO' // Object.is equality

[Timeout] StringLiteral
src/billing/subscription/types.ts:166:18
   PRO: {
     tier: "PRO",
     name: "Pro Plan",
-    description: "Great for growing businesses and teams",
+    description: "",
     monthlyPrice: 29.99,
     yearlyPrice: 299.99,

[Timeout] StringLiteral
src/billing/subscription/types.ts:171:7
     yearlyPrice: 299.99,
     maxProjects: 5,
     features: [
-      "Up to 5 projects",
+      "",
       "1,000 posts per month",
       "10GB media storage",

[Timeout] StringLiteral
src/billing/subscription/types.ts:174:7
       "Up to 5 projects",
       "1,000 posts per month",
       "10GB media storage",
-      "10 social accounts",
+      "",
       "Advanced analytics",
       "Team collaboration",

[Timeout] StringLiteral
src/billing/subscription/types.ts:175:7
       "1,000 posts per month",
       "10GB media storage",
       "10 social accounts",
-      "Advanced analytics",
+      "",
       "Team collaboration",
       "Priority support",

[Timeout] ObjectLiteral
src/billing/subscription/types.ts:179:13
       "Team collaboration",
       "Priority support",
     ],
-    limits: {
-      postsPerMonth: 1000,
-      mediaStorageGB: 10,
-      teamMembers: 5,
-      apiRequestsPerDay: 10000,
-      analyticsRetentionDays: 90,
-    },
+    limits: {},
   },
   ENTERPRISE: {

[Timeout] StringLiteral
src/billing/subscription/types.ts:197:7
     features: [
       "Up to 50 projects",
       "Unlimited posts",
-      "100GB media storage",
+      "",
       "Unlimited social accounts",
       "Advanced analytics & reporting",

[Timeout] StringLiteral
src/billing/subscription/types.ts:199:7
       "Unlimited posts",
       "100GB media storage",
       "Unlimited social accounts",
-      "Advanced analytics & reporting",
+      "",
       "White-label options",
       "Custom integrations",

[Timeout] UnaryOperator
src/billing/subscription/types.ts:206:22
       "24/7 phone support",
     ],
     limits: {
-      postsPerMonth: -1, // Unlimited
+      postsPerMonth: +1, // Unlimited
       mediaStorageGB: 100,
       teamMembers: 25,
