[Killed] StringLiteral
src/billing/subscriptionRoutes.ts:25:5
 
   // ✅ Get all available subscription plans
   fastify.get(
-    "/admin/billing/plans",
+    "",
     { preHandler: [authenticateMiddleware, requireAdmin] },
     async (request, reply) => planHandler.getAllPlans(request, reply)
killedBy: subscriptionRoutes - Account Operations and Billing Analytics GET /admin/billing/stats should get subscription statistics; subscriptionRoutes - Account Operations and Billing Analytics GET /admin/billing/stats should reject without authentication; subscriptionRoutes - Account Operations and Billing Analytics POST /admin/billing/accounts/:accountId/validate-limits should validate CREATE_PROJECT limit
statusReason: The path could not be empty

[Killed] ArrayDeclaration
src/billing/subscriptionRoutes.ts:26:19
   // ✅ Get all available subscription plans
   fastify.get(
     "/admin/billing/plans",
-    { preHandler: [authenticateMiddleware, requireAdmin] },
+    { preHandler: [] },
     async (request, reply) => planHandler.getAllPlans(request, reply)
   );
killedBy: subscriptionRoutes - Plans and Subscription Management GET /admin/billing/plans should reject without authentication
statusReason: expected 200 to be 401 // Object.is equality

[Killed] ArrowFunction
src/billing/subscriptionRoutes.ts:27:5
   fastify.get(
     "/admin/billing/plans",
     { preHandler: [authenticateMiddleware, requireAdmin] },
-    async (request, reply) => planHandler.getAllPlans(request, reply)
+    () => undefined
   );
 
killedBy: subscriptionRoutes - Plans and Subscription Management GET /admin/billing/plans should get all subscription plans
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] StringLiteral
src/billing/subscriptionRoutes.ts:32:5
 
   // ✅ Get specific subscription plan
   fastify.get(
-    "/admin/billing/plans/:tier",
+    "",
     { preHandler: [authenticateMiddleware, requireAdmin] },
     async (request, reply) => planHandler.getSpecificPlan(request, reply)
killedBy: subscriptionRoutes - Plans and Subscription Management GET /admin/billing/plans should get all subscription plans; subscriptionRoutes - Plans and Subscription Management GET /admin/billing/plans should reject without authentication; subscriptionRoutes - Plans and Subscription Management GET /admin/billing/plans/:tier should get BASIC plan
statusReason: The path could not be empty

[Killed] ArrowFunction
src/billing/subscriptionRoutes.ts:34:5
   fastify.get(
     "/admin/billing/plans/:tier",
     { preHandler: [authenticateMiddleware, requireAdmin] },
-    async (request, reply) => planHandler.getSpecificPlan(request, reply)
+    () => undefined
   );
 
killedBy: subscriptionRoutes - Plans and Subscription Management GET /admin/billing/plans/:tier should get BASIC plan
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] StringLiteral
src/billing/subscriptionRoutes.ts:39:5
 
   // ✅ Get account subscription details
   fastify.get(
-    "/admin/billing/accounts/:accountId/subscription",
+    "",
     { preHandler: [authenticateMiddleware, requireAdmin] },
     async (request, reply) => accountHandler.getAccountSubscription(request, reply)
killedBy: subscriptionRoutes - Plans and Subscription Management GET /admin/billing/plans should get all subscription plans; subscriptionRoutes - Plans and Subscription Management GET /admin/billing/plans should reject without authentication; subscriptionRoutes - Plans and Subscription Management GET /admin/billing/plans/:tier should get BASIC plan
statusReason: The path could not be empty

[Killed] ArrowFunction
src/billing/subscriptionRoutes.ts:41:5
   fastify.get(
     "/admin/billing/accounts/:accountId/subscription",
     { preHandler: [authenticateMiddleware, requireAdmin] },
-    async (request, reply) => accountHandler.getAccountSubscription(request, reply)
+    () => undefined
   );
 
killedBy: subscriptionRoutes - Plans and Subscription Management GET /admin/billing/accounts/:accountId/subscription should get account subscription
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] ArrowFunction
src/billing/subscriptionRoutes.ts:48:5
   fastify.put(
     "/admin/billing/accounts/:accountId/subscription",
     { preHandler: [authenticateMiddleware, requireAdmin] },
-    async (request, reply) => accountHandler.updateAccountSubscription(request, reply)
+    () => undefined
   );
 
killedBy: subscriptionRoutes - Plans and Subscription Management PUT /admin/billing/accounts/:accountId/subscription should update account subscription
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] ArrowFunction
src/billing/subscriptionRoutes.ts:55:5
   fastify.get(
     "/admin/billing/subscriptions",
     { preHandler: [authenticateMiddleware, requireAdmin] },
-    async (request, reply) => accountHandler.listSubscriptions(request, reply)
+    () => undefined
   );
 
killedBy: subscriptionRoutes - Plans and Subscription Management GET /admin/billing/subscriptions should list all subscriptions
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] ArrayDeclaration
src/billing/subscriptionRoutes.ts:61:19
   // ✅ Get subscription statistics
   fastify.get(
     "/admin/billing/stats",
-    { preHandler: [authenticateMiddleware, requireAdmin] },
+    { preHandler: [] },
     async (request, reply) => analyticsHandler.getSubscriptionStats(request, reply)
   );
killedBy: subscriptionRoutes - Account Operations and Billing Analytics GET /admin/billing/stats should reject without authentication
statusReason: expected 200 to be 401 // Object.is equality

[Killed] ObjectLiteral
src/billing/subscriptionRoutes.ts:61:5
   // ✅ Get subscription statistics
   fastify.get(
     "/admin/billing/stats",
-    { preHandler: [authenticateMiddleware, requireAdmin] },
+    {},
     async (request, reply) => analyticsHandler.getSubscriptionStats(request, reply)
   );
killedBy: subscriptionRoutes - Account Operations and Billing Analytics GET /admin/billing/stats should reject without authentication
statusReason: expected 200 to be 401 // Object.is equality

[Killed] ArrowFunction
src/billing/subscriptionRoutes.ts:62:5
   fastify.get(
     "/admin/billing/stats",
     { preHandler: [authenticateMiddleware, requireAdmin] },
-    async (request, reply) => analyticsHandler.getSubscriptionStats(request, reply)
+    () => undefined
   );
 
killedBy: subscriptionRoutes - Account Operations and Billing Analytics GET /admin/billing/stats should get subscription statistics
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] ArrowFunction
src/billing/subscriptionRoutes.ts:69:5
   fastify.post(
     "/admin/billing/accounts/:accountId/validate-limits",
     { preHandler: [authenticateMiddleware, requireAdmin] },
-    async (request, reply) => accountHandler.validateLimits(request, reply)
+    () => undefined
   );
 
killedBy: subscriptionRoutes - Account Operations and Billing Analytics POST /admin/billing/accounts/:accountId/validate-limits should validate CREATE_PROJECT limit
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] StringLiteral
src/billing/subscriptionRoutes.ts:74:5
 
   // ✅ Suspend account subscription
   fastify.post(
-    "/admin/billing/accounts/:accountId/suspend",
+    "",
     { preHandler: [authenticateMiddleware, requireAdmin] },
     async (request, reply) => accountHandler.suspendSubscription(request, reply)
killedBy: subscriptionRoutes - Account Operations and Billing Analytics GET /admin/billing/stats should get subscription statistics; subscriptionRoutes - Account Operations and Billing Analytics GET /admin/billing/stats should reject without authentication; subscriptionRoutes - Account Operations and Billing Analytics POST /admin/billing/accounts/:accountId/validate-limits should validate CREATE_PROJECT limit
statusReason: The path could not be empty

[Killed] ArrayDeclaration
src/billing/subscriptionRoutes.ts:75:19
   // ✅ Suspend account subscription
   fastify.post(
     "/admin/billing/accounts/:accountId/suspend",
-    { preHandler: [authenticateMiddleware, requireAdmin] },
+    { preHandler: [] },
     async (request, reply) => accountHandler.suspendSubscription(request, reply)
   );
killedBy: subscriptionRoutes - Account Operations and Billing Analytics POST /admin/billing/accounts/:accountId/suspend should reject without authentication
statusReason: expected 200 to be 401 // Object.is equality

[Killed] ArrowFunction
src/billing/subscriptionRoutes.ts:76:5
   fastify.post(
     "/admin/billing/accounts/:accountId/suspend",
     { preHandler: [authenticateMiddleware, requireAdmin] },
-    async (request, reply) => accountHandler.suspendSubscription(request, reply)
+    () => undefined
   );
 
killedBy: subscriptionRoutes - Account Operations and Billing Analytics POST /admin/billing/accounts/:accountId/suspend should suspend account subscription
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] StringLiteral
src/billing/subscriptionRoutes.ts:81:5
 
   // ✅ Bulk upgrade subscriptions (Super Admin only)
   fastify.post(
-    "/admin/billing/bulk/upgrade",
+    "",
     { preHandler: [authenticateMiddleware, requireSuperAdmin] },
     async (request, reply) => accountHandler.bulkUpgrade(request, reply)
killedBy: subscriptionRoutes - Account Operations and Billing Analytics GET /admin/billing/stats should get subscription statistics; subscriptionRoutes - Account Operations and Billing Analytics GET /admin/billing/stats should reject without authentication; subscriptionRoutes - Account Operations and Billing Analytics POST /admin/billing/accounts/:accountId/validate-limits should validate CREATE_PROJECT limit
statusReason: The path could not be empty

[Killed] ArrowFunction
src/billing/subscriptionRoutes.ts:83:5
   fastify.post(
     "/admin/billing/bulk/upgrade",
     { preHandler: [authenticateMiddleware, requireSuperAdmin] },
-    async (request, reply) => accountHandler.bulkUpgrade(request, reply)
+    () => undefined
   );
 
killedBy: subscriptionRoutes - Account Operations and Billing Analytics POST /admin/billing/bulk/upgrade should bulk upgrade accounts with super admin
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] ArrayDeclaration
src/billing/subscriptionRoutes.ts:91:19
   // ✅ Subscription health endpoint
   fastify.get(
     "/admin/billing/health",
-    { preHandler: [authenticateMiddleware, requireAdmin] },
+    { preHandler: [] },
     async (request, reply) => analyticsHandler.getSubscriptionHealth(request, reply)
   );
killedBy: subscriptionRoutes - Trials, Reporting and Auto-Renewals GET /admin/billing/health should reject without authentication
statusReason: expected 200 to be 401 // Object.is equality

[Killed] ObjectLiteral
src/billing/subscriptionRoutes.ts:91:5
   // ✅ Subscription health endpoint
   fastify.get(
     "/admin/billing/health",
-    { preHandler: [authenticateMiddleware, requireAdmin] },
+    {},
     async (request, reply) => analyticsHandler.getSubscriptionHealth(request, reply)
   );
killedBy: subscriptionRoutes - Trials, Reporting and Auto-Renewals GET /admin/billing/health should reject without authentication
statusReason: expected 200 to be 401 // Object.is equality

[Killed] ArrowFunction
src/billing/subscriptionRoutes.ts:92:5
   fastify.get(
     "/admin/billing/health",
     { preHandler: [authenticateMiddleware, requireAdmin] },
-    async (request, reply) => analyticsHandler.getSubscriptionHealth(request, reply)
+    () => undefined
   );
 
killedBy: subscriptionRoutes - Trials, Reporting and Auto-Renewals GET /admin/billing/health should get subscription health metrics
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] ObjectLiteral
src/billing/subscriptionRoutes.ts:98:5
   // ✅ Export subscription data (CRITICAL FIX: CSV injection prevention)
   fastify.get(
     "/admin/billing/export",
-    { preHandler: [authenticateMiddleware, requireAdmin] },
+    {},
     async (request, reply) => analyticsHandler.exportSubscriptions(request, reply)
   );
killedBy: subscriptionRoutes - Trials, Reporting and Auto-Renewals GET /admin/billing/export should reject without authentication
statusReason: expected 200 to be 401 // Object.is equality

[Killed] ArrowFunction
src/billing/subscriptionRoutes.ts:99:5
   fastify.get(
     "/admin/billing/export",
     { preHandler: [authenticateMiddleware, requireAdmin] },
-    async (request, reply) => analyticsHandler.exportSubscriptions(request, reply)
+    () => undefined
   );
 
killedBy: subscriptionRoutes - Trials, Reporting and Auto-Renewals GET /admin/billing/export should export subscriptions as JSON
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] ObjectLiteral
src/billing/subscriptionRoutes.ts:105:5
   // ✅ Start trial for an account
   fastify.post(
     "/admin/billing/accounts/:accountId/trial/start",
-    { preHandler: [authenticateMiddleware, requireAdmin] },
+    {},
     async (request, reply) => trialHandler.startTrial(request, reply)
   );
killedBy: subscriptionRoutes - Trials, Reporting and Auto-Renewals POST /admin/billing/accounts/:accountId/trial/start should reject without authentication
statusReason: expected 200 to be 401 // Object.is equality

[Killed] ArrowFunction
src/billing/subscriptionRoutes.ts:106:5
   fastify.post(
     "/admin/billing/accounts/:accountId/trial/start",
     { preHandler: [authenticateMiddleware, requireAdmin] },
-    async (request, reply) => trialHandler.startTrial(request, reply)
+    () => undefined
   );
 
killedBy: subscriptionRoutes - Trials, Reporting and Auto-Renewals POST /admin/billing/accounts/:accountId/trial/start should start trial for account
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Survived] ArrayDeclaration
src/billing/subscriptionRoutes.ts:112:19
   // ✅ End trial for an account
   fastify.post(
     "/admin/billing/accounts/:accountId/trial/end",
-    { preHandler: [authenticateMiddleware, requireAdmin] },
+    { preHandler: [] },
     async (request, reply) => trialHandler.endTrial(request, reply)
   );

[Survived] ArrowFunction
src/billing/subscriptionRoutes.ts:113:5
   fastify.post(
     "/admin/billing/accounts/:accountId/trial/end",
     { preHandler: [authenticateMiddleware, requireAdmin] },
-    async (request, reply) => trialHandler.endTrial(request, reply)
+    () => undefined
   );
 

[Survived] ArrowFunction
src/billing/subscriptionRoutes.ts:120:5
   fastify.post(
     "/admin/billing/accounts/:accountId/trial/convert",
     { preHandler: [authenticateMiddleware, requireAdmin] },
-    async (request, reply) => trialHandler.convertTrial(request, reply)
+    () => undefined
   );
 

[Killed] ArrayDeclaration
src/billing/subscriptionRoutes.ts:126:19
   // ✅ Get expiring trials
   fastify.get(
     "/admin/billing/trials/expiring",
-    { preHandler: [authenticateMiddleware, requireAdmin] },
+    { preHandler: [] },
     async (request, reply) => trialHandler.getExpiringTrials(request, reply)
   );
killedBy: subscriptionRoutes - Trials, Reporting and Auto-Renewals GET /admin/billing/trials/expiring should reject without authentication
statusReason: expected 200 to be 401 // Object.is equality

[Killed] ArrowFunction
src/billing/subscriptionRoutes.ts:127:5
   fastify.get(
     "/admin/billing/trials/expiring",
     { preHandler: [authenticateMiddleware, requireAdmin] },
-    async (request, reply) => trialHandler.getExpiringTrials(request, reply)
+    () => undefined
   );
 
killedBy: subscriptionRoutes - Trials, Reporting and Auto-Renewals GET /admin/billing/trials/expiring should get expiring trials
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] StringLiteral
src/billing/subscriptionRoutes.ts:132:5
 
   // ✅ Process auto-renewals (manual trigger for admin)
   fastify.post(
-    "/admin/billing/auto-renewals/process",
+    "",
     { preHandler: [authenticateMiddleware, requireSuperAdmin] },
     async (request, reply) => trialHandler.processAutoRenewals(request, reply)
killedBy: subscriptionRoutes - Account Operations and Billing Analytics GET /admin/billing/stats should get subscription statistics; subscriptionRoutes - Account Operations and Billing Analytics GET /admin/billing/stats should reject without authentication; subscriptionRoutes - Account Operations and Billing Analytics POST /admin/billing/accounts/:accountId/validate-limits should validate CREATE_PROJECT limit
statusReason: The path could not be empty

[Killed] ArrayDeclaration
src/billing/subscriptionRoutes.ts:133:19
   // ✅ Process auto-renewals (manual trigger for admin)
   fastify.post(
     "/admin/billing/auto-renewals/process",
-    { preHandler: [authenticateMiddleware, requireSuperAdmin] },
+    { preHandler: [] },
     async (request, reply) => trialHandler.processAutoRenewals(request, reply)
   );
killedBy: subscriptionRoutes - Trials, Reporting and Auto-Renewals POST /admin/billing/auto-renewals/process should reject without super admin role
statusReason: expected 200 to be 403 // Object.is equality

[Killed] ObjectLiteral
src/billing/subscriptionRoutes.ts:133:5
   // ✅ Process auto-renewals (manual trigger for admin)
   fastify.post(
     "/admin/billing/auto-renewals/process",
-    { preHandler: [authenticateMiddleware, requireSuperAdmin] },
+    {},
     async (request, reply) => trialHandler.processAutoRenewals(request, reply)
   );
killedBy: subscriptionRoutes - Trials, Reporting and Auto-Renewals POST /admin/billing/auto-renewals/process should reject without super admin role
statusReason: expected 200 to be 403 // Object.is equality

[Killed] ArrowFunction
src/billing/subscriptionRoutes.ts:134:5
   fastify.post(
     "/admin/billing/auto-renewals/process",
     { preHandler: [authenticateMiddleware, requireSuperAdmin] },
-    async (request, reply) => trialHandler.processAutoRenewals(request, reply)
+    () => undefined
   );
 
killedBy: subscriptionRoutes - Trials, Reporting and Auto-Renewals POST /admin/billing/auto-renewals/process should process auto-renewals with super admin
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] ArrowFunction
src/billing/subscriptionRoutes.ts:141:5
   fastify.get(
     "/admin/billing/trials/stats",
     { preHandler: [authenticateMiddleware, requireAdmin] },
-    async (request, reply) => trialHandler.getTrialStats(request, reply)
+    () => undefined
   );
 };
killedBy: subscriptionRoutes - Trials, Reporting and Auto-Renewals GET /admin/billing/trials/stats should get trial statistics
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".
