[Killed] StringLiteral
src/billing/subscriptionSchemas.ts:12:28
 import { SecureSchemas } from "../security/inputValidation.js";
 
 // Core schemas
-const TierSchema = z.enum(["BASIC", "PRO", "ENTERPRISE"]);
+const TierSchema = z.enum(["", "PRO", "ENTERPRISE"]);
 const BillingCycleSchema = z.enum(["monthly", "yearly"]);
 
killedBy: subscriptionRoutes - Plans and Subscription Management GET /admin/billing/plans/:tier should get BASIC plan
statusReason: expected 400 to be 200 // Object.is equality

[Killed] ObjectLiteral
src/billing/subscriptionSchemas.ts:32:46
   reason: z.string().optional(),
 });
 
-export const ValidateLimitsSchema = z.object({
-  operation: z.enum(["CREATE_PROJECT", "ADD_TEAM_MEMBER", "UPLOAD_MEDIA"]),
-  amount: z.number().min(1).default(1),
-});
+export const ValidateLimitsSchema = z.object({});
 
 export const SuspendSubscriptionSchema = z.object({
killedBy: subscriptionRoutes - Account Operations and Billing Analytics POST /admin/billing/accounts/:accountId/validate-limits should reject invalid operation
statusReason: expected 200 to be 400 // Object.is equality

[Killed] StringLiteral
src/billing/subscriptionSchemas.ts:33:40
 });
 
 export const ValidateLimitsSchema = z.object({
-  operation: z.enum(["CREATE_PROJECT", "ADD_TEAM_MEMBER", "UPLOAD_MEDIA"]),
+  operation: z.enum(["CREATE_PROJECT", "", "UPLOAD_MEDIA"]),
   amount: z.number().min(1).default(1),
 });
killedBy: subscriptionRoutes - Account Operations and Billing Analytics POST /admin/billing/accounts/:accountId/validate-limits should validate ADD_TEAM_MEMBER limit
statusReason: expected 400 to be 200 // Object.is equality

[Killed] ArrayDeclaration
src/billing/subscriptionSchemas.ts:33:21
 });
 
 export const ValidateLimitsSchema = z.object({
-  operation: z.enum(["CREATE_PROJECT", "ADD_TEAM_MEMBER", "UPLOAD_MEDIA"]),
+  operation: z.enum([]),
   amount: z.number().min(1).default(1),
 });
killedBy: subscriptionRoutes - Account Operations and Billing Analytics POST /admin/billing/accounts/:accountId/validate-limits should validate CREATE_PROJECT limit
statusReason: expected 400 to be 200 // Object.is equality

[Killed] MethodExpression
src/billing/subscriptionSchemas.ts:34:11
 
 export const ValidateLimitsSchema = z.object({
   operation: z.enum(["CREATE_PROJECT", "ADD_TEAM_MEMBER", "UPLOAD_MEDIA"]),
-  amount: z.number().min(1).default(1),
+  amount: z.number().max(1).default(1),
 });
 
killedBy: subscriptionRoutes - Account Operations and Billing Analytics POST /admin/billing/accounts/:accountId/validate-limits should validate ADD_TEAM_MEMBER limit
statusReason: expected 400 to be 200 // Object.is equality

[Killed] MethodExpression
src/billing/subscriptionSchemas.ts:42:15
 });
 
 export const BulkUpgradeSchema = z.object({
-  accountIds: z.array(IdSchema).min(1).max(50),
+  accountIds: z.array(IdSchema).min(1).min(50),
   newTier: TierSchema,
   billingCycle: BillingCycleSchema,
killedBy: subscriptionRoutes - Account Operations and Billing Analytics POST /admin/billing/bulk/upgrade should bulk upgrade accounts with super admin
statusReason: expected 400 to be 200 // Object.is equality

[Killed] MethodExpression
src/billing/subscriptionSchemas.ts:42:15
 });
 
 export const BulkUpgradeSchema = z.object({
-  accountIds: z.array(IdSchema).min(1).max(50),
+  accountIds: z.array(IdSchema).max(1).max(50),
   newTier: TierSchema,
   billingCycle: BillingCycleSchema,
killedBy: BulkUpgradeSchema rejects empty accountIds
statusReason: The expression evaluated to a falsy value:

  it("rejects invalid operation", () => {
    assert.ok(!ValidateLimitsSchema.safeParse({ operation: "DELETE" }).success);
  })

[Killed] ArrayDeclaration
src/billing/subscriptionSchemas.ts:52:18
 export const SubscriptionFiltersSchema = z.object({
   tier: TierSchema.optional(),
   search: z.string().optional(),
-  sortBy: z.enum(["createdAt", "updatedAt", "email", "subscription"]).optional(),
+  sortBy: z.enum([]).optional(),
   sortOrder: z.enum(["asc", "desc"]).optional(),
   page: z.coerce.number().int().min(1).optional().default(1),
killedBy: SubscriptionFiltersSchema accepts valid sort options
statusReason: The expression evaluated to a falsy value:

  it("rejects more than 50 accountIds", () => {
  const ids = Array.from({ length: 51 }, () => "550e8400-e29b-41d4-a716-446655440000");
  assert.ok(!BulkUpgradeSchema.safeParse({
  accountIds: ids,
  newTier: "PRO",
  billingCycle: "monthly",

[Killed] ArrayDeclaration
src/billing/subscriptionSchemas.ts:53:21
   tier: TierSchema.optional(),
   search: z.string().optional(),
   sortBy: z.enum(["createdAt", "updatedAt", "email", "subscription"]).optional(),
-  sortOrder: z.enum(["asc", "desc"]).optional(),
+  sortOrder: z.enum([]).optional(),
   page: z.coerce.number().int().min(1).optional().default(1),
   limit: z.coerce.number().int().min(1).max(100).optional().default(50),
killedBy: subscriptionRoutes - Plans and Subscription Management GET /admin/billing/subscriptions should sort by field
statusReason: expected 400 to be 200 // Object.is equality

[Killed] StringLiteral
src/billing/subscriptionSchemas.ts:53:29
   tier: TierSchema.optional(),
   search: z.string().optional(),
   sortBy: z.enum(["createdAt", "updatedAt", "email", "subscription"]).optional(),
-  sortOrder: z.enum(["asc", "desc"]).optional(),
+  sortOrder: z.enum(["asc", ""]).optional(),
   page: z.coerce.number().int().min(1).optional().default(1),
   limit: z.coerce.number().int().min(1).max(100).optional().default(50),
killedBy: subscriptionRoutes - Plans and Subscription Management GET /admin/billing/subscriptions should sort by field
statusReason: expected 400 to be 200 // Object.is equality

[Killed] MethodExpression
src/billing/subscriptionSchemas.ts:54:9
   search: z.string().optional(),
   sortBy: z.enum(["createdAt", "updatedAt", "email", "subscription"]).optional(),
   sortOrder: z.enum(["asc", "desc"]).optional(),
-  page: z.coerce.number().int().min(1).optional().default(1),
+  page: z.coerce.number().int().max(1).optional().default(1),
   limit: z.coerce.number().int().min(1).max(100).optional().default(50),
 });
killedBy: SubscriptionFiltersSchema rejects page < 1
statusReason: The expression evaluated to a falsy value:

  it("accepts exactly 50 accountIds", () => {
   const ids = Array.from({ length: 50 }, () => "550e8400-e29b-41d4-a716-446655440000");
   assert.ok(BulkUpgradeSchema.safeParse({
     accountIds: ids,
     newTier: "PRO",
     billingCycle: "monthly",

[Killed] MethodExpression
src/billing/subscriptionSchemas.ts:55:10
   sortBy: z.enum(["createdAt", "updatedAt", "email", "subscription"]).optional(),
   sortOrder: z.enum(["asc", "desc"]).optional(),
   page: z.coerce.number().int().min(1).optional().default(1),
-  limit: z.coerce.number().int().min(1).max(100).optional().default(50),
+  limit: z.coerce.number().int().max(1).max(100).optional().default(50),
 });
 
killedBy: SubscriptionFiltersSchema coerces string numbers
statusReason: false == true

[Killed] MethodExpression
src/billing/subscriptionSchemas.ts:55:10
   sortBy: z.enum(["createdAt", "updatedAt", "email", "subscription"]).optional(),
   sortOrder: z.enum(["asc", "desc"]).optional(),
   page: z.coerce.number().int().min(1).optional().default(1),
-  limit: z.coerce.number().int().min(1).max(100).optional().default(50),
+  limit: z.coerce.number().int().min(1).min(100).optional().default(50),
 });
 
killedBy: SubscriptionFiltersSchema rejects limit > 100
statusReason: false == true

[Killed] ObjectLiteral
src/billing/subscriptionSchemas.ts:58:43
   limit: z.coerce.number().int().min(1).max(100).optional().default(50),
 });
 
-export const ExportQuerySchema = z.object({
-  format: z.enum(["json", "csv"]).default("json"),
-  tier: TierSchema.optional(),
-  startDate: z.string().pipe(z.coerce.date()).optional(),
-  endDate: z.string().pipe(z.coerce.date()).optional(),
-});
+export const ExportQuerySchema = z.object({});
 
 // Trial schemas
killedBy: ExportQuerySchema defaults format to json
statusReason: Expected values to be strictly equal:
+ actual - expected

+ undefined
- 'json'

[Killed] StringLiteral
src/billing/subscriptionSchemas.ts:59:19
 });
 
 export const ExportQuerySchema = z.object({
-  format: z.enum(["json", "csv"]).default("json"),
+  format: z.enum(["", "csv"]).default("json"),
   tier: TierSchema.optional(),
   startDate: z.string().pipe(z.coerce.date()).optional(),
killedBy: subscriptionRoutes - Trials, Reporting and Auto-Renewals GET /admin/billing/export should export subscriptions as JSON
statusReason: expected 400 to be 200 // Object.is equality

[Killed] StringLiteral
src/billing/subscriptionSchemas.ts:67:28
 
 // Trial schemas
 export const StartTrialSchema = z.object({
-  tier: TierSchema.default("PRO"),
+  tier: TierSchema.default(""),
   trialDurationDays: z.number().min(1).max(30).default(7),
   autoRenewal: z.boolean().default(false),
killedBy: StartTrialSchema defaults tier to PRO
statusReason: Expected values to be strictly equal:

'' !== 'PRO'

[Killed] MethodExpression
src/billing/subscriptionSchemas.ts:68:22
 // Trial schemas
 export const StartTrialSchema = z.object({
   tier: TierSchema.default("PRO"),
-  trialDurationDays: z.number().min(1).max(30).default(7),
+  trialDurationDays: z.number().min(1).min(30).default(7),
   autoRenewal: z.boolean().default(false),
   billingCycle: BillingCycleSchema.default("monthly"),
killedBy: StartTrialSchema rejects trial duration > 30 days
statusReason: The expression evaluated to a falsy value:

  describe("ExportQuerySchema", () => {
    it("defaults format to json", () => {
      const result = ExportQuerySchema.safeParse({});
      assert.ok(result.success);
      if (result.success) assert.equal(result.data.format, "json");
    });

[Killed] MethodExpression
src/billing/subscriptionSchemas.ts:68:22
 // Trial schemas
 export const StartTrialSchema = z.object({
   tier: TierSchema.default("PRO"),
-  trialDurationDays: z.number().min(1).max(30).default(7),
+  trialDurationDays: z.number().max(1).max(30).default(7),
   autoRenewal: z.boolean().default(false),
   billingCycle: BillingCycleSchema.default("monthly"),
killedBy: subscriptionRoutes - Trials, Reporting and Auto-Renewals POST /admin/billing/accounts/:accountId/trial/start should start trial for account
statusReason: expected 400 to be 200 // Object.is equality

[Killed] BooleanLiteral
src/billing/subscriptionSchemas.ts:69:36
 export const StartTrialSchema = z.object({
   tier: TierSchema.default("PRO"),
   trialDurationDays: z.number().min(1).max(30).default(7),
-  autoRenewal: z.boolean().default(false),
+  autoRenewal: z.boolean().default(true),
   billingCycle: BillingCycleSchema.default("monthly"),
 });
killedBy: StartTrialSchema defaults autoRenewal to false
statusReason: Expected values to be strictly equal:

true !== false

[Killed] ObjectLiteral
src/billing/subscriptionSchemas.ts:81:51
   billingCycle: BillingCycleSchema.default("monthly"),
 });
 
-export const ExpiringTrialsQuerySchema = z.object({
-  days: z.coerce.number().int().min(1).max(30).optional().default(1),
-});
+export const ExpiringTrialsQuerySchema = z.object({});
 
killedBy: ExpiringTrialsQuerySchema defaults days to 1
statusReason: Expected values to be strictly equal:

undefined !== 1

[Killed] MethodExpression
src/billing/subscriptionSchemas.ts:82:9
 });
 
 export const ExpiringTrialsQuerySchema = z.object({
-  days: z.coerce.number().int().min(1).max(30).optional().default(1),
+  days: z.coerce.number().int().min(1).min(30).optional().default(1),
 });
 
killedBy: ExpiringTrialsQuerySchema rejects days > 30
statusReason: The expression evaluated to a falsy value:

  it("defaults trialDurationDays to 7", () => {
  const result = StartTrialSchema.safeParse({});
  assert.ok(result.success);
  if (result.success) assert.equal(result.data.trialDurationDays, 7);
  })

[Killed] MethodExpression
src/billing/subscriptionSchemas.ts:82:9
 });
 
 export const ExpiringTrialsQuerySchema = z.object({
-  days: z.coerce.number().int().min(1).max(30).optional().default(1),
+  days: z.coerce.number().int().max(1).max(30).optional().default(1),
 });
 
killedBy: ExpiringTrialsQuerySchema rejects days < 1
statusReason: The expression evaluated to a falsy value:

  StartTrialSchema.safeParse({})
