[Killed] BlockStatement
src/analytics/roi/RevenueCalculator.ts:22:42
   /**
    * Get default revenue model
    */
-  getDefaultRevenueModel(): RevenueModel {
-    return {
-      conversionRate: 2.5, // 2.5% of clicks convert
-      averageOrderValue: 85,
-      customerLifetimeValue: 450,
-      brandAwarenessValue: 0.002, // $0.002 per impression
-      leadGenerationValue: 15, // $15 per lead
-      organicTrafficValue: 0.5, // $0.50 per organic click
-    };
-  }
+  getDefaultRevenueModel(): RevenueModel {}
 
   /**
killedBy: RevenueCalculator getDefaultRevenueModel returns model with conversionRate 2.5
statusReason: Cannot read properties of undefined (reading 'conversionRate')

[Killed] ObjectLiteral
src/analytics/roi/RevenueCalculator.ts:23:12
    * Get default revenue model
    */
   getDefaultRevenueModel(): RevenueModel {
-    return {
-      conversionRate: 2.5, // 2.5% of clicks convert
-      averageOrderValue: 85,
-      customerLifetimeValue: 450,
-      brandAwarenessValue: 0.002, // $0.002 per impression
-      leadGenerationValue: 15, // $15 per lead
-      organicTrafficValue: 0.5, // $0.50 per organic click
-    };
+    return {};
   }
 
killedBy: RevenueCalculator getDefaultRevenueModel returns model with conversionRate 2.5
statusReason: Expected values to be strictly equal:

undefined !== 2.5

[Survived] MethodExpression
src/analytics/roi/RevenueCalculator.ts:43:25
     revenueModel: RevenueModel
   ): RevenueBreakdown {
     // Calculate direct revenue from tracked conversions
-    const directSales = conversionsData
-      .filter((c) => c.conversion_type === "sale")
+    const directSales = conversionsData
       .reduce((sum, c) => sum + c.value, 0);
 

[Killed] ArrowFunction
src/analytics/roi/RevenueCalculator.ts:44:15
   ): RevenueBreakdown {
     // Calculate direct revenue from tracked conversions
     const directSales = conversionsData
-      .filter((c) => c.conversion_type === "sale")
+      .filter(() => undefined)
       .reduce((sum, c) => sum + c.value, 0);
 
killedBy: RevenueCalculator calculateRevenue sums directSales from sale conversions
statusReason: Expected values to be strictly equal:

0 !== 300

[Killed] EqualityOperator
src/analytics/roi/RevenueCalculator.ts:44:22
   ): RevenueBreakdown {
     // Calculate direct revenue from tracked conversions
     const directSales = conversionsData
-      .filter((c) => c.conversion_type === "sale")
+      .filter((c) => c.conversion_type !== "sale")
       .reduce((sum, c) => sum + c.value, 0);
 
killedBy: RevenueCalculator calculateRevenue sums directSales from sale conversions
statusReason: Expected values to be strictly equal:

0 !== 300

[Killed] ArrowFunction
src/analytics/roi/RevenueCalculator.ts:45:15
     // Calculate direct revenue from tracked conversions
     const directSales = conversionsData
       .filter((c) => c.conversion_type === "sale")
-      .reduce((sum, c) => sum + c.value, 0);
+      .reduce(() => undefined, 0);
 
     const leadGeneration =
killedBy: RevenueCalculator calculateRevenue sums directSales from sale conversions
statusReason: Expected values to be strictly equal:

undefined !== 300

[Killed] ArithmeticOperator
src/analytics/roi/RevenueCalculator.ts:45:27
     // Calculate direct revenue from tracked conversions
     const directSales = conversionsData
       .filter((c) => c.conversion_type === "sale")
-      .reduce((sum, c) => sum + c.value, 0);
+      .reduce((sum, c) => sum - c.value, 0);
 
     const leadGeneration =
killedBy: RevenueCalculator calculateRevenue sums directSales from sale conversions
statusReason: Expected values to be strictly equal:

-300 !== 300

[Killed] ConditionalExpression
src/analytics/roi/RevenueCalculator.ts:48:37
       .reduce((sum, c) => sum + c.value, 0);
 
     const leadGeneration =
-      conversionsData.filter((c) => c.conversion_type === "lead" || c.conversion_type === "signup")
+      conversionsData.filter((c) => false)
         .length * revenueModel.leadGenerationValue;
 
killedBy: RevenueCalculator calculateRevenue calculates leadGeneration from lead+signup conversions
statusReason: Expected values to be strictly equal:

0 !== 20

[Killed] ConditionalExpression
src/analytics/roi/RevenueCalculator.ts:48:37
       .reduce((sum, c) => sum + c.value, 0);
 
     const leadGeneration =
-      conversionsData.filter((c) => c.conversion_type === "lead" || c.conversion_type === "signup")
+      conversionsData.filter((c) => false || c.conversion_type === "signup")
         .length * revenueModel.leadGenerationValue;
 
killedBy: RevenueCalculator calculateRevenue calculates leadGeneration from lead+signup conversions
statusReason: Expected values to be strictly equal:

10 !== 20

[Killed] ArithmeticOperator
src/analytics/roi/RevenueCalculator.ts:55:28
     const metrics = AnalyticsAggregator.calculateEngagementMetrics(analyticsData);
 
     // Calculate brand awareness value
-    const brandAwareness = metrics.totalViews * revenueModel.brandAwarenessValue;
+    const brandAwareness = metrics.totalViews / revenueModel.brandAwarenessValue;
 
     // Calculate organic traffic value
killedBy: RevenueCalculator calculateRevenue calculates brandAwareness from views
statusReason: Expected values to be strictly equal:

1000000 !== 100

[Killed] ArithmeticOperator
src/analytics/roi/RevenueCalculator.ts:58:40
     const brandAwareness = metrics.totalViews * revenueModel.brandAwarenessValue;
 
     // Calculate organic traffic value
-    const estimatedClicks = Math.floor(metrics.totalViews * 0.02); // 2% CTR estimate
+    const estimatedClicks = Math.floor(metrics.totalViews / 0.02); // 2% CTR estimate
     const organicTraffic = estimatedClicks * revenueModel.organicTrafficValue;
 
killedBy: RevenueCalculator calculateRevenue calculates organicTraffic from estimated clicks
statusReason: Expected values to be strictly equal:

500000 !== 200

[Survived] ArithmeticOperator
src/analytics/roi/RevenueCalculator.ts:59:28
 
     // Calculate organic traffic value
     const estimatedClicks = Math.floor(metrics.totalViews * 0.02); // 2% CTR estimate
-    const organicTraffic = estimatedClicks * revenueModel.organicTrafficValue;
+    const organicTraffic = estimatedClicks / revenueModel.organicTrafficValue;
 
     // Customer retention value (based on engagement)

[Survived] ArithmeticOperator
src/analytics/roi/RevenueCalculator.ts:62:31
     const organicTraffic = estimatedClicks * revenueModel.organicTrafficValue;
 
     // Customer retention value (based on engagement)
-    const customerRetention = metrics.totalEngagement * 0.1; // $0.10 per engagement for retention
+    const customerRetention = metrics.totalEngagement / 0.1; // $0.10 per engagement for retention
 
     // Paid traffic value (if any advertising)

[Killed] BlockStatement
src/analytics/roi/RevenueCalculator.ts:84:13
     providerAnalytics: AnalyticsDataPoint[],
     providerConversions: ConversionDataPoint[],
     revenueModel: RevenueModel
-  ): number {
-    // Calculate direct revenue from conversions
-    const directRevenue = providerConversions.reduce((sum, c) => sum + c.value, 0);
-
-    // Calculate brand awareness revenue
-    const impressions = providerAnalytics.reduce((sum, a) => sum + (a.views || 0), 0);
-    const brandAwarenessRevenue = impressions * revenueModel.brandAwarenessValue;
-
-    // Calculate organic traffic revenue
-    const estimatedClicks = Math.floor(impressions * 0.02);
-    const organicRevenue = estimatedClicks * revenueModel.organicTrafficValue;
-
-    return directRevenue + brandAwarenessRevenue + organicRevenue;
-  }
+  ): number {}
 
   /**
killedBy: RevenueCalculator calculateProviderRevenue sums conversion values + brand awareness + organic
statusReason: Expected values to be strictly equal:

undefined !== 70

[Killed] ArrowFunction
src/analytics/roi/RevenueCalculator.ts:86:54
     revenueModel: RevenueModel
   ): number {
     // Calculate direct revenue from conversions
-    const directRevenue = providerConversions.reduce((sum, c) => sum + c.value, 0);
+    const directRevenue = providerConversions.reduce(() => undefined, 0);
 
     // Calculate brand awareness revenue
killedBy: RevenueCalculator calculateProviderRevenue sums conversion values + brand awareness + organic
statusReason: Expected values to be strictly equal:

NaN !== 70

[Killed] ArithmeticOperator
src/analytics/roi/RevenueCalculator.ts:86:66
     revenueModel: RevenueModel
   ): number {
     // Calculate direct revenue from conversions
-    const directRevenue = providerConversions.reduce((sum, c) => sum + c.value, 0);
+    const directRevenue = providerConversions.reduce((sum, c) => sum - c.value, 0);
 
     // Calculate brand awareness revenue
killedBy: RevenueCalculator calculateProviderRevenue sums conversion values + brand awareness + organic
statusReason: Expected values to be strictly equal:

-30 !== 70

[Killed] ArithmeticOperator
src/analytics/roi/RevenueCalculator.ts:89:62
     const directRevenue = providerConversions.reduce((sum, c) => sum + c.value, 0);
 
     // Calculate brand awareness revenue
-    const impressions = providerAnalytics.reduce((sum, a) => sum + (a.views || 0), 0);
+    const impressions = providerAnalytics.reduce((sum, a) => sum - (a.views || 0), 0);
     const brandAwarenessRevenue = impressions * revenueModel.brandAwarenessValue;
 
killedBy: RevenueCalculator calculateProviderRevenue sums conversion values + brand awareness + organic
statusReason: Expected values to be strictly equal:

30 !== 70

[Killed] LogicalOperator
src/analytics/roi/RevenueCalculator.ts:89:69
     const directRevenue = providerConversions.reduce((sum, c) => sum + c.value, 0);
 
     // Calculate brand awareness revenue
-    const impressions = providerAnalytics.reduce((sum, a) => sum + (a.views || 0), 0);
+    const impressions = providerAnalytics.reduce((sum, a) => sum + (a.views && 0), 0);
     const brandAwarenessRevenue = impressions * revenueModel.brandAwarenessValue;
 
killedBy: RevenueCalculator calculateProviderRevenue sums conversion values + brand awareness + organic
statusReason: Expected values to be strictly equal:

50 !== 70

[Killed] ArithmeticOperator
src/analytics/roi/RevenueCalculator.ts:90:35
 
     // Calculate brand awareness revenue
     const impressions = providerAnalytics.reduce((sum, a) => sum + (a.views || 0), 0);
-    const brandAwarenessRevenue = impressions * revenueModel.brandAwarenessValue;
+    const brandAwarenessRevenue = impressions / revenueModel.brandAwarenessValue;
 
     // Calculate organic traffic revenue
killedBy: RevenueCalculator calculateProviderRevenue sums conversion values + brand awareness + organic
statusReason: Expected values to be strictly equal:

100060 !== 70

[Killed] ArithmeticOperator
src/analytics/roi/RevenueCalculator.ts:93:40
     const brandAwarenessRevenue = impressions * revenueModel.brandAwarenessValue;
 
     // Calculate organic traffic revenue
-    const estimatedClicks = Math.floor(impressions * 0.02);
+    const estimatedClicks = Math.floor(impressions / 0.02);
     const organicRevenue = estimatedClicks * revenueModel.organicTrafficValue;
 
killedBy: RevenueCalculator calculateProviderRevenue sums conversion values + brand awareness + organic
statusReason: Expected values to be strictly equal:

25060 !== 70

[Killed] ArithmeticOperator
src/analytics/roi/RevenueCalculator.ts:94:28
 
     // Calculate organic traffic revenue
     const estimatedClicks = Math.floor(impressions * 0.02);
-    const organicRevenue = estimatedClicks * revenueModel.organicTrafficValue;
+    const organicRevenue = estimatedClicks / revenueModel.organicTrafficValue;
 
     return directRevenue + brandAwarenessRevenue + organicRevenue;
killedBy: RevenueCalculator calculateProviderRevenue sums conversion values + brand awareness + organic
statusReason: Expected values to be strictly equal:

100 !== 70

[Killed] ArithmeticOperator
src/analytics/roi/RevenueCalculator.ts:96:12
     const estimatedClicks = Math.floor(impressions * 0.02);
     const organicRevenue = estimatedClicks * revenueModel.organicTrafficValue;
 
-    return directRevenue + brandAwarenessRevenue + organicRevenue;
+    return directRevenue + brandAwarenessRevenue - organicRevenue;
   }
 
killedBy: RevenueCalculator calculateProviderRevenue sums conversion values + brand awareness + organic
statusReason: Expected values to be strictly equal:

50 !== 70

[Killed] ArithmeticOperator
src/analytics/roi/RevenueCalculator.ts:96:12
     const estimatedClicks = Math.floor(impressions * 0.02);
     const organicRevenue = estimatedClicks * revenueModel.organicTrafficValue;
 
-    return directRevenue + brandAwarenessRevenue + organicRevenue;
+    return directRevenue - brandAwarenessRevenue + organicRevenue;
   }
 
killedBy: RevenueCalculator calculateProviderRevenue sums conversion values + brand awareness + organic
statusReason: Expected values to be strictly equal:

50 !== 70

[Killed] BlockStatement
src/analytics/roi/RevenueCalculator.ts:102:89
   /**
    * Calculate estimated clicks from analytics data
    */
-  calculateEstimatedClicks(analyticsData: AnalyticsDataPoint[], ctrRate = 0.02): number {
-    const totalViews = analyticsData.reduce((sum, a) => sum + (a.views || 0), 0);
-    return Math.floor(totalViews * ctrRate);
-  }
+  calculateEstimatedClicks(analyticsData: AnalyticsDataPoint[], ctrRate = 0.02): number {}
 
   /**
killedBy: RevenueCalculator calculateEstimatedClicks uses 2% CTR by default
statusReason: Expected values to be strictly equal:

undefined !== 20

[Killed] ConditionalExpression
src/analytics/roi/RevenueCalculator.ts:103:64
    * Calculate estimated clicks from analytics data
    */
   calculateEstimatedClicks(analyticsData: AnalyticsDataPoint[], ctrRate = 0.02): number {
-    const totalViews = analyticsData.reduce((sum, a) => sum + (a.views || 0), 0);
+    const totalViews = analyticsData.reduce((sum, a) => sum + (true), 0);
     return Math.floor(totalViews * ctrRate);
   }
killedBy: RevenueCalculator calculateEstimatedClicks uses 2% CTR by default
statusReason: Expected values to be strictly equal:

0 !== 20

[Killed] LogicalOperator
src/analytics/roi/RevenueCalculator.ts:103:64
    * Calculate estimated clicks from analytics data
    */
   calculateEstimatedClicks(analyticsData: AnalyticsDataPoint[], ctrRate = 0.02): number {
-    const totalViews = analyticsData.reduce((sum, a) => sum + (a.views || 0), 0);
+    const totalViews = analyticsData.reduce((sum, a) => sum + (a.views && 0), 0);
     return Math.floor(totalViews * ctrRate);
   }
killedBy: RevenueCalculator calculateEstimatedClicks uses 2% CTR by default
statusReason: Expected values to be strictly equal:

0 !== 20

[Killed] ArithmeticOperator
src/analytics/roi/RevenueCalculator.ts:104:23
    */
   calculateEstimatedClicks(analyticsData: AnalyticsDataPoint[], ctrRate = 0.02): number {
     const totalViews = analyticsData.reduce((sum, a) => sum + (a.views || 0), 0);
-    return Math.floor(totalViews * ctrRate);
+    return Math.floor(totalViews / ctrRate);
   }
 
killedBy: RevenueCalculator calculateEstimatedClicks uses 2% CTR by default
statusReason: Expected values to be strictly equal:

50000 !== 20

[Killed] BlockStatement
src/analytics/roi/RevenueCalculator.ts:110:69
   /**
    * Calculate total revenue from all sources
    */
-  calculateTotalRevenue(revenueBreakdown: RevenueBreakdown): number {
-    return Object.values(revenueBreakdown).reduce((sum, revenue) => sum + revenue, 0);
-  }
+  calculateTotalRevenue(revenueBreakdown: RevenueBreakdown): number {}
 }
 
killedBy: RevenueCalculator calculateTotalRevenue sums all revenue sources
statusReason: Expected values to be strictly equal:

undefined !== 185

[Killed] ArrowFunction
src/analytics/roi/RevenueCalculator.ts:111:51
    * Calculate total revenue from all sources
    */
   calculateTotalRevenue(revenueBreakdown: RevenueBreakdown): number {
-    return Object.values(revenueBreakdown).reduce((sum, revenue) => sum + revenue, 0);
+    return Object.values(revenueBreakdown).reduce(() => undefined, 0);
   }
 }
killedBy: RevenueCalculator calculateTotalRevenue sums all revenue sources
statusReason: Expected values to be strictly equal:

undefined !== 185

[Killed] ArithmeticOperator
src/analytics/roi/RevenueCalculator.ts:111:69
    * Calculate total revenue from all sources
    */
   calculateTotalRevenue(revenueBreakdown: RevenueBreakdown): number {
-    return Object.values(revenueBreakdown).reduce((sum, revenue) => sum + revenue, 0);
+    return Object.values(revenueBreakdown).reduce((sum, revenue) => sum - revenue, 0);
   }
 }
killedBy: RevenueCalculator calculateTotalRevenue sums all revenue sources
statusReason: Expected values to be strictly equal:

-185 !== 185
