[Killed] ConditionalExpression
src/cqrs/CQRSBus.ts:270:30
     try {
       // Check Redis connection
       const redisStatus = await this.config.redis.ping();
-      const isRedisHealthy = redisStatus === "PONG";
+      const isRedisHealthy = false;
 
       // Check Event Service
killedBy: CQRSBus - Health Checks should report healthy status when all systems operational
statusReason: expected 'unhealthy' to be 'healthy' // Object.is equality

[Killed] EqualityOperator
src/cqrs/CQRSBus.ts:270:30
     try {
       // Check Redis connection
       const redisStatus = await this.config.redis.ping();
-      const isRedisHealthy = redisStatus === "PONG";
+      const isRedisHealthy = redisStatus !== "PONG";
 
       // Check Event Service
killedBy: CQRSBus - Health Checks should report healthy status when all systems operational
statusReason: expected 'unhealthy' to be 'healthy' // Object.is equality

[Killed] LogicalOperator
src/cqrs/CQRSBus.ts:275:9
       // Check Event Service
       const eventServiceHealthResult = await this.config.eventService.healthCheck();
       const isEventServiceHealthy =
-        eventServiceHealthResult.ok && eventServiceHealthResult.value.status === "healthy";
+        eventServiceHealthResult.ok || eventServiceHealthResult.value.status === "healthy";
 
       return {
killedBy: CQRSBus - Health Checks should report unhealthy when EventService is down
statusReason: expected 'healthy' to be 'unhealthy' // Object.is equality

[Killed] ConditionalExpression
src/cqrs/CQRSBus.ts:275:9
       // Check Event Service
       const eventServiceHealthResult = await this.config.eventService.healthCheck();
       const isEventServiceHealthy =
-        eventServiceHealthResult.ok && eventServiceHealthResult.value.status === "healthy";
+        true;
 
       return {
killedBy: CQRSBus - Health Checks should report unhealthy when EventService is down
statusReason: expected 'healthy' to be 'unhealthy' // Object.is equality

[Killed] ConditionalExpression
src/cqrs/CQRSBus.ts:278:17
         eventServiceHealthResult.ok && eventServiceHealthResult.value.status === "healthy";
 
       return {
-        status: isRedisHealthy && isEventServiceHealthy ? "healthy" : "unhealthy",
+        status: true ? "healthy" : "unhealthy",
         details: {
           commandHandlers: this.commandHandlers.size,
killedBy: CQRSBus - Health Checks should report unhealthy when EventService is down
statusReason: expected 'healthy' to be 'unhealthy' // Object.is equality

[Killed] ConditionalExpression
src/cqrs/CQRSBus.ts:278:17
         eventServiceHealthResult.ok && eventServiceHealthResult.value.status === "healthy";
 
       return {
-        status: isRedisHealthy && isEventServiceHealthy ? "healthy" : "unhealthy",
+        status: false ? "healthy" : "unhealthy",
         details: {
           commandHandlers: this.commandHandlers.size,
killedBy: CQRSBus - Health Checks should report healthy status when all systems operational
statusReason: expected 'unhealthy' to be 'healthy' // Object.is equality

[NoCoverage] BlockStatement
src/cqrs/CQRSBus.ts:286:21
           eventService: isEventServiceHealthy,
         },
       };
-    } catch (error) {
-      logger.error({ err: error }, "CQRS Bus health check failed");
-      return {
-        status: "unhealthy",
-        details: {
-          commandHandlers: this.commandHandlers.size,
-          queryHandlers: this.queryHandlers.size,
-          redis: false,
-          eventService: false,
-        },
-      };
-    }
+    } catch (error) {}
   }
 

[NoCoverage] ObjectLiteral
src/cqrs/CQRSBus.ts:290:18
       logger.error({ err: error }, "CQRS Bus health check failed");
       return {
         status: "unhealthy",
-        details: {
-          commandHandlers: this.commandHandlers.size,
-          queryHandlers: this.queryHandlers.size,
-          redis: false,
-          eventService: false,
-        },
+        details: {},
       };
     }

[NoCoverage] BooleanLiteral
src/cqrs/CQRSBus.ts:293:18
         details: {
           commandHandlers: this.commandHandlers.size,
           queryHandlers: this.queryHandlers.size,
-          redis: false,
+          redis: true,
           eventService: false,
         },

[NoCoverage] BooleanLiteral
src/cqrs/CQRSBus.ts:294:25
           commandHandlers: this.commandHandlers.size,
           queryHandlers: this.queryHandlers.size,
           redis: false,
-          eventService: false,
+          eventService: true,
         },
       };

[Killed] BlockStatement
src/cqrs/CQRSBus.ts:303:55
   /**
    * Clear all cached queries (useful for cache invalidation)
    */
-  async clearCache(pattern?: string): Promise<number> {
-    if (!this.config.enableQueryCache) {
-      return 0;
-    }
-
-    try {
-      const cachePattern = pattern || "cqrs:query:*";
-      const keys = await this.config.redis.keys(cachePattern);
-
-      if (keys.length === 0) {
-        return 0;
-      }
-
-      const deletedCount = await this.config.redis.del(...keys);
-      logger.info({ deletedCount }, "Cleared cached queries");
-
-      return deletedCount;
-    } catch (error) {
-      logger.error({ err: error }, "Failed to clear cache");
-      return 0;
-    }
-  }
+  async clearCache(pattern?: string): Promise<number> {}
 
   /**
killedBy: CQRSBus - Cache Management should clear all cached queries
statusReason: expected undefined to be 2 // Object.is equality

[Killed] ConditionalExpression
src/cqrs/CQRSBus.ts:304:9
    * Clear all cached queries (useful for cache invalidation)
    */
   async clearCache(pattern?: string): Promise<number> {
-    if (!this.config.enableQueryCache) {
+    if (true) {
       return 0;
     }
killedBy: CQRSBus - Cache Management should clear all cached queries
statusReason: expected +0 to be 2 // Object.is equality

[Killed] BooleanLiteral
src/cqrs/CQRSBus.ts:304:9
    * Clear all cached queries (useful for cache invalidation)
    */
   async clearCache(pattern?: string): Promise<number> {
-    if (!this.config.enableQueryCache) {
+    if (this.config.enableQueryCache) {
       return 0;
     }
killedBy: CQRSBus - Cache Management should clear all cached queries
statusReason: expected +0 to be 2 // Object.is equality

[Killed] BlockStatement
src/cqrs/CQRSBus.ts:308:9
       return 0;
     }
 
-    try {
-      const cachePattern = pattern || "cqrs:query:*";
-      const keys = await this.config.redis.keys(cachePattern);
-
-      if (keys.length === 0) {
-        return 0;
-      }
-
-      const deletedCount = await this.config.redis.del(...keys);
-      logger.info({ deletedCount }, "Cleared cached queries");
-
-      return deletedCount;
-    } catch (error) {
+    try {} catch (error) {
       logger.error({ err: error }, "Failed to clear cache");
       return 0;
killedBy: CQRSBus - Cache Management should clear all cached queries
statusReason: expected undefined to be 2 // Object.is equality

[Killed] LogicalOperator
src/cqrs/CQRSBus.ts:309:28
     }
 
     try {
-      const cachePattern = pattern || "cqrs:query:*";
+      const cachePattern = pattern && "cqrs:query:*";
       const keys = await this.config.redis.keys(cachePattern);
 
killedBy: CQRSBus - Cache Management should clear all cached queries
statusReason: expected +0 to be 2 // Object.is equality

[Killed] ConditionalExpression
src/cqrs/CQRSBus.ts:309:28
     }
 
     try {
-      const cachePattern = pattern || "cqrs:query:*";
+      const cachePattern = true;
       const keys = await this.config.redis.keys(cachePattern);
 
killedBy: CQRSBus - Cache Management should clear all cached queries
statusReason: expected +0 to be 2 // Object.is equality

[Killed] ConditionalExpression
src/cqrs/CQRSBus.ts:312:11
       const cachePattern = pattern || "cqrs:query:*";
       const keys = await this.config.redis.keys(cachePattern);
 
-      if (keys.length === 0) {
+      if (true) {
         return 0;
       }
killedBy: CQRSBus - Cache Management should clear all cached queries
statusReason: expected +0 to be 2 // Object.is equality

[Killed] EqualityOperator
src/cqrs/CQRSBus.ts:312:11
       const cachePattern = pattern || "cqrs:query:*";
       const keys = await this.config.redis.keys(cachePattern);
 
-      if (keys.length === 0) {
+      if (keys.length !== 0) {
         return 0;
       }
killedBy: CQRSBus - Cache Management should clear all cached queries
statusReason: expected +0 to be 2 // Object.is equality

[NoCoverage] BlockStatement
src/cqrs/CQRSBus.ts:320:21
       logger.info({ deletedCount }, "Cleared cached queries");
 
       return deletedCount;
-    } catch (error) {
-      logger.error({ err: error }, "Failed to clear cache");
-      return 0;
-    }
+    } catch (error) {}
   }
 

[NoCoverage] ObjectLiteral
src/cqrs/CQRSBus.ts:321:20
 
       return deletedCount;
     } catch (error) {
-      logger.error({ err: error }, "Failed to clear cache");
+      logger.error({}, "Failed to clear cache");
       return 0;
     }

[Killed] BlockStatement
src/cqrs/CQRSBus.ts:329:35
   /**
    * Graceful shutdown
    */
-  async shutdown(): Promise<void> {
-    logger.info("Shutting down CQRS Bus");
-
-    this.commandHandlers.clear();
-    this.queryHandlers.clear();
-
-    logger.info("CQRS Bus shutdown complete");
-  }
+  async shutdown(): Promise<void> {}
 
   // Private methods
killedBy: CQRSIntegration - Shutdown should clear handlers on shutdown
statusReason: expected 4 to be +0 // Object.is equality

[Killed] BlockStatement
src/cqrs/CQRSBus.ts:340:86
 
   // Private methods
 
-  private async getCachedResult<T>(cacheKey: string): Promise<QueryResult<T> | null> {
-    try {
-      const cached = await this.config.redis.get(`cqrs:query:${cacheKey}`);
-      return cached ? JSON.parse(cached) : null;
-    } catch (error) {
-      logger.warn({ err: error }, "Failed to get cached result");
-      return null;
-    }
-  }
+  private async getCachedResult<T>(cacheKey: string): Promise<QueryResult<T> | null> {}
 
   private async cacheResult<T>(
killedBy: CQRSIntegration - Query Caching should cache query results
statusReason: expected false to be truthy

[Killed] BlockStatement
src/cqrs/CQRSBus.ts:341:9
   // Private methods
 
   private async getCachedResult<T>(cacheKey: string): Promise<QueryResult<T> | null> {
-    try {
-      const cached = await this.config.redis.get(`cqrs:query:${cacheKey}`);
-      return cached ? JSON.parse(cached) : null;
-    } catch (error) {
+    try {} catch (error) {
       logger.warn({ err: error }, "Failed to get cached result");
       return null;
killedBy: CQRSIntegration - Query Caching should cache query results
statusReason: expected false to be truthy

[NoCoverage] BlockStatement
src/cqrs/CQRSBus.ts:344:21
     try {
       const cached = await this.config.redis.get(`cqrs:query:${cacheKey}`);
       return cached ? JSON.parse(cached) : null;
-    } catch (error) {
-      logger.warn({ err: error }, "Failed to get cached result");
-      return null;
-    }
+    } catch (error) {}
   }
 

[Killed] BlockStatement
src/cqrs/CQRSBus.ts:354:20
     cacheKey: string,
     result: QueryResult<T>,
     ttl?: number
-  ): Promise<void> {
-    try {
-      const cacheTtl = ttl || this.config.defaultCacheTtl || 300; // 5 minutes default
-      const cacheData = JSON.stringify(result);
-
-      await this.config.redis.setex(`cqrs:query:${cacheKey}`, cacheTtl, cacheData);
-    } catch (error) {
-      logger.warn({ err: error }, "Failed to cache result");
-    }
-  }
+  ): Promise<void> {}
 
   private updateCommandMetrics(startTime: number, success: boolean): void {
killedBy: CQRSIntegration - Query Caching should cache query results
statusReason: expected false to be truthy

[Killed] BlockStatement
src/cqrs/CQRSBus.ts:355:9
     result: QueryResult<T>,
     ttl?: number
   ): Promise<void> {
-    try {
-      const cacheTtl = ttl || this.config.defaultCacheTtl || 300; // 5 minutes default
-      const cacheData = JSON.stringify(result);
-
-      await this.config.redis.setex(`cqrs:query:${cacheKey}`, cacheTtl, cacheData);
-    } catch (error) {
+    try {} catch (error) {
       logger.warn({ err: error }, "Failed to cache result");
     }
killedBy: CQRSIntegration - Query Caching should cache query results
statusReason: expected false to be truthy

[Survived] ConditionalExpression
src/cqrs/CQRSBus.ts:356:24
     ttl?: number
   ): Promise<void> {
     try {
-      const cacheTtl = ttl || this.config.defaultCacheTtl || 300; // 5 minutes default
+      const cacheTtl = false; // 5 minutes default
       const cacheData = JSON.stringify(result);
 

[Survived] ConditionalExpression
src/cqrs/CQRSBus.ts:356:24
     ttl?: number
   ): Promise<void> {
     try {
-      const cacheTtl = ttl || this.config.defaultCacheTtl || 300; // 5 minutes default
+      const cacheTtl = false || 300; // 5 minutes default
       const cacheData = JSON.stringify(result);
 

[NoCoverage] BlockStatement
src/cqrs/CQRSBus.ts:360:21
       const cacheData = JSON.stringify(result);
 
       await this.config.redis.setex(`cqrs:query:${cacheKey}`, cacheTtl, cacheData);
-    } catch (error) {
-      logger.warn({ err: error }, "Failed to cache result");
-    }
+    } catch (error) {}
   }
 

[Killed] BlockStatement
src/cqrs/CQRSBus.ts:365:75
     }
   }
 
-  private updateCommandMetrics(startTime: number, success: boolean): void {
-    if (!this.config.enableMetrics) return;
-
-    const executionTime = Date.now() - startTime;
-    this.executionTimes.commands.push(executionTime);
-
-    if (this.executionTimes.commands.length > 100) {
-      this.executionTimes.commands.shift();
-    }
-
-    this.metrics.commandsExecuted++;
-    if (!success) {
-      this.metrics.commandErrors++;
-    }
-
-    this.metrics.avgCommandExecutionTime =
-      this.executionTimes.commands.reduce((a, b) => a + b, 0) / this.executionTimes.commands.length;
-  }
+  private updateCommandMetrics(startTime: number, success: boolean): void {}
 
   private updateQueryMetrics(startTime: number, success: boolean): void {
killedBy: CQRSBus - Command Execution should update command metrics after execution
statusReason: expected +0 to be 1 // Object.is equality

[Killed] BooleanLiteral
src/cqrs/CQRSBus.ts:366:9
   }
 
   private updateCommandMetrics(startTime: number, success: boolean): void {
-    if (!this.config.enableMetrics) return;
+    if (this.config.enableMetrics) return;
 
     const executionTime = Date.now() - startTime;
killedBy: CQRSBus - Command Execution should update command metrics after execution
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/cqrs/CQRSBus.ts:366:9
   }
 
   private updateCommandMetrics(startTime: number, success: boolean): void {
-    if (!this.config.enableMetrics) return;
+    if (true) return;
 
     const executionTime = Date.now() - startTime;
killedBy: CQRSBus - Command Execution should update command metrics after execution
statusReason: expected +0 to be 1 // Object.is equality

[Survived] ArithmeticOperator
src/cqrs/CQRSBus.ts:368:27
   private updateCommandMetrics(startTime: number, success: boolean): void {
     if (!this.config.enableMetrics) return;
 
-    const executionTime = Date.now() - startTime;
+    const executionTime = Date.now() + startTime;
     this.executionTimes.commands.push(executionTime);
 

[Killed] ConditionalExpression
src/cqrs/CQRSBus.ts:371:9
     const executionTime = Date.now() - startTime;
     this.executionTimes.commands.push(executionTime);
 
-    if (this.executionTimes.commands.length > 100) {
+    if (true) {
       this.executionTimes.commands.shift();
     }
killedBy: CQRSBus - Metrics and Monitoring should calculate average execution times
statusReason: expected false to be truthy

[Killed] EqualityOperator
src/cqrs/CQRSBus.ts:371:9
     const executionTime = Date.now() - startTime;
     this.executionTimes.commands.push(executionTime);
 
-    if (this.executionTimes.commands.length > 100) {
+    if (this.executionTimes.commands.length <= 100) {
       this.executionTimes.commands.shift();
     }
killedBy: CQRSBus - Metrics and Monitoring should calculate average execution times
statusReason: expected false to be truthy

[Killed] UpdateOperator
src/cqrs/CQRSBus.ts:375:5
       this.executionTimes.commands.shift();
     }
 
-    this.metrics.commandsExecuted++;
+    this.metrics.commandsExecuted--;
     if (!success) {
       this.metrics.commandErrors++;
killedBy: CQRSBus - Command Execution should update command metrics after execution
statusReason: expected -1 to be 1 // Object.is equality

[Killed] BooleanLiteral
src/cqrs/CQRSBus.ts:376:9
     }
 
     this.metrics.commandsExecuted++;
-    if (!success) {
+    if (success) {
       this.metrics.commandErrors++;
     }
killedBy: CQRSBus - Command Execution should update command metrics after execution
statusReason: expected 1 to be +0 // Object.is equality

[Killed] ConditionalExpression
src/cqrs/CQRSBus.ts:376:9
     }
 
     this.metrics.commandsExecuted++;
-    if (!success) {
+    if (false) {
       this.metrics.commandErrors++;
     }
killedBy: CQRSBus - Command Execution should track command errors in metrics
statusReason: expected +0 to be 1 // Object.is equality

[Killed] UpdateOperator
src/cqrs/CQRSBus.ts:377:7
 
     this.metrics.commandsExecuted++;
     if (!success) {
-      this.metrics.commandErrors++;
+      this.metrics.commandErrors--;
     }
 
killedBy: CQRSBus - Command Execution should track command errors in metrics
statusReason: expected -1 to be 1 // Object.is equality

[Killed] ArrowFunction
src/cqrs/CQRSBus.ts:381:43
     }
 
     this.metrics.avgCommandExecutionTime =
-      this.executionTimes.commands.reduce((a, b) => a + b, 0) / this.executionTimes.commands.length;
+      this.executionTimes.commands.reduce(() => undefined, 0) / this.executionTimes.commands.length;
   }
 
killedBy: CQRSBus - Metrics and Monitoring should calculate average execution times
statusReason: expected false to be truthy

[Survived] ArithmeticOperator
src/cqrs/CQRSBus.ts:381:53
     }
 
     this.metrics.avgCommandExecutionTime =
-      this.executionTimes.commands.reduce((a, b) => a + b, 0) / this.executionTimes.commands.length;
+      this.executionTimes.commands.reduce((a, b) => a - b, 0) / this.executionTimes.commands.length;
   }
 

[Killed] BlockStatement
src/cqrs/CQRSBus.ts:384:73
       this.executionTimes.commands.reduce((a, b) => a + b, 0) / this.executionTimes.commands.length;
   }
 
-  private updateQueryMetrics(startTime: number, success: boolean): void {
-    if (!this.config.enableMetrics) return;
-
-    const executionTime = Date.now() - startTime;
-    this.executionTimes.queries.push(executionTime);
-
-    if (this.executionTimes.queries.length > 100) {
-      this.executionTimes.queries.shift();
-    }
-
-    this.metrics.queriesExecuted++;
-    if (!success) {
-      this.metrics.queryErrors++;
-    }
-
-    this.metrics.avgQueryExecutionTime =
-      this.executionTimes.queries.reduce((a, b) => a + b, 0) / this.executionTimes.queries.length;
-  }
+  private updateQueryMetrics(startTime: number, success: boolean): void {}
 }
 
killedBy: CQRSBus - Query Execution and Caching should update query metrics after execution
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/cqrs/CQRSBus.ts:385:9
   }
 
   private updateQueryMetrics(startTime: number, success: boolean): void {
-    if (!this.config.enableMetrics) return;
+    if (true) return;
 
     const executionTime = Date.now() - startTime;
killedBy: CQRSBus - Query Execution and Caching should update query metrics after execution
statusReason: expected +0 to be 1 // Object.is equality

[Killed] BooleanLiteral
src/cqrs/CQRSBus.ts:385:9
   }
 
   private updateQueryMetrics(startTime: number, success: boolean): void {
-    if (!this.config.enableMetrics) return;
+    if (this.config.enableMetrics) return;
 
     const executionTime = Date.now() - startTime;
killedBy: CQRSBus - Query Execution and Caching should update query metrics after execution
statusReason: expected +0 to be 1 // Object.is equality

[Survived] ConditionalExpression
src/cqrs/CQRSBus.ts:390:9
     const executionTime = Date.now() - startTime;
     this.executionTimes.queries.push(executionTime);
 
-    if (this.executionTimes.queries.length > 100) {
+    if (true) {
       this.executionTimes.queries.shift();
     }

[Survived] EqualityOperator
src/cqrs/CQRSBus.ts:390:9
     const executionTime = Date.now() - startTime;
     this.executionTimes.queries.push(executionTime);
 
-    if (this.executionTimes.queries.length > 100) {
+    if (this.executionTimes.queries.length <= 100) {
       this.executionTimes.queries.shift();
     }

[Killed] UpdateOperator
src/cqrs/CQRSBus.ts:394:5
       this.executionTimes.queries.shift();
     }
 
-    this.metrics.queriesExecuted++;
+    this.metrics.queriesExecuted--;
     if (!success) {
       this.metrics.queryErrors++;
killedBy: CQRSBus - Query Execution and Caching should update query metrics after execution
statusReason: expected -1 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/cqrs/CQRSBus.ts:395:9
     }
 
     this.metrics.queriesExecuted++;
-    if (!success) {
+    if (true) {
       this.metrics.queryErrors++;
     }
killedBy: CQRSBus - Query Execution and Caching should update query metrics after execution
statusReason: expected 1 to be +0 // Object.is equality

[Killed] BooleanLiteral
src/cqrs/CQRSBus.ts:395:9
     }
 
     this.metrics.queriesExecuted++;
-    if (!success) {
+    if (success) {
       this.metrics.queryErrors++;
     }
killedBy: CQRSBus - Query Execution and Caching should update query metrics after execution
statusReason: expected 1 to be +0 // Object.is equality

[Survived] UpdateOperator
src/cqrs/CQRSBus.ts:396:7
 
     this.metrics.queriesExecuted++;
     if (!success) {
-      this.metrics.queryErrors++;
+      this.metrics.queryErrors--;
     }
 

[Survived] ArithmeticOperator
src/cqrs/CQRSBus.ts:400:7
     }
 
     this.metrics.avgQueryExecutionTime =
-      this.executionTimes.queries.reduce((a, b) => a + b, 0) / this.executionTimes.queries.length;
+      this.executionTimes.queries.reduce((a, b) => a + b, 0) * this.executionTimes.queries.length;
   }
 }

[Survived] ArithmeticOperator
src/cqrs/CQRSBus.ts:400:52
     }
 
     this.metrics.avgQueryExecutionTime =
-      this.executionTimes.queries.reduce((a, b) => a + b, 0) / this.executionTimes.queries.length;
+      this.executionTimes.queries.reduce((a, b) => a - b, 0) / this.executionTimes.queries.length;
   }
 }

[NoCoverage] BlockStatement
src/cqrs/CQRSBus.ts:405:71
 }
 
 // Middleware for automatic cache key generation
-export function withCacheKey(query: Query, customKey?: string): Query {
-  if (!query.metadata.cacheKey) {
-    query.metadata.cacheKey = customKey || generateCacheKey(query);
-  }
-  return query;
-}
+export function withCacheKey(query: Query, customKey?: string): Query {}
 
 // Cache invalidation helper

[NoCoverage] BlockStatement
src/cqrs/CQRSBus.ts:406:33
 
 // Middleware for automatic cache key generation
 export function withCacheKey(query: Query, customKey?: string): Query {
-  if (!query.metadata.cacheKey) {
-    query.metadata.cacheKey = customKey || generateCacheKey(query);
-  }
+  if (!query.metadata.cacheKey) {}
   return query;
 }

[NoCoverage] ConditionalExpression
src/cqrs/CQRSBus.ts:406:7
 
 // Middleware for automatic cache key generation
 export function withCacheKey(query: Query, customKey?: string): Query {
-  if (!query.metadata.cacheKey) {
+  if (true) {
     query.metadata.cacheKey = customKey || generateCacheKey(query);
   }

[NoCoverage] LogicalOperator
src/cqrs/CQRSBus.ts:407:31
 // Middleware for automatic cache key generation
 export function withCacheKey(query: Query, customKey?: string): Query {
   if (!query.metadata.cacheKey) {
-    query.metadata.cacheKey = customKey || generateCacheKey(query);
+    query.metadata.cacheKey = customKey && generateCacheKey(query);
   }
   return query;

[NoCoverage] ConditionalExpression
src/cqrs/CQRSBus.ts:407:31
 // Middleware for automatic cache key generation
 export function withCacheKey(query: Query, customKey?: string): Query {
   if (!query.metadata.cacheKey) {
-    query.metadata.cacheKey = customKey || generateCacheKey(query);
+    query.metadata.cacheKey = false;
   }
   return query;

[Killed] BlockStatement
src/cqrs/CQRSBus.ts:413:93
 }
 
 // Cache invalidation helper
-export async function invalidateQueryCache(redis: Redis, patterns: string[]): Promise<void> {
-  for (const pattern of patterns) {
-    try {
-      const keys = await redis.keys(`cqrs:query:*${pattern}*`);
-      if (keys.length > 0) {
-        await redis.del(...keys);
-        logger.info({ count: keys.length, pattern }, "Invalidated cached queries");
-      }
-    } catch (error) {
-      logger.warn({ err: error, pattern }, "Failed to invalidate cache for pattern");
-    }
-  }
-}
+export async function invalidateQueryCache(redis: Redis, patterns: string[]): Promise<void> {}
 
killedBy: PublishPostCommandHandler should invalidate cache on success
statusReason: expected false to be truthy

[Killed] BlockStatement
src/cqrs/CQRSBus.ts:414:35
 
 // Cache invalidation helper
 export async function invalidateQueryCache(redis: Redis, patterns: string[]): Promise<void> {
-  for (const pattern of patterns) {
-    try {
-      const keys = await redis.keys(`cqrs:query:*${pattern}*`);
-      if (keys.length > 0) {
-        await redis.del(...keys);
-        logger.info({ count: keys.length, pattern }, "Invalidated cached queries");
-      }
-    } catch (error) {
-      logger.warn({ err: error, pattern }, "Failed to invalidate cache for pattern");
-    }
-  }
+  for (const pattern of patterns) {}
 }
 
killedBy: PublishPostCommandHandler should invalidate cache on success
statusReason: expected false to be truthy

[Killed] BlockStatement
src/cqrs/CQRSBus.ts:415:9
 // Cache invalidation helper
 export async function invalidateQueryCache(redis: Redis, patterns: string[]): Promise<void> {
   for (const pattern of patterns) {
-    try {
-      const keys = await redis.keys(`cqrs:query:*${pattern}*`);
-      if (keys.length > 0) {
-        await redis.del(...keys);
-        logger.info({ count: keys.length, pattern }, "Invalidated cached queries");
-      }
-    } catch (error) {
+    try {} catch (error) {
       logger.warn({ err: error, pattern }, "Failed to invalidate cache for pattern");
     }
killedBy: PublishPostCommandHandler should invalidate cache on success
statusReason: expected false to be truthy

[Killed] BlockStatement
src/cqrs/CQRSBus.ts:417:28
   for (const pattern of patterns) {
     try {
       const keys = await redis.keys(`cqrs:query:*${pattern}*`);
-      if (keys.length > 0) {
-        await redis.del(...keys);
-        logger.info({ count: keys.length, pattern }, "Invalidated cached queries");
-      }
+      if (keys.length > 0) {}
     } catch (error) {
       logger.warn({ err: error, pattern }, "Failed to invalidate cache for pattern");
killedBy: PublishPostCommandHandler should invalidate cache on success
statusReason: expected false to be truthy

[Killed] EqualityOperator
src/cqrs/CQRSBus.ts:417:11
   for (const pattern of patterns) {
     try {
       const keys = await redis.keys(`cqrs:query:*${pattern}*`);
-      if (keys.length > 0) {
+      if (keys.length <= 0) {
         await redis.del(...keys);
         logger.info({ count: keys.length, pattern }, "Invalidated cached queries");
killedBy: PublishPostCommandHandler should invalidate cache on success
statusReason: expected false to be truthy

[Survived] ObjectLiteral
src/cqrs/CQRSBus.ts:419:21
       const keys = await redis.keys(`cqrs:query:*${pattern}*`);
       if (keys.length > 0) {
         await redis.del(...keys);
-        logger.info({ count: keys.length, pattern }, "Invalidated cached queries");
+        logger.info({}, "Invalidated cached queries");
       }
     } catch (error) {

[NoCoverage] BlockStatement
src/cqrs/CQRSBus.ts:421:21
         await redis.del(...keys);
         logger.info({ count: keys.length, pattern }, "Invalidated cached queries");
       }
-    } catch (error) {
-      logger.warn({ err: error, pattern }, "Failed to invalidate cache for pattern");
-    }
+    } catch (error) {}
   }
 }

[NoCoverage] ObjectLiteral
src/cqrs/CQRSBus.ts:422:19
         logger.info({ count: keys.length, pattern }, "Invalidated cached queries");
       }
     } catch (error) {
-      logger.warn({ err: error, pattern }, "Failed to invalidate cache for pattern");
+      logger.warn({}, "Failed to invalidate cache for pattern");
     }
   }
