[Killed] BlockStatement
src/cqrs/handlers/PostCommandHandlers.ts:72:27
 async function validateChannels(
   channelIds: string[],
   channelRepository: ChannelRepository
-): Promise<string | null> {
-  for (const rawId of channelIds) {
-    const channelIdResult = ChannelId.fromString(rawId);
-    if (!channelIdResult.ok) {
-      return `Invalid channel ID format: ${rawId}`;
-    }
-
-    const findResult = await channelRepository.findById(channelIdResult.value);
-    if (!findResult.ok) {
-      return `Channel not found: ${rawId}`;
-    }
-  }
-  return null;
-}
+): Promise<string | null> {}
 
 // ---------------------------------------------------------------------------
killedBy: CQRSIntegration - Event Publishing should not publish events if command fails
statusReason: expected 2 to be +0 // Object.is equality

[Killed] BlockStatement
src/cqrs/handlers/PostCommandHandlers.ts:73:35
   channelIds: string[],
   channelRepository: ChannelRepository
 ): Promise<string | null> {
-  for (const rawId of channelIds) {
-    const channelIdResult = ChannelId.fromString(rawId);
-    if (!channelIdResult.ok) {
-      return `Invalid channel ID format: ${rawId}`;
-    }
-
-    const findResult = await channelRepository.findById(channelIdResult.value);
-    if (!findResult.ok) {
-      return `Channel not found: ${rawId}`;
-    }
-  }
+  for (const rawId of channelIds) {}
   return null;
 }
killedBy: CQRSIntegration - Event Publishing should not publish events if command fails
statusReason: expected 2 to be +0 // Object.is equality

[Killed] ConditionalExpression
src/cqrs/handlers/PostCommandHandlers.ts:75:9
 ): Promise<string | null> {
   for (const rawId of channelIds) {
     const channelIdResult = ChannelId.fromString(rawId);
-    if (!channelIdResult.ok) {
+    if (false) {
       return `Invalid channel ID format: ${rawId}`;
     }
killedBy: PublishPostCommandHandler should return error for invalid channel ID format
statusReason: expected false to be truthy

[Killed] ConditionalExpression
src/cqrs/handlers/PostCommandHandlers.ts:75:9
 ): Promise<string | null> {
   for (const rawId of channelIds) {
     const channelIdResult = ChannelId.fromString(rawId);
-    if (!channelIdResult.ok) {
+    if (true) {
       return `Invalid channel ID format: ${rawId}`;
     }
killedBy: CQRSIntegration - Command Routes should handle POST /api/cqrs/posts/create successfully
statusReason: expected 400 to be 200 // Object.is equality

[Killed] BooleanLiteral
src/cqrs/handlers/PostCommandHandlers.ts:80:9
     }
 
     const findResult = await channelRepository.findById(channelIdResult.value);
-    if (!findResult.ok) {
+    if (findResult.ok) {
       return `Channel not found: ${rawId}`;
     }
killedBy: CQRSIntegration - Command Routes should handle POST /api/cqrs/posts/create successfully
statusReason: expected 400 to be 200 // Object.is equality

[Killed] ConditionalExpression
src/cqrs/handlers/PostCommandHandlers.ts:80:9
     }
 
     const findResult = await channelRepository.findById(channelIdResult.value);
-    if (!findResult.ok) {
+    if (false) {
       return `Channel not found: ${rawId}`;
     }
killedBy: PublishPostCommandHandler should return error for invalid channel IDs
statusReason: expected true to be false // Object.is equality

[Killed] StringLiteral
src/cqrs/handlers/PostCommandHandlers.ts:81:14
 
     const findResult = await channelRepository.findById(channelIdResult.value);
     if (!findResult.ok) {
-      return `Channel not found: ${rawId}`;
+      return ``;
     }
   }
killedBy: CQRSIntegration - Event Publishing should not publish events if command fails
statusReason: expected 2 to be +0 // Object.is equality

[Killed] BooleanLiteral
src/cqrs/handlers/PostCommandHandlers.ts:104:11
     try {
       // 1. Validate CQRS command schema
       const validation = validateCommand(command, CreatePostCommandSchema);
-      if (!validation.success) {
+      if (validation.success) {
         return {
           success: false,
killedBy: CQRSIntegration - Command Routes should handle POST /api/cqrs/posts/create successfully
statusReason: expected 400 to be 200 // Object.is equality

[Killed] ConditionalExpression
src/cqrs/handlers/PostCommandHandlers.ts:104:11
     try {
       // 1. Validate CQRS command schema
       const validation = validateCommand(command, CreatePostCommandSchema);
-      if (!validation.success) {
+      if (true) {
         return {
           success: false,
killedBy: CQRSIntegration - Error Handling should handle validation errors in create command
statusReason: expected undefined to be truthy

[Survived] ConditionalExpression
src/cqrs/handlers/PostCommandHandlers.ts:107:15
       if (!validation.success) {
         return {
           success: false,
-          ...(validation.error && { error: validation.error }),
+          ...(true),
           ...(validation.validationErrors && { validationErrors: validation.validationErrors }),
         };

[Survived] ConditionalExpression
src/cqrs/handlers/PostCommandHandlers.ts:107:15
       if (!validation.success) {
         return {
           success: false,
-          ...(validation.error && { error: validation.error }),
+          ...(false),
           ...(validation.validationErrors && { validationErrors: validation.validationErrors }),
         };

[Survived] ConditionalExpression
src/cqrs/handlers/PostCommandHandlers.ts:108:15
         return {
           success: false,
           ...(validation.error && { error: validation.error }),
-          ...(validation.validationErrors && { validationErrors: validation.validationErrors }),
+          ...(true),
         };
       }

[Survived] ConditionalExpression
src/cqrs/handlers/PostCommandHandlers.ts:108:15
         return {
           success: false,
           ...(validation.error && { error: validation.error }),
-          ...(validation.validationErrors && { validationErrors: validation.validationErrors }),
+          ...(false),
         };
       }

[Killed] BlockStatement
src/cqrs/handlers/PostCommandHandlers.ts:116:39
       const { data, metadata } = validatedCommand;
 
       // 2. Validate channels (cross-aggregate concern)
-      if (data.channelIds.length > 0) {
-        const channelError = await validateChannels(data.channelIds, this.config.channelRepository);
-        if (channelError) {
-          return { success: false, error: channelError };
-        }
-      }
+      if (data.channelIds.length > 0) {}
 
       // 3. Delegate to use case
killedBy: CQRSIntegration - Event Publishing should not publish events if command fails
statusReason: expected 2 to be +0 // Object.is equality

[Killed] ConditionalExpression
src/cqrs/handlers/PostCommandHandlers.ts:116:11
       const { data, metadata } = validatedCommand;
 
       // 2. Validate channels (cross-aggregate concern)
-      if (data.channelIds.length > 0) {
+      if (false) {
         const channelError = await validateChannels(data.channelIds, this.config.channelRepository);
         if (channelError) {
killedBy: CQRSIntegration - Event Publishing should not publish events if command fails
statusReason: expected 2 to be +0 // Object.is equality

[Killed] ConditionalExpression
src/cqrs/handlers/PostCommandHandlers.ts:118:13
       // 2. Validate channels (cross-aggregate concern)
       if (data.channelIds.length > 0) {
         const channelError = await validateChannels(data.channelIds, this.config.channelRepository);
-        if (channelError) {
+        if (false) {
           return { success: false, error: channelError };
         }
killedBy: CQRSIntegration - Event Publishing should not publish events if command fails
statusReason: expected 2 to be +0 // Object.is equality

[Killed] BlockStatement
src/cqrs/handlers/PostCommandHandlers.ts:118:27
       // 2. Validate channels (cross-aggregate concern)
       if (data.channelIds.length > 0) {
         const channelError = await validateChannels(data.channelIds, this.config.channelRepository);
-        if (channelError) {
-          return { success: false, error: channelError };
-        }
+        if (channelError) {}
       }
 
killedBy: CQRSIntegration - Event Publishing should not publish events if command fails
statusReason: expected 2 to be +0 // Object.is equality

[Killed] BooleanLiteral
src/cqrs/handlers/PostCommandHandlers.ts:119:29
       if (data.channelIds.length > 0) {
         const channelError = await validateChannels(data.channelIds, this.config.channelRepository);
         if (channelError) {
-          return { success: false, error: channelError };
+          return { success: true, error: channelError };
         }
       }
killedBy: CreatePostCommandHandler should return error for invalid channel ID format
statusReason: expected true to be false // Object.is equality

[Killed] ObjectLiteral
src/cqrs/handlers/PostCommandHandlers.ts:124:66
       }
 
       // 3. Delegate to use case
-      const result = await this.config.createPostUseCase.execute({
-        projectId: data.projectId,
-        body: data.body,
-        ...(data.title && { title: data.title }),
-        ...(data.tags && { tags: data.tags }),
-        ...(data.locale && {
-          locale: data.locale as import("../../domain/value-objects/Content.js").ContentLocale,
-        }),
-        ...(data.scheduledAt && { scheduledAt: data.scheduledAt }),
-      });
+      const result = await this.config.createPostUseCase.execute({});
 
       if (!result.ok) {
killedBy: CreatePostCommandHandler should delegate to createPostUseCase.execute with correct input
statusReason: expected undefined to be 'My post body' // Object.is equality

[Killed] ConditionalExpression
src/cqrs/handlers/PostCommandHandlers.ts:127:13
       const result = await this.config.createPostUseCase.execute({
         projectId: data.projectId,
         body: data.body,
-        ...(data.title && { title: data.title }),
+        ...(false),
         ...(data.tags && { tags: data.tags }),
         ...(data.locale && {
killedBy: CreatePostCommandHandler should delegate to createPostUseCase.execute with correct input
statusReason: expected undefined to be 'My Title' // Object.is equality

[Killed] ConditionalExpression
src/cqrs/handlers/PostCommandHandlers.ts:127:13
       const result = await this.config.createPostUseCase.execute({
         projectId: data.projectId,
         body: data.body,
-        ...(data.title && { title: data.title }),
+        ...(true),
         ...(data.tags && { tags: data.tags }),
         ...(data.locale && {
killedBy: CreatePostCommandHandler should delegate to createPostUseCase.execute with correct input
statusReason: expected undefined to be 'My Title' // Object.is equality

[Killed] LogicalOperator
src/cqrs/handlers/PostCommandHandlers.ts:128:13
         projectId: data.projectId,
         body: data.body,
         ...(data.title && { title: data.title }),
-        ...(data.tags && { tags: data.tags }),
+        ...(data.tags || {
+  tags: data.tags
+}),
         ...(data.locale && {
           locale: data.locale as import("../../domain/value-objects/Content.js").ContentLocale,
killedBy: CreatePostCommandHandler should delegate to createPostUseCase.execute with correct input
statusReason: expected undefined to strictly equal [ 'tag1', 'tag2' ]

[Killed] ConditionalExpression
src/cqrs/handlers/PostCommandHandlers.ts:128:13
         projectId: data.projectId,
         body: data.body,
         ...(data.title && { title: data.title }),
-        ...(data.tags && { tags: data.tags }),
+        ...(false),
         ...(data.locale && {
           locale: data.locale as import("../../domain/value-objects/Content.js").ContentLocale,
killedBy: CreatePostCommandHandler should delegate to createPostUseCase.execute with correct input
statusReason: expected undefined to strictly equal [ 'tag1', 'tag2' ]

[Survived] ConditionalExpression
src/cqrs/handlers/PostCommandHandlers.ts:129:13
         body: data.body,
         ...(data.title && { title: data.title }),
         ...(data.tags && { tags: data.tags }),
-        ...(data.locale && {
-          locale: data.locale as import("../../domain/value-objects/Content.js").ContentLocale,
-        }),
+        ...(true),
         ...(data.scheduledAt && { scheduledAt: data.scheduledAt }),
       });

[Survived] ConditionalExpression
src/cqrs/handlers/PostCommandHandlers.ts:129:13
         body: data.body,
         ...(data.title && { title: data.title }),
         ...(data.tags && { tags: data.tags }),
-        ...(data.locale && {
-          locale: data.locale as import("../../domain/value-objects/Content.js").ContentLocale,
-        }),
+        ...(false),
         ...(data.scheduledAt && { scheduledAt: data.scheduledAt }),
       });

[Survived] ConditionalExpression
src/cqrs/handlers/PostCommandHandlers.ts:132:13
         ...(data.locale && {
           locale: data.locale as import("../../domain/value-objects/Content.js").ContentLocale,
         }),
-        ...(data.scheduledAt && { scheduledAt: data.scheduledAt }),
+        ...(true),
       });
 

[Survived] LogicalOperator
src/cqrs/handlers/PostCommandHandlers.ts:132:13
         ...(data.locale && {
           locale: data.locale as import("../../domain/value-objects/Content.js").ContentLocale,
         }),
-        ...(data.scheduledAt && { scheduledAt: data.scheduledAt }),
+        ...(data.scheduledAt || {
+  scheduledAt: data.scheduledAt
+}),
       });
 

[Killed] BlockStatement
src/cqrs/handlers/PostCommandHandlers.ts:135:23
         ...(data.scheduledAt && { scheduledAt: data.scheduledAt }),
       });
 
-      if (!result.ok) {
-        return { success: false, error: result.error.message };
-      }
+      if (!result.ok) {}
 
       const postId = result.value.id;
killedBy: CreatePostCommandHandler should return error when use case fails with validation error
statusReason: expected false to be truthy

[Killed] BooleanLiteral
src/cqrs/handlers/PostCommandHandlers.ts:136:27
       });
 
       if (!result.ok) {
-        return { success: false, error: result.error.message };
+        return { success: true, error: result.error.message };
       }
 
killedBy: CQRSIntegration - Error Handling should handle use case errors gracefully
statusReason: expected false to be truthy

[Survived] ArrayDeclaration
src/cqrs/handlers/PostCommandHandlers.ts:142:22
       const postId = result.value.id;
 
       // 4. Create CQRS integration events
-      const events = [];
+      const events = ["Stryker was here"];
 
       const postCreatedEvent = createPostEvent(

[Killed] OptionalChaining
src/cqrs/handlers/PostCommandHandlers.ts:153:23
           body: data.body,
           locale: data.locale,
           tags: data.tags,
-          mediaCount: data.mediaIds?.length || 0,
+          mediaCount: data.mediaIds.length || 0,
           channelIds: data.channelIds,
           scheduledAt: data.scheduledAt,
killedBy: CQRSIntegration - Command Routes should handle POST /api/cqrs/posts/create successfully
statusReason: expected 400 to be 200 // Object.is equality

[Survived] ConditionalExpression
src/cqrs/handlers/PostCommandHandlers.ts:153:23
           body: data.body,
           locale: data.locale,
           tags: data.tags,
-          mediaCount: data.mediaIds?.length || 0,
+          mediaCount: false,
           channelIds: data.channelIds,
           scheduledAt: data.scheduledAt,

[Survived] ConditionalExpression
src/cqrs/handlers/PostCommandHandlers.ts:159:15
           status: result.value.status,
         },
         {
-          ...(metadata.userId && { userId: metadata.userId }),
+          ...(true),
           source: metadata.source,
         }

[Survived] ConditionalExpression
src/cqrs/handlers/PostCommandHandlers.ts:159:15
           status: result.value.status,
         },
         {
-          ...(metadata.userId && { userId: metadata.userId }),
+          ...(false),
           source: metadata.source,
         }

[Killed] ConditionalExpression
src/cqrs/handlers/PostCommandHandlers.ts:165:11
       );
       events.push(postCreatedEvent);
 
-      if (data.scheduledAt) {
+      if (false) {
         const postScheduledEvent = createPostEvent(
           EVENT_TYPES.POST_SCHEDULED,
killedBy: CreatePostCommandHandler should generate post.scheduled event when scheduledAt is provided
statusReason: expected false to be truthy

[Killed] BlockStatement
src/cqrs/handlers/PostCommandHandlers.ts:165:29
       );
       events.push(postCreatedEvent);
 
-      if (data.scheduledAt) {
-        const postScheduledEvent = createPostEvent(
-          EVENT_TYPES.POST_SCHEDULED,
-          postId,
-          data.projectId,
-          {
-            scheduledAt: data.scheduledAt,
-            channelIds: data.channelIds,
-            estimatedPublishTime: data.scheduledAt,
-          },
-          {
-            source: metadata.source,
-            ...(metadata.userId && { userId: metadata.userId }),
-            ...(metadata.correlationId && { correlationId: metadata.correlationId }),
-          }
-        );
-        events.push(postScheduledEvent);
-      }
+      if (data.scheduledAt) {}
 
       const userActionEvent = createUserActionEvent(
killedBy: CreatePostCommandHandler should generate post.scheduled event when scheduledAt is provided
statusReason: expected false to be truthy

[Survived] ConditionalExpression
src/cqrs/handlers/PostCommandHandlers.ts:177:17
           },
           {
             source: metadata.source,
-            ...(metadata.userId && { userId: metadata.userId }),
+            ...(false),
             ...(metadata.correlationId && { correlationId: metadata.correlationId }),
           }

[Survived] ConditionalExpression
src/cqrs/handlers/PostCommandHandlers.ts:177:17
           },
           {
             source: metadata.source,
-            ...(metadata.userId && { userId: metadata.userId }),
+            ...(true),
             ...(metadata.correlationId && { correlationId: metadata.correlationId }),
           }

[Survived] ConditionalExpression
src/cqrs/handlers/PostCommandHandlers.ts:178:17
           {
             source: metadata.source,
             ...(metadata.userId && { userId: metadata.userId }),
-            ...(metadata.correlationId && { correlationId: metadata.correlationId }),
+            ...(false),
           }
         );

[Survived] ConditionalExpression
src/cqrs/handlers/PostCommandHandlers.ts:178:17
           {
             source: metadata.source,
             ...(metadata.userId && { userId: metadata.userId }),
-            ...(metadata.correlationId && { correlationId: metadata.correlationId }),
+            ...(true),
           }
         );

[Survived] ConditionalExpression
src/cqrs/handlers/PostCommandHandlers.ts:185:9
       }
 
       const userActionEvent = createUserActionEvent(
-        metadata.userId || "system",
+        true,
         "CREATE_POST",
         "Post",

[Survived] LogicalOperator
src/cqrs/handlers/PostCommandHandlers.ts:185:9
       }
 
       const userActionEvent = createUserActionEvent(
-        metadata.userId || "system",
+        metadata.userId && "system",
         "CREATE_POST",
         "Post",

[Survived] StringLiteral
src/cqrs/handlers/PostCommandHandlers.ts:186:9
 
       const userActionEvent = createUserActionEvent(
         metadata.userId || "system",
-        "CREATE_POST",
+        "",
         "Post",
         postId,

[Survived] LogicalOperator
src/cqrs/handlers/PostCommandHandlers.ts:190:19
         "Post",
         postId,
         {
-          source: metadata.source || "API",
+          source: metadata.source && "API",
           ...(metadata.userId && { userId: metadata.userId }),
           ...(metadata.sessionId && { sessionId: metadata.sessionId }),

[Survived] ConditionalExpression
src/cqrs/handlers/PostCommandHandlers.ts:190:19
         "Post",
         postId,
         {
-          source: metadata.source || "API",
+          source: true,
           ...(metadata.userId && { userId: metadata.userId }),
           ...(metadata.sessionId && { sessionId: metadata.sessionId }),

[Survived] LogicalOperator
src/cqrs/handlers/PostCommandHandlers.ts:191:15
         postId,
         {
           source: metadata.source || "API",
-          ...(metadata.userId && { userId: metadata.userId }),
+          ...(metadata.userId || {
+  userId: metadata.userId
+}),
           ...(metadata.sessionId && { sessionId: metadata.sessionId }),
         },

[Survived] ConditionalExpression
src/cqrs/handlers/PostCommandHandlers.ts:191:15
         postId,
         {
           source: metadata.source || "API",
-          ...(metadata.userId && { userId: metadata.userId }),
+          ...(false),
           ...(metadata.sessionId && { sessionId: metadata.sessionId }),
         },

[Survived] ConditionalExpression
src/cqrs/handlers/PostCommandHandlers.ts:192:15
         {
           source: metadata.source || "API",
           ...(metadata.userId && { userId: metadata.userId }),
-          ...(metadata.sessionId && { sessionId: metadata.sessionId }),
+          ...(true),
         },
         {

[Survived] LogicalOperator
src/cqrs/handlers/PostCommandHandlers.ts:192:15
         {
           source: metadata.source || "API",
           ...(metadata.userId && { userId: metadata.userId }),
-          ...(metadata.sessionId && { sessionId: metadata.sessionId }),
+          ...(metadata.sessionId || {
+  sessionId: metadata.sessionId
+}),
         },
         {

[Survived] BooleanLiteral
src/cqrs/handlers/PostCommandHandlers.ts:196:25
         },
         {
           projectId: data.projectId,
-          hasSchedule: !!data.scheduledAt,
+          hasSchedule: !data.scheduledAt,
           channelCount: data.channelIds.length,
           mediaCount: data.mediaIds?.length || 0,

[Killed] OptionalChaining
src/cqrs/handlers/PostCommandHandlers.ts:198:23
           projectId: data.projectId,
           hasSchedule: !!data.scheduledAt,
           channelCount: data.channelIds.length,
-          mediaCount: data.mediaIds?.length || 0,
+          mediaCount: data.mediaIds.length || 0,
         }
       );
killedBy: CQRSIntegration - Command Routes should handle POST /api/cqrs/posts/create successfully
statusReason: expected 400 to be 200 // Object.is equality

[Survived] ConditionalExpression
src/cqrs/handlers/PostCommandHandlers.ts:198:23
           projectId: data.projectId,
           hasSchedule: !!data.scheduledAt,
           channelCount: data.channelIds.length,
-          mediaCount: data.mediaIds?.length || 0,
+          mediaCount: false,
         }
       );

[NoCoverage] BlockStatement
src/cqrs/handlers/PostCommandHandlers.ts:211:21
         data: { postId, version: 1 },
         events,
       };
-    } catch (error) {
-      log.error({ err: error }, "CreatePostCommand failed");
-      return {
-        success: false,
-        error: error instanceof Error ? error.message : "Unknown error occurred",
-      };
-    }
+    } catch (error) {}
   }
 

[NoCoverage] ObjectLiteral
src/cqrs/handlers/PostCommandHandlers.ts:213:14
       };
     } catch (error) {
       log.error({ err: error }, "CreatePostCommand failed");
-      return {
-        success: false,
-        error: error instanceof Error ? error.message : "Unknown error occurred",
-      };
+      return {};
     }
   }

[Killed] BlockStatement
src/cqrs/handlers/PostCommandHandlers.ts:220:68
     }
   }
 
-  private async invalidateCaches(projectId: string): Promise<void> {
-    await invalidateQueryCache(this.config.redis, [
-      `post.list:${projectId}`,
-      `post.search:${projectId}`,
-      "dashboard:stats",
-    ]);
-  }
+  private async invalidateCaches(projectId: string): Promise<void> {}
 }
 
killedBy: CreatePostCommandHandler should invalidate cache on success
statusReason: expected false to be truthy

[Survived] StringLiteral
src/cqrs/handlers/PostCommandHandlers.ts:224:7
     await invalidateQueryCache(this.config.redis, [
       `post.list:${projectId}`,
       `post.search:${projectId}`,
-      "dashboard:stats",
+      "",
     ]);
   }

[Killed] BooleanLiteral
src/cqrs/handlers/PostCommandHandlers.ts:244:11
     try {
       // 1. Validate CQRS command schema
       const validation = validateCommand(command, UpdatePostCommandSchema);
-      if (!validation.success) {
+      if (validation.success) {
         return {
           success: false,
killedBy: CQRSIntegration - Command Routes should handle PUT /api/cqrs/posts/:postId successfully
statusReason: expected 400 to be 200 // Object.is equality

[Killed] ConditionalExpression
src/cqrs/handlers/PostCommandHandlers.ts:244:11
     try {
       // 1. Validate CQRS command schema
       const validation = validateCommand(command, UpdatePostCommandSchema);
-      if (!validation.success) {
+      if (true) {
         return {
           success: false,
killedBy: CQRSIntegration - Command Routes should handle PUT /api/cqrs/posts/:postId successfully
statusReason: expected 400 to be 200 // Object.is equality

[Survived] LogicalOperator
src/cqrs/handlers/PostCommandHandlers.ts:247:15
       if (!validation.success) {
         return {
           success: false,
-          ...(validation.error && { error: validation.error }),
+          ...(validation.error || {
+  error: validation.error
+}),
           ...(validation.validationErrors && { validationErrors: validation.validationErrors }),
         };

[Survived] LogicalOperator
src/cqrs/handlers/PostCommandHandlers.ts:248:15
         return {
           success: false,
           ...(validation.error && { error: validation.error }),
-          ...(validation.validationErrors && { validationErrors: validation.validationErrors }),
+          ...(validation.validationErrors || {
+  validationErrors: validation.validationErrors
+}),
         };
       }

[Survived] ConditionalExpression
src/cqrs/handlers/PostCommandHandlers.ts:256:11
       const { data, metadata, aggregateId } = validatedCommand;
 
       // Warn about unsupported fields
-      if (data.mediaIds) {
+      if (true) {
         log.warn(
           { postId: aggregateId, mediaIds: data.mediaIds },

[NoCoverage] BlockStatement
src/cqrs/handlers/PostCommandHandlers.ts:256:26
       const { data, metadata, aggregateId } = validatedCommand;
 
       // Warn about unsupported fields
-      if (data.mediaIds) {
-        log.warn(
-          { postId: aggregateId, mediaIds: data.mediaIds },
-          "UpdatePostCommand contains mediaIds which are not supported by the use case — ignored"
-        );
-      }
+      if (data.mediaIds) {}
       if (data.status) {
         log.warn(

[NoCoverage] StringLiteral
src/cqrs/handlers/PostCommandHandlers.ts:259:11
       if (data.mediaIds) {
         log.warn(
           { postId: aggregateId, mediaIds: data.mediaIds },
-          "UpdatePostCommand contains mediaIds which are not supported by the use case — ignored"
+          ""
         );
       }

[Survived] ConditionalExpression
src/cqrs/handlers/PostCommandHandlers.ts:262:11
           "UpdatePostCommand contains mediaIds which are not supported by the use case — ignored"
         );
       }
-      if (data.status) {
+      if (false) {
         log.warn(
           { postId: aggregateId, status: data.status },

[NoCoverage] BlockStatement
src/cqrs/handlers/PostCommandHandlers.ts:262:24
           "UpdatePostCommand contains mediaIds which are not supported by the use case — ignored"
         );
       }
-      if (data.status) {
-        log.warn(
-          { postId: aggregateId, status: data.status },
-          "UpdatePostCommand contains status which is not supported by the use case — ignored"
-        );
-      }
+      if (data.status) {}
 
       // 2. Delegate to use case

[NoCoverage] StringLiteral
src/cqrs/handlers/PostCommandHandlers.ts:265:11
       if (data.status) {
         log.warn(
           { postId: aggregateId, status: data.status },
-          "UpdatePostCommand contains status which is not supported by the use case — ignored"
+          ""
         );
       }

[Killed] ConditionalExpression
src/cqrs/handlers/PostCommandHandlers.ts:272:13
       // 2. Delegate to use case
       const result = await this.config.updatePostUseCase.execute({
         postId: aggregateId,
-        ...(data.body && { body: data.body }),
+        ...(true),
         ...(data.title && { title: data.title }),
         ...(data.tags && { tags: data.tags }),
killedBy: UpdatePostCommandHandler should delegate to updatePostUseCase.execute with correct input
statusReason: expected undefined to be 'New body' // Object.is equality

[Killed] LogicalOperator
src/cqrs/handlers/PostCommandHandlers.ts:272:13
       // 2. Delegate to use case
       const result = await this.config.updatePostUseCase.execute({
         postId: aggregateId,
-        ...(data.body && { body: data.body }),
+        ...(data.body || {
+  body: data.body
+}),
         ...(data.title && { title: data.title }),
         ...(data.tags && { tags: data.tags }),
killedBy: UpdatePostCommandHandler should delegate to updatePostUseCase.execute with correct input
statusReason: expected undefined to be 'New body' // Object.is equality

[Killed] ConditionalExpression
src/cqrs/handlers/PostCommandHandlers.ts:273:13
       const result = await this.config.updatePostUseCase.execute({
         postId: aggregateId,
         ...(data.body && { body: data.body }),
-        ...(data.title && { title: data.title }),
+        ...(false),
         ...(data.tags && { tags: data.tags }),
       });
killedBy: UpdatePostCommandHandler should delegate to updatePostUseCase.execute with correct input
statusReason: expected undefined to be 'New Title' // Object.is equality
