[Survived] StringLiteral
src/cqrs/handlers/PostQueryGetList.ts:35:26
 } from "@shared/cqrs";
 import type { PostSortField, SortParams } from "../../domain/index.js";
 
-const log = createLogger("cqrs");
+const log = createLogger("");
 
 interface PostQueryHandlersConfig {

[Killed] BlockStatement
src/cqrs/handlers/PostQueryGetList.ts:47:81
  * The domain model is flat (id, body, status, etc.) while the CQRS
  * model wraps it in an envelope with id, type, version, lastUpdated.
  */
-function mapToCQRSReadModel(domainPost: DomainPostReadModel): CQRSPostReadModel {
-  return {
-    id: `post-readmodel-${domainPost.id}`,
-    type: "PostReadModel",
-    version: 1,
-    lastUpdated: domainPost.updatedAt,
-    data: {
-      id: domainPost.id,
-      projectId: domainPost.projectId,
-      status: domainPost.status as "DRAFT" | "SCHEDULED" | "PUBLISHED" | "FAILED",
-      ...(domainPost.title && { title: domainPost.title }),
-      body: domainPost.body,
-      locale: domainPost.locale,
-      tags: domainPost.tags,
-      mediaUrls: [], // domain read model has mediaCount, not URLs
-      ...(domainPost.scheduledAt && { scheduledAt: domainPost.scheduledAt }),
-      ...(domainPost.publishedAt && { publishedAt: domainPost.publishedAt }),
-      createdAt: domainPost.createdAt,
-      updatedAt: domainPost.updatedAt,
-      channels: [], // channel data comes from separate endpoints
-    },
-  };
-}
+function mapToCQRSReadModel(domainPost: DomainPostReadModel): CQRSPostReadModel {}
 
 /**
killedBy: CQRSIntegration - Query Routes should handle GET /api/cqrs/posts/:postId successfully
statusReason: expected undefined to be truthy

[Killed] StringLiteral
src/cqrs/handlers/PostQueryGetList.ts:50:11
 function mapToCQRSReadModel(domainPost: DomainPostReadModel): CQRSPostReadModel {
   return {
     id: `post-readmodel-${domainPost.id}`,
-    type: "PostReadModel",
+    type: "",
     version: 1,
     lastUpdated: domainPost.updatedAt,
killedBy: GetPostQueryHandler - Basic Functionality should retrieve post successfully
statusReason: expected '' to be 'PostReadModel' // Object.is equality

[Killed] ObjectLiteral
src/cqrs/handlers/PostQueryGetList.ts:53:11
     type: "PostReadModel",
     version: 1,
     lastUpdated: domainPost.updatedAt,
-    data: {
-      id: domainPost.id,
-      projectId: domainPost.projectId,
-      status: domainPost.status as "DRAFT" | "SCHEDULED" | "PUBLISHED" | "FAILED",
-      ...(domainPost.title && { title: domainPost.title }),
-      body: domainPost.body,
-      locale: domainPost.locale,
-      tags: domainPost.tags,
-      mediaUrls: [], // domain read model has mediaCount, not URLs
-      ...(domainPost.scheduledAt && { scheduledAt: domainPost.scheduledAt }),
-      ...(domainPost.publishedAt && { publishedAt: domainPost.publishedAt }),
-      createdAt: domainPost.createdAt,
-      updatedAt: domainPost.updatedAt,
-      channels: [], // channel data comes from separate endpoints
-    },
+    data: {},
   };
 }
killedBy: GetPostQueryHandler - Basic Functionality should include post content in read model
statusReason: expected undefined to be truthy

[Survived] ConditionalExpression
src/cqrs/handlers/PostQueryGetList.ts:57:11
       id: domainPost.id,
       projectId: domainPost.projectId,
       status: domainPost.status as "DRAFT" | "SCHEDULED" | "PUBLISHED" | "FAILED",
-      ...(domainPost.title && { title: domainPost.title }),
+      ...(false),
       body: domainPost.body,
       locale: domainPost.locale,

[Survived] LogicalOperator
src/cqrs/handlers/PostQueryGetList.ts:57:11
       id: domainPost.id,
       projectId: domainPost.projectId,
       status: domainPost.status as "DRAFT" | "SCHEDULED" | "PUBLISHED" | "FAILED",
-      ...(domainPost.title && { title: domainPost.title }),
+      ...(domainPost.title || {
+  title: domainPost.title
+}),
       body: domainPost.body,
       locale: domainPost.locale,

[Survived] ConditionalExpression
src/cqrs/handlers/PostQueryGetList.ts:62:11
       locale: domainPost.locale,
       tags: domainPost.tags,
       mediaUrls: [], // domain read model has mediaCount, not URLs
-      ...(domainPost.scheduledAt && { scheduledAt: domainPost.scheduledAt }),
+      ...(false),
       ...(domainPost.publishedAt && { publishedAt: domainPost.publishedAt }),
       createdAt: domainPost.createdAt,

[Survived] LogicalOperator
src/cqrs/handlers/PostQueryGetList.ts:62:11
       locale: domainPost.locale,
       tags: domainPost.tags,
       mediaUrls: [], // domain read model has mediaCount, not URLs
-      ...(domainPost.scheduledAt && { scheduledAt: domainPost.scheduledAt }),
+      ...(domainPost.scheduledAt || {
+  scheduledAt: domainPost.scheduledAt
+}),
       ...(domainPost.publishedAt && { publishedAt: domainPost.publishedAt }),
       createdAt: domainPost.createdAt,

[Survived] ConditionalExpression
src/cqrs/handlers/PostQueryGetList.ts:63:11
       tags: domainPost.tags,
       mediaUrls: [], // domain read model has mediaCount, not URLs
       ...(domainPost.scheduledAt && { scheduledAt: domainPost.scheduledAt }),
-      ...(domainPost.publishedAt && { publishedAt: domainPost.publishedAt }),
+      ...(true),
       createdAt: domainPost.createdAt,
       updatedAt: domainPost.updatedAt,

[Survived] ConditionalExpression
src/cqrs/handlers/PostQueryGetList.ts:63:11
       tags: domainPost.tags,
       mediaUrls: [], // domain read model has mediaCount, not URLs
       ...(domainPost.scheduledAt && { scheduledAt: domainPost.scheduledAt }),
-      ...(domainPost.publishedAt && { publishedAt: domainPost.publishedAt }),
+      ...(false),
       createdAt: domainPost.createdAt,
       updatedAt: domainPost.updatedAt,

[Killed] ConditionalExpression
src/cqrs/handlers/PostQueryGetList.ts:84:11
   async handle(query: Query<unknown>): Promise<QueryResult<CQRSPostReadModel>> {
     try {
       const validation = validateQuery(query, GetPostQuerySchema);
-      if (!validation.success) {
+      if (true) {
         return {
           success: false,
killedBy: CQRSIntegration - Query Routes should handle GET /api/cqrs/posts/:postId successfully
statusReason: expected 404 to be 200 // Object.is equality

[Killed] BooleanLiteral
src/cqrs/handlers/PostQueryGetList.ts:84:11
   async handle(query: Query<unknown>): Promise<QueryResult<CQRSPostReadModel>> {
     try {
       const validation = validateQuery(query, GetPostQuerySchema);
-      if (!validation.success) {
+      if (validation.success) {
         return {
           success: false,
killedBy: CQRSIntegration - Query Routes should handle GET /api/cqrs/posts/:postId successfully
statusReason: expected 404 to be 200 // Object.is equality

[Killed] ConditionalExpression
src/cqrs/handlers/PostQueryGetList.ts:96:11
 
       // Parse PostId from string (returns Result)
       const postIdResult = PostId.fromString(data.postId);
-      if (!postIdResult.ok) {
+      if (true) {
         return {
           success: false,
killedBy: CQRSIntegration - Query Routes should handle GET /api/cqrs/posts/:postId successfully
statusReason: expected 404 to be 200 // Object.is equality

[Killed] BooleanLiteral
src/cqrs/handlers/PostQueryGetList.ts:96:11
 
       // Parse PostId from string (returns Result)
       const postIdResult = PostId.fromString(data.postId);
-      if (!postIdResult.ok) {
+      if (postIdResult.ok) {
         return {
           success: false,
killedBy: CQRSIntegration - Query Routes should handle GET /api/cqrs/posts/:postId successfully
statusReason: expected 404 to be 200 // Object.is equality

[Killed] BlockStatement
src/cqrs/handlers/PostQueryGetList.ts:105:23
 
       const result = await this.config.postQueryRepository.getById(postIdResult.value);
 
-      if (!result.ok) {
-        return {
-          success: false,
-          error: "Post not found",
-        };
-      }
+      if (!result.ok) {}
 
       const readModel = mapToCQRSReadModel(result.value);
killedBy: GetPostQueryHandler - Basic Functionality should return error when post not found
statusReason: expected false to be truthy

[Killed] BlockStatement
src/cqrs/handlers/PostQueryGetList.ts:118:21
         success: true,
         data: readModel,
       };
-    } catch (error) {
-      log.error({ err: error }, "GetPostQuery failed");
-      return {
-        success: false,
-        error: error instanceof Error ? error.message : "Unknown error occurred",
-      };
-    }
+    } catch (error) {}
   }
 }
killedBy: GetPostQueryHandler - Basic Functionality should handle repository errors gracefully
statusReason: Cannot read properties of undefined (reading 'success')

[Killed] ConditionalExpression
src/cqrs/handlers/PostQueryGetList.ts:142:11
   async handle(query: Query<unknown>): Promise<QueryResult<PostsListReadModel>> {
     try {
       const validation = validateQuery(query, ListPostsQuerySchema);
-      if (!validation.success) {
+      if (true) {
         return {
           success: false,
killedBy: CQRSIntegration - Query Routes should handle GET /api/cqrs/posts with filters
statusReason: expected 400 to be 200 // Object.is equality

[Killed] BooleanLiteral
src/cqrs/handlers/PostQueryGetList.ts:142:11
   async handle(query: Query<unknown>): Promise<QueryResult<PostsListReadModel>> {
     try {
       const validation = validateQuery(query, ListPostsQuerySchema);
-      if (!validation.success) {
+      if (validation.success) {
         return {
           success: false,
killedBy: CQRSIntegration - Query Routes should handle GET /api/cqrs/posts with filters
statusReason: expected 400 to be 200 // Object.is equality

[Killed] BlockStatement
src/cqrs/handlers/PostQueryGetList.ts:154:32
 
       // Parse ProjectId
       const projectIdResult = ProjectId.fromString(data.projectId);
-      if (!projectIdResult.ok) {
-        return {
-          success: false,
-          error: `Invalid project ID: ${data.projectId}`,
-        };
-      }
+      if (!projectIdResult.ok) {}
 
       // Build pagination from query offset/limit
killedBy: ListPostsQueryHandler - Basic Functionality should return error for invalid project UUID
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/cqrs/handlers/PostQueryGetList.ts:154:11
 
       // Parse ProjectId
       const projectIdResult = ProjectId.fromString(data.projectId);
-      if (!projectIdResult.ok) {
+      if (false) {
         return {
           success: false,
killedBy: ListPostsQueryHandler - Basic Functionality should return error for invalid project UUID
statusReason: expected true to be false // Object.is equality

[Killed] ObjectLiteral
src/cqrs/handlers/PostQueryGetList.ts:155:16
       // Parse ProjectId
       const projectIdResult = ProjectId.fromString(data.projectId);
       if (!projectIdResult.ok) {
-        return {
-          success: false,
-          error: `Invalid project ID: ${data.projectId}`,
-        };
+        return {};
       }
 
killedBy: ListPostsQueryHandler - Basic Functionality should return error for invalid project UUID
statusReason: expected undefined to be false // Object.is equality

[Killed] StringLiteral
src/cqrs/handlers/PostQueryGetList.ts:157:18
       if (!projectIdResult.ok) {
         return {
           success: false,
-          error: `Invalid project ID: ${data.projectId}`,
+          error: ``,
         };
       }
killedBy: ListPostsQueryHandler - Basic Functionality should return error for invalid project UUID
statusReason: expected false to be truthy

[Survived] ArithmeticOperator
src/cqrs/handlers/PostQueryGetList.ts:162:20
       }
 
       // Build pagination from query offset/limit
-      const page = Math.floor(data.offset / data.limit) + 1;
+      const page = Math.floor(data.offset / data.limit) - 1;
       const pagination = { page, limit: data.limit };
 

[Survived] ArithmeticOperator
src/cqrs/handlers/PostQueryGetList.ts:162:31
       }
 
       // Build pagination from query offset/limit
-      const page = Math.floor(data.offset / data.limit) + 1;
+      const page = Math.floor(data.offset * data.limit) + 1;
       const pagination = { page, limit: data.limit };
 

[Survived] ObjectLiteral
src/cqrs/handlers/PostQueryGetList.ts:166:47
       const pagination = { page, limit: data.limit };
 
       // Build sort params
-      const sort: SortParams<PostSortField> = {
-        field: data.sortBy as PostSortField,
-        direction: data.sortOrder.toLowerCase() as "asc" | "desc",
-      };
+      const sort: SortParams<PostSortField> = {};
 
       const paginatedResult = await this.config.postQueryRepository.listByProject(

[Survived] StringLiteral
src/cqrs/handlers/PostQueryGetList.ts:178:13
       );
 
       const readModel: PostsListReadModel = {
-        id: `posts-list-${data.projectId}-${Date.now()}`,
+        id: ``,
         type: "PostsListReadModel",
         version: 1,

[Killed] ArrowFunction
src/cqrs/handlers/PostQueryGetList.ts:184:44
         lastUpdated: new Date(),
         data: {
           projectId: data.projectId,
-          posts: paginatedResult.items.map((domainPost) => ({
-            id: domainPost.id,
-            ...(domainPost.title && { title: domainPost.title }),
-            body: domainPost.body,
-            status: domainPost.status as "DRAFT" | "SCHEDULED" | "PUBLISHED" | "FAILED",
-            ...(domainPost.scheduledAt && { scheduledAt: domainPost.scheduledAt }),
-            ...(domainPost.publishedAt && { publishedAt: domainPost.publishedAt }),
-            createdAt: domainPost.createdAt,
-            channelCount: 0, // channel data from separate endpoints
-            publishedChannels: 0,
-            failedChannels: 0,
-            tags: domainPost.tags,
-            hasMedia: domainPost.mediaCount > 0,
-          })),
+          posts: paginatedResult.items.map(() => undefined),
           totalCount: paginatedResult.total,
           filters: {
killedBy: ListPostsQueryHandler - Basic Functionality should include channel counts in results
statusReason: expected undefined to be truthy

[Survived] ConditionalExpression
src/cqrs/handlers/PostQueryGetList.ts:186:17
           projectId: data.projectId,
           posts: paginatedResult.items.map((domainPost) => ({
             id: domainPost.id,
-            ...(domainPost.title && { title: domainPost.title }),
+            ...(true),
             body: domainPost.body,
             status: domainPost.status as "DRAFT" | "SCHEDULED" | "PUBLISHED" | "FAILED",

[Survived] ConditionalExpression
src/cqrs/handlers/PostQueryGetList.ts:186:17
           projectId: data.projectId,
           posts: paginatedResult.items.map((domainPost) => ({
             id: domainPost.id,
-            ...(domainPost.title && { title: domainPost.title }),
+            ...(false),
             body: domainPost.body,
             status: domainPost.status as "DRAFT" | "SCHEDULED" | "PUBLISHED" | "FAILED",

[Survived] LogicalOperator
src/cqrs/handlers/PostQueryGetList.ts:189:17
             ...(domainPost.title && { title: domainPost.title }),
             body: domainPost.body,
             status: domainPost.status as "DRAFT" | "SCHEDULED" | "PUBLISHED" | "FAILED",
-            ...(domainPost.scheduledAt && { scheduledAt: domainPost.scheduledAt }),
+            ...(domainPost.scheduledAt || {
+  scheduledAt: domainPost.scheduledAt
+}),
             ...(domainPost.publishedAt && { publishedAt: domainPost.publishedAt }),
             createdAt: domainPost.createdAt,

[Survived] ConditionalExpression
src/cqrs/handlers/PostQueryGetList.ts:189:17
             ...(domainPost.title && { title: domainPost.title }),
             body: domainPost.body,
             status: domainPost.status as "DRAFT" | "SCHEDULED" | "PUBLISHED" | "FAILED",
-            ...(domainPost.scheduledAt && { scheduledAt: domainPost.scheduledAt }),
+            ...(true),
             ...(domainPost.publishedAt && { publishedAt: domainPost.publishedAt }),
             createdAt: domainPost.createdAt,

[Killed] EqualityOperator
src/cqrs/handlers/PostQueryGetList.ts:196:23
             publishedChannels: 0,
             failedChannels: 0,
             tags: domainPost.tags,
-            hasMedia: domainPost.mediaCount > 0,
+            hasMedia: domainPost.mediaCount >= 0,
           })),
           totalCount: paginatedResult.total,
killedBy: ListPostsQueryHandler - Basic Functionality should include hasMedia based on mediaCount
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/cqrs/handlers/PostQueryGetList.ts:196:23
             publishedChannels: 0,
             failedChannels: 0,
             tags: domainPost.tags,
-            hasMedia: domainPost.mediaCount > 0,
+            hasMedia: true,
           })),
           totalCount: paginatedResult.total,
killedBy: ListPostsQueryHandler - Basic Functionality should include hasMedia based on mediaCount
statusReason: expected true to be false // Object.is equality

[Survived] ObjectLiteral
src/cqrs/handlers/PostQueryGetList.ts:199:20
             hasMedia: domainPost.mediaCount > 0,
           })),
           totalCount: paginatedResult.total,
-          filters: {
-            ...(data.status && { status: data.status }),
-            ...(data.channelId && { channelId: data.channelId }),
-            ...(data.tags && { tags: data.tags }),
-            ...(data.fromDate || data.toDate
-              ? {
-                  dateRange: {
-                    ...(data.fromDate && { from: data.fromDate }),
-                    ...(data.toDate && { to: data.toDate }),
-                  },
-                }
-              : {}),
-          },
+          filters: {},
         },
       };

[Survived] ConditionalExpression
src/cqrs/handlers/PostQueryGetList.ts:200:17
           })),
           totalCount: paginatedResult.total,
           filters: {
-            ...(data.status && { status: data.status }),
+            ...(false),
             ...(data.channelId && { channelId: data.channelId }),
             ...(data.tags && { tags: data.tags }),

[Survived] LogicalOperator
src/cqrs/handlers/PostQueryGetList.ts:200:17
           })),
           totalCount: paginatedResult.total,
           filters: {
-            ...(data.status && { status: data.status }),
+            ...(data.status || {
+  status: data.status
+}),
             ...(data.channelId && { channelId: data.channelId }),
             ...(data.tags && { tags: data.tags }),

[Survived] LogicalOperator
src/cqrs/handlers/PostQueryGetList.ts:201:17
           totalCount: paginatedResult.total,
           filters: {
             ...(data.status && { status: data.status }),
-            ...(data.channelId && { channelId: data.channelId }),
+            ...(data.channelId || {
+  channelId: data.channelId
+}),
             ...(data.tags && { tags: data.tags }),
             ...(data.fromDate || data.toDate

[Survived] ConditionalExpression
src/cqrs/handlers/PostQueryGetList.ts:201:17
           totalCount: paginatedResult.total,
           filters: {
             ...(data.status && { status: data.status }),
-            ...(data.channelId && { channelId: data.channelId }),
+            ...(false),
             ...(data.tags && { tags: data.tags }),
             ...(data.fromDate || data.toDate

[Survived] ConditionalExpression
src/cqrs/handlers/PostQueryGetList.ts:202:17
           filters: {
             ...(data.status && { status: data.status }),
             ...(data.channelId && { channelId: data.channelId }),
-            ...(data.tags && { tags: data.tags }),
+            ...(true),
             ...(data.fromDate || data.toDate
               ? {

[Survived] LogicalOperator
src/cqrs/handlers/PostQueryGetList.ts:202:17
           filters: {
             ...(data.status && { status: data.status }),
             ...(data.channelId && { channelId: data.channelId }),
-            ...(data.tags && { tags: data.tags }),
+            ...(data.tags || {
+  tags: data.tags
+}),
             ...(data.fromDate || data.toDate
               ? {

[Survived] ConditionalExpression
src/cqrs/handlers/PostQueryGetList.ts:203:17
             ...(data.status && { status: data.status }),
             ...(data.channelId && { channelId: data.channelId }),
             ...(data.tags && { tags: data.tags }),
-            ...(data.fromDate || data.toDate
+            ...(false
               ? {
                   dateRange: {

[Survived] ConditionalExpression
src/cqrs/handlers/PostQueryGetList.ts:203:17
             ...(data.status && { status: data.status }),
             ...(data.channelId && { channelId: data.channelId }),
             ...(data.tags && { tags: data.tags }),
-            ...(data.fromDate || data.toDate
+            ...(true
               ? {
                   dateRange: {

[Survived] ObjectLiteral
src/cqrs/handlers/PostQueryGetList.ts:204:17
             ...(data.channelId && { channelId: data.channelId }),
             ...(data.tags && { tags: data.tags }),
             ...(data.fromDate || data.toDate
-              ? {
-                  dateRange: {
-                    ...(data.fromDate && { from: data.fromDate }),
-                    ...(data.toDate && { to: data.toDate }),
-                  },
-                }
+              ? {}
               : {}),
           },

[Survived] ObjectLiteral
src/cqrs/handlers/PostQueryGetList.ts:205:30
             ...(data.tags && { tags: data.tags }),
             ...(data.fromDate || data.toDate
               ? {
-                  dateRange: {
-                    ...(data.fromDate && { from: data.fromDate }),
-                    ...(data.toDate && { to: data.toDate }),
-                  },
+                  dateRange: {},
                 }
               : {}),

[Survived] ConditionalExpression
src/cqrs/handlers/PostQueryGetList.ts:206:25
             ...(data.fromDate || data.toDate
               ? {
                   dateRange: {
-                    ...(data.fromDate && { from: data.fromDate }),
+                    ...(false),
                     ...(data.toDate && { to: data.toDate }),
                   },

[Survived] LogicalOperator
src/cqrs/handlers/PostQueryGetList.ts:206:25
             ...(data.fromDate || data.toDate
               ? {
                   dateRange: {
-                    ...(data.fromDate && { from: data.fromDate }),
+                    ...(data.fromDate || {
+  from: data.fromDate
+}),
                     ...(data.toDate && { to: data.toDate }),
                   },

[Survived] ConditionalExpression
src/cqrs/handlers/PostQueryGetList.ts:207:25
               ? {
                   dateRange: {
                     ...(data.fromDate && { from: data.fromDate }),
-                    ...(data.toDate && { to: data.toDate }),
+                    ...(false),
                   },
                 }

[Survived] ConditionalExpression
src/cqrs/handlers/PostQueryGetList.ts:207:25
               ? {
                   dateRange: {
                     ...(data.fromDate && { from: data.fromDate }),
-                    ...(data.toDate && { to: data.toDate }),
+                    ...(true),
                   },
                 }

[Killed] ObjectLiteral
src/cqrs/handlers/PostQueryGetList.ts:215:14
         },
       };
 
-      return {
-        success: true,
-        data: readModel,
-        metadata: {
-          totalCount: paginatedResult.total,
-          page,
-          limit: data.limit,
-        },
-      };
+      return {};
     } catch (error) {
       log.error({ err: error }, "ListPostsQuery failed");
killedBy: CQRSIntegration - Query Routes should handle GET /api/cqrs/posts with filters
statusReason: expected 400 to be 200 // Object.is equality

[Killed] ObjectLiteral
src/cqrs/handlers/PostQueryGetList.ts:218:19
       return {
         success: true,
         data: readModel,
-        metadata: {
-          totalCount: paginatedResult.total,
-          page,
-          limit: data.limit,
-        },
+        metadata: {},
       };
     } catch (error) {
killedBy: ListPostsQueryHandler - Basic Functionality should include pagination metadata
statusReason: expected false to be truthy

[Killed] BlockStatement
src/cqrs/handlers/PostQueryGetList.ts:224:21
           limit: data.limit,
         },
       };
-    } catch (error) {
-      log.error({ err: error }, "ListPostsQuery failed");
-      return {
-        success: false,
-        error: error instanceof Error ? error.message : "Unknown error occurred",
-      };
-    }
+    } catch (error) {}
   }
 }
killedBy: Query Handlers - Error Handling should handle repository errors gracefully - ListPosts
statusReason: Cannot read properties of undefined (reading 'success')

[Survived] StringLiteral
src/cqrs/handlers/PostQueryGetList.ts:225:33
         },
       };
     } catch (error) {
-      log.error({ err: error }, "ListPostsQuery failed");
+      log.error({ err: error }, "");
       return {
         success: false,
