[Survived] BlockStatement
src/cqrs/handlers/PostQuerySearchAnalytics.ts:40:48
  */
 function mapToListEntry(
   domainPost: DomainPostReadModel
-): PostsListReadModel["data"]["posts"][number] {
-  return {
-    id: domainPost.id,
-    ...(domainPost.title && { title: domainPost.title }),
-    body: domainPost.body,
-    status: domainPost.status as "DRAFT" | "SCHEDULED" | "PUBLISHED" | "FAILED",
-    ...(domainPost.scheduledAt && { scheduledAt: domainPost.scheduledAt }),
-    ...(domainPost.publishedAt && { publishedAt: domainPost.publishedAt }),
-    createdAt: domainPost.createdAt,
-    channelCount: 0, // channel data from separate endpoints
-    publishedChannels: 0,
-    failedChannels: 0,
-    tags: domainPost.tags,
-    hasMedia: domainPost.mediaCount > 0,
-  };
-}
+): PostsListReadModel["data"]["posts"][number] {}
 
 /**

[Survived] ObjectLiteral
src/cqrs/handlers/PostQuerySearchAnalytics.ts:41:10
 function mapToListEntry(
   domainPost: DomainPostReadModel
 ): PostsListReadModel["data"]["posts"][number] {
-  return {
-    id: domainPost.id,
-    ...(domainPost.title && { title: domainPost.title }),
-    body: domainPost.body,
-    status: domainPost.status as "DRAFT" | "SCHEDULED" | "PUBLISHED" | "FAILED",
-    ...(domainPost.scheduledAt && { scheduledAt: domainPost.scheduledAt }),
-    ...(domainPost.publishedAt && { publishedAt: domainPost.publishedAt }),
-    createdAt: domainPost.createdAt,
-    channelCount: 0, // channel data from separate endpoints
-    publishedChannels: 0,
-    failedChannels: 0,
-    tags: domainPost.tags,
-    hasMedia: domainPost.mediaCount > 0,
-  };
+  return {};
 }
 

[Survived] ConditionalExpression
src/cqrs/handlers/PostQuerySearchAnalytics.ts:46:9
     ...(domainPost.title && { title: domainPost.title }),
     body: domainPost.body,
     status: domainPost.status as "DRAFT" | "SCHEDULED" | "PUBLISHED" | "FAILED",
-    ...(domainPost.scheduledAt && { scheduledAt: domainPost.scheduledAt }),
+    ...(false),
     ...(domainPost.publishedAt && { publishedAt: domainPost.publishedAt }),
     createdAt: domainPost.createdAt,

[Survived] LogicalOperator
src/cqrs/handlers/PostQuerySearchAnalytics.ts:47:9
     body: domainPost.body,
     status: domainPost.status as "DRAFT" | "SCHEDULED" | "PUBLISHED" | "FAILED",
     ...(domainPost.scheduledAt && { scheduledAt: domainPost.scheduledAt }),
-    ...(domainPost.publishedAt && { publishedAt: domainPost.publishedAt }),
+    ...(domainPost.publishedAt || {
+  publishedAt: domainPost.publishedAt
+}),
     createdAt: domainPost.createdAt,
     channelCount: 0, // channel data from separate endpoints

[Survived] ConditionalExpression
src/cqrs/handlers/PostQuerySearchAnalytics.ts:53:15
     publishedChannels: 0,
     failedChannels: 0,
     tags: domainPost.tags,
-    hasMedia: domainPost.mediaCount > 0,
+    hasMedia: false,
   };
 }

[Survived] EqualityOperator
src/cqrs/handlers/PostQuerySearchAnalytics.ts:53:15
     publishedChannels: 0,
     failedChannels: 0,
     tags: domainPost.tags,
-    hasMedia: domainPost.mediaCount > 0,
+    hasMedia: domainPost.mediaCount <= 0,
   };
 }

[Killed] ConditionalExpression
src/cqrs/handlers/PostQuerySearchAnalytics.ts:70:11
   async handle(query: Query<unknown>): Promise<QueryResult<PostsListReadModel>> {
     try {
       const validation = validateQuery(query, SearchPostsQuerySchema);
-      if (!validation.success) {
+      if (true) {
         return {
           success: false,
killedBy: Query Handlers - Error Handling should handle repository errors gracefully - SearchPosts
statusReason: expected undefined to be truthy

[Killed] BooleanLiteral
src/cqrs/handlers/PostQuerySearchAnalytics.ts:70:11
   async handle(query: Query<unknown>): Promise<QueryResult<PostsListReadModel>> {
     try {
       const validation = validateQuery(query, SearchPostsQuerySchema);
-      if (!validation.success) {
+      if (validation.success) {
         return {
           success: false,
killedBy: CQRSIntegration - Query Routes should handle GET /api/cqrs/posts/search successfully
statusReason: expected 400 to be 200 // Object.is equality

[Killed] BooleanLiteral
src/cqrs/handlers/PostQuerySearchAnalytics.ts:82:11
 
       // Parse ProjectId
       const projectIdResult = ProjectId.fromString(data.projectId);
-      if (!projectIdResult.ok) {
+      if (projectIdResult.ok) {
         return {
           success: false,
killedBy: CQRSIntegration - Query Routes should handle GET /api/cqrs/posts/search successfully
statusReason: expected 400 to be 200 // Object.is equality

[Killed] ConditionalExpression
src/cqrs/handlers/PostQuerySearchAnalytics.ts:82:11
 
       // Parse ProjectId
       const projectIdResult = ProjectId.fromString(data.projectId);
-      if (!projectIdResult.ok) {
+      if (true) {
         return {
           success: false,
killedBy: CQRSIntegration - Query Routes should handle GET /api/cqrs/posts/search successfully
statusReason: expected 400 to be 200 // Object.is equality

[Survived] ArithmeticOperator
src/cqrs/handlers/PostQuerySearchAnalytics.ts:90:20
       }
 
       // Build pagination
-      const page = Math.floor(data.offset / data.limit) + 1;
+      const page = Math.floor(data.offset / data.limit) - 1;
       const pagination = { page, limit: data.limit };
 

[Survived] ArithmeticOperator
src/cqrs/handlers/PostQuerySearchAnalytics.ts:90:31
       }
 
       // Build pagination
-      const page = Math.floor(data.offset / data.limit) + 1;
+      const page = Math.floor(data.offset * data.limit) + 1;
       const pagination = { page, limit: data.limit };
 

[Killed] ObjectLiteral
src/cqrs/handlers/PostQuerySearchAnalytics.ts:104:15
         type: "PostsListReadModel",
         version: 1,
         lastUpdated: new Date(),
-        data: {
-          projectId: data.projectId,
-          posts: paginatedResult.items.map(mapToListEntry),
-          totalCount: paginatedResult.total,
-          filters: {
-            searchTerm: data.searchTerm,
-            ...(data.filters && { ...data.filters }),
-          },
-        },
+        data: {},
       };
 
killedBy: SearchPostsQueryHandler - Basic Functionality should include searchTerm in filters
statusReason: Cannot read properties of undefined (reading 'searchTerm')

[Survived] ConditionalExpression
src/cqrs/handlers/PostQuerySearchAnalytics.ts:110:17
           totalCount: paginatedResult.total,
           filters: {
             searchTerm: data.searchTerm,
-            ...(data.filters && { ...data.filters }),
+            ...(true),
           },
         },

[Survived] ConditionalExpression
src/cqrs/handlers/PostQuerySearchAnalytics.ts:110:17
           totalCount: paginatedResult.total,
           filters: {
             searchTerm: data.searchTerm,
-            ...(data.filters && { ...data.filters }),
+            ...(false),
           },
         },

[Killed] BlockStatement
src/cqrs/handlers/PostQuerySearchAnalytics.ts:124:21
           limit: data.limit,
         },
       };
-    } catch (error) {
-      log.error({ err: error }, "SearchPostsQuery failed");
-      return {
-        success: false,
-        error: error instanceof Error ? error.message : "Unknown error occurred",
-      };
-    }
+    } catch (error) {}
   }
 }
killedBy: SearchPostsQueryHandler - Basic Functionality should handle repository errors gracefully
statusReason: Cannot read properties of undefined (reading 'success')

[Survived] StringLiteral
src/cqrs/handlers/PostQuerySearchAnalytics.ts:125:33
         },
       };
     } catch (error) {
-      log.error({ err: error }, "SearchPostsQuery failed");
+      log.error({ err: error }, "");
       return {
         success: false,

[Killed] ConditionalExpression
src/cqrs/handlers/PostQuerySearchAnalytics.ts:151:11
     try {
       const postId = (query.data as { postId?: string }).postId;
 
-      if (!postId) {
+      if (false) {
         return {
           success: false,
killedBy: GetPostAnalyticsQueryHandler - Basic Functionality should return error for missing postId
statusReason: expected false to be truthy

[Killed] ConditionalExpression
src/cqrs/handlers/PostQuerySearchAnalytics.ts:151:11
     try {
       const postId = (query.data as { postId?: string }).postId;
 
-      if (!postId) {
+      if (true) {
         return {
           success: false,
killedBy: GetPostAnalyticsQueryHandler - Basic Functionality should retrieve analytics read model successfully
statusReason: expected false to be truthy

[Killed] ConditionalExpression
src/cqrs/handlers/PostQuerySearchAnalytics.ts:160:11
 
       // Parse PostId
       const postIdResult = PostId.fromString(postId);
-      if (!postIdResult.ok) {
+      if (false) {
         return {
           success: false,
killedBy: GetPostAnalyticsQueryHandler - Basic Functionality should return error for invalid UUID
statusReason: expected false to be truthy

[Killed] BlockStatement
src/cqrs/handlers/PostQuerySearchAnalytics.ts:160:29
 
       // Parse PostId
       const postIdResult = PostId.fromString(postId);
-      if (!postIdResult.ok) {
-        return {
-          success: false,
-          error: `Invalid post ID: ${postId}`,
-        };
-      }
+      if (!postIdResult.ok) {}
 
       const result = await this.config.postQueryRepository.getById(postIdResult.value);
killedBy: GetPostAnalyticsQueryHandler - Basic Functionality should return error for invalid UUID
statusReason: expected false to be truthy

[Killed] ObjectLiteral
src/cqrs/handlers/PostQuerySearchAnalytics.ts:170:16
       const result = await this.config.postQueryRepository.getById(postIdResult.value);
 
       if (!result.ok) {
-        return {
-          success: false,
-          error: "Post not found",
-        };
+        return {};
       }
 
killedBy: GetPostAnalyticsQueryHandler - Basic Functionality should return error when post not found
statusReason: expected undefined to be false // Object.is equality

[Killed] StringLiteral
src/cqrs/handlers/PostQuerySearchAnalytics.ts:172:18
       if (!result.ok) {
         return {
           success: false,
-          error: "Post not found",
+          error: "",
         };
       }
killedBy: GetPostAnalyticsQueryHandler - Basic Functionality should return error when post not found
statusReason: expected false to be truthy

[Killed] ObjectLiteral
src/cqrs/handlers/PostQuerySearchAnalytics.ts:181:49
       // Build a simplified analytics read model.
       // Detailed per-channel analytics come from dedicated analytics endpoints,
       // not from PostQueryRepository.
-      const readModel: PostAnalyticsReadModel = {
-        id: `post-analytics-${postId}`,
-        type: "PostAnalyticsReadModel",
-        version: 1,
-        lastUpdated: new Date(),
-        data: {
-          postId,
-          projectId: post.projectId,
-          channels: [],
-          aggregated: {
-            totalViews: 0,
-            totalLikes: 0,
-            totalShares: 0,
-            totalComments: 0,
-            totalEngagement: 0,
-            engagementRate: 0,
-          },
-          trends: [],
-        },
-      };
+      const readModel: PostAnalyticsReadModel = {};
 
       return {
killedBy: GetPostAnalyticsQueryHandler - Basic Functionality should retrieve analytics read model successfully
statusReason: expected undefined to be 'PostAnalyticsReadModel' // Object.is equality

[Survived] StringLiteral
src/cqrs/handlers/PostQuerySearchAnalytics.ts:182:13
       // Detailed per-channel analytics come from dedicated analytics endpoints,
       // not from PostQueryRepository.
       const readModel: PostAnalyticsReadModel = {
-        id: `post-analytics-${postId}`,
+        id: ``,
         type: "PostAnalyticsReadModel",
         version: 1,

[Killed] StringLiteral
src/cqrs/handlers/PostQuerySearchAnalytics.ts:183:15
       // not from PostQueryRepository.
       const readModel: PostAnalyticsReadModel = {
         id: `post-analytics-${postId}`,
-        type: "PostAnalyticsReadModel",
+        type: "",
         version: 1,
         lastUpdated: new Date(),
killedBy: GetPostAnalyticsQueryHandler - Basic Functionality should retrieve analytics read model successfully
statusReason: expected '' to be 'PostAnalyticsReadModel' // Object.is equality

[Killed] ObjectLiteral
src/cqrs/handlers/PostQuerySearchAnalytics.ts:186:15
         type: "PostAnalyticsReadModel",
         version: 1,
         lastUpdated: new Date(),
-        data: {
-          postId,
-          projectId: post.projectId,
-          channels: [],
-          aggregated: {
-            totalViews: 0,
-            totalLikes: 0,
-            totalShares: 0,
-            totalComments: 0,
-            totalEngagement: 0,
-            engagementRate: 0,
-          },
-          trends: [],
-        },
+        data: {},
       };
 
killedBy: GetPostAnalyticsQueryHandler - Basic Functionality should return channels as empty array (analytics from separate endpoints)
statusReason: expected false to be truthy

[Killed] BlockStatement
src/cqrs/handlers/PostQuerySearchAnalytics.ts:206:21
         success: true,
         data: readModel,
       };
-    } catch (error) {
-      log.error({ err: error }, "GetPostAnalyticsQuery failed");
-      return {
-        success: false,
-        error: error instanceof Error ? error.message : "Unknown error occurred",
-      };
-    }
+    } catch (error) {}
   }
 }
killedBy: GetPostAnalyticsQueryHandler - Basic Functionality should handle repository errors gracefully
statusReason: Cannot read properties of undefined (reading 'success')
