[Killed] BlockStatement
src/database/DatabaseIntegration.ts:94:58
   };
   private autoScaleInterval?: NodeJS.Timeout;
 
-  constructor(private config: DatabaseIntegrationConfig) {
-    if (config.connectionManager) {
-      // Use injected connection manager (test scenarios / DI)
-      this.connectionManager = config.connectionManager;
-    }
-    // If no connectionManager is provided, it will be created lazily in initialize()
-    // via a dynamic import of ConnectionManager. This avoids a static import that
-    // would transitively import @infra/prisma and throw at module-load time when
-    // DATABASE_URL is not set.
-  }
+  constructor(private config: DatabaseIntegrationConfig) {}
 
   /**
killedBy: DatabaseIntegration - Optimized Query Execution should execute query and cache result when cache miss
statusReason: Cannot read properties of undefined (reading 'executeQuery')

[Killed] BlockStatement
src/database/DatabaseIntegration.ts:95:35
   private autoScaleInterval?: NodeJS.Timeout;
 
   constructor(private config: DatabaseIntegrationConfig) {
-    if (config.connectionManager) {
-      // Use injected connection manager (test scenarios / DI)
-      this.connectionManager = config.connectionManager;
-    }
+    if (config.connectionManager) {}
     // If no connectionManager is provided, it will be created lazily in initialize()
     // via a dynamic import of ConnectionManager. This avoids a static import that
killedBy: DatabaseIntegration - Optimized Query Execution should execute query and cache result when cache miss
statusReason: Cannot read properties of undefined (reading 'executeQuery')

[Killed] ConditionalExpression
src/database/DatabaseIntegration.ts:95:9
   private autoScaleInterval?: NodeJS.Timeout;
 
   constructor(private config: DatabaseIntegrationConfig) {
-    if (config.connectionManager) {
+    if (false) {
       // Use injected connection manager (test scenarios / DI)
       this.connectionManager = config.connectionManager;
killedBy: DatabaseIntegration - Optimized Query Execution should execute query and cache result when cache miss
statusReason: Cannot read properties of undefined (reading 'executeQuery')

[Killed] BooleanLiteral
src/database/DatabaseIntegration.ts:112:9
     // If no connectionManager was injected, create the real one now via
     // a dynamic import so that importing this module doesn't eagerly trigger
     // the @infra/prisma → DATABASE_URL requirement at module load time.
-    if (!this.connectionManager) {
+    if (this.connectionManager) {
       const { DatabaseConnectionManager } = await import("./ConnectionManager.js");
       const replicaConfig = this.parseReplicaConfig();
killedBy: DatabaseIntegration - Auto-Scaling should initialize auto-scaling mechanism
statusReason: createTestPrismaClient() is not available in Vitest unit tests. Use DI mocks instead, or run integration tests with node:test.

[Killed] ConditionalExpression
src/database/DatabaseIntegration.ts:112:9
     // If no connectionManager was injected, create the real one now via
     // a dynamic import so that importing this module doesn't eagerly trigger
     // the @infra/prisma → DATABASE_URL requirement at module load time.
-    if (!this.connectionManager) {
+    if (true) {
       const { DatabaseConnectionManager } = await import("./ConnectionManager.js");
       const replicaConfig = this.parseReplicaConfig();
killedBy: DatabaseIntegration - Auto-Scaling should initialize auto-scaling mechanism
statusReason: createTestPrismaClient() is not available in Vitest unit tests. Use DI mocks instead, or run integration tests with node:test.

[NoCoverage] ConditionalExpression
src/database/DatabaseIntegration.ts:119:32
         {
           primary: {
             url: process.env.DATABASE_URL!,
-            poolSize: parseInt(process.env.DB_POOL_SIZE || "20"),
+            poolSize: parseInt(false),
             connectionTimeout: parseInt(process.env.DB_CONNECTION_TIMEOUT || "30000"),
             idleTimeout: parseInt(process.env.DB_IDLE_TIMEOUT || "30000"),

[NoCoverage] LogicalOperator
src/database/DatabaseIntegration.ts:119:32
         {
           primary: {
             url: process.env.DATABASE_URL!,
-            poolSize: parseInt(process.env.DB_POOL_SIZE || "20"),
+            poolSize: parseInt(process.env.DB_POOL_SIZE && "20"),
             connectionTimeout: parseInt(process.env.DB_CONNECTION_TIMEOUT || "30000"),
             idleTimeout: parseInt(process.env.DB_IDLE_TIMEOUT || "30000"),

[NoCoverage] ConditionalExpression
src/database/DatabaseIntegration.ts:120:41
           primary: {
             url: process.env.DATABASE_URL!,
             poolSize: parseInt(process.env.DB_POOL_SIZE || "20"),
-            connectionTimeout: parseInt(process.env.DB_CONNECTION_TIMEOUT || "30000"),
+            connectionTimeout: parseInt(false),
             idleTimeout: parseInt(process.env.DB_IDLE_TIMEOUT || "30000"),
           },

[NoCoverage] LogicalOperator
src/database/DatabaseIntegration.ts:120:41
           primary: {
             url: process.env.DATABASE_URL!,
             poolSize: parseInt(process.env.DB_POOL_SIZE || "20"),
-            connectionTimeout: parseInt(process.env.DB_CONNECTION_TIMEOUT || "30000"),
+            connectionTimeout: parseInt(process.env.DB_CONNECTION_TIMEOUT && "30000"),
             idleTimeout: parseInt(process.env.DB_IDLE_TIMEOUT || "30000"),
           },

[NoCoverage] ConditionalExpression
src/database/DatabaseIntegration.ts:121:35
             url: process.env.DATABASE_URL!,
             poolSize: parseInt(process.env.DB_POOL_SIZE || "20"),
             connectionTimeout: parseInt(process.env.DB_CONNECTION_TIMEOUT || "30000"),
-            idleTimeout: parseInt(process.env.DB_IDLE_TIMEOUT || "30000"),
+            idleTimeout: parseInt(true),
           },
           ...(replicaConfig && { replicas: replicaConfig }),

[NoCoverage] ConditionalExpression
src/database/DatabaseIntegration.ts:121:35
             url: process.env.DATABASE_URL!,
             poolSize: parseInt(process.env.DB_POOL_SIZE || "20"),
             connectionTimeout: parseInt(process.env.DB_CONNECTION_TIMEOUT || "30000"),
-            idleTimeout: parseInt(process.env.DB_IDLE_TIMEOUT || "30000"),
+            idleTimeout: parseInt(false),
           },
           ...(replicaConfig && { replicas: replicaConfig }),

[NoCoverage] ConditionalExpression
src/database/DatabaseIntegration.ts:123:15
             connectionTimeout: parseInt(process.env.DB_CONNECTION_TIMEOUT || "30000"),
             idleTimeout: parseInt(process.env.DB_IDLE_TIMEOUT || "30000"),
           },
-          ...(replicaConfig && { replicas: replicaConfig }),
+          ...(true),
           pooling: {
             minConnections: 5,

[NoCoverage] LogicalOperator
src/database/DatabaseIntegration.ts:123:15
             connectionTimeout: parseInt(process.env.DB_CONNECTION_TIMEOUT || "30000"),
             idleTimeout: parseInt(process.env.DB_IDLE_TIMEOUT || "30000"),
           },
-          ...(replicaConfig && { replicas: replicaConfig }),
+          ...(replicaConfig || {
+  replicas: replicaConfig
+}),
           pooling: {
             minConnections: 5,

[NoCoverage] ObjectLiteral
src/database/DatabaseIntegration.ts:124:20
             idleTimeout: parseInt(process.env.DB_IDLE_TIMEOUT || "30000"),
           },
           ...(replicaConfig && { replicas: replicaConfig }),
-          pooling: {
-            minConnections: 5,
-            maxConnections: parseInt(process.env.DB_POOL_SIZE || "20"),
-            acquireTimeout: 10000,
-            createTimeout: 5000,
-            destroyTimeout: 5000,
-            reapInterval: 1000,
-          },
+          pooling: {},
           monitoring: {
             enabled: process.env.NODE_ENV === "production",

[NoCoverage] LogicalOperator
src/database/DatabaseIntegration.ts:126:38
           ...(replicaConfig && { replicas: replicaConfig }),
           pooling: {
             minConnections: 5,
-            maxConnections: parseInt(process.env.DB_POOL_SIZE || "20"),
+            maxConnections: parseInt(process.env.DB_POOL_SIZE && "20"),
             acquireTimeout: 10000,
             createTimeout: 5000,

[NoCoverage] ConditionalExpression
src/database/DatabaseIntegration.ts:126:38
           ...(replicaConfig && { replicas: replicaConfig }),
           pooling: {
             minConnections: 5,
-            maxConnections: parseInt(process.env.DB_POOL_SIZE || "20"),
+            maxConnections: parseInt(true),
             acquireTimeout: 10000,
             createTimeout: 5000,

[NoCoverage] EqualityOperator
src/database/DatabaseIntegration.ts:133:22
             reapInterval: 1000,
           },
           monitoring: {
-            enabled: process.env.NODE_ENV === "production",
+            enabled: process.env.NODE_ENV !== "production",
             slowQueryThreshold: 1000, // 1 second
             healthCheckInterval: 30000, // 30 seconds

[NoCoverage] ConditionalExpression
src/database/DatabaseIntegration.ts:133:22
             reapInterval: 1000,
           },
           monitoring: {
-            enabled: process.env.NODE_ENV === "production",
+            enabled: true,
             slowQueryThreshold: 1000, // 1 second
             healthCheckInterval: 30000, // 30 seconds

[Killed] ConditionalExpression
src/database/DatabaseIntegration.ts:167:83
       forceRefresh?: boolean;
     }
   ): Promise<T> {
-    const { readOnly = false, cacheTtl = 300, tags = [], forceRefresh = false } = options || {};
+    const { readOnly = false, cacheTtl = 300, tags = [], forceRefresh = false } = false;
     const startTime = Date.now();
 
killedBy: DatabaseIntegration - Optimized Query Execution should force refresh and bypass cache when requested
statusReason: expected { id: 'old', name: 'Old Data' } to strictly equal { id: 'new', name: 'New Data' }

[Killed] ConditionalExpression
src/database/DatabaseIntegration.ts:167:83
       forceRefresh?: boolean;
     }
   ): Promise<T> {
-    const { readOnly = false, cacheTtl = 300, tags = [], forceRefresh = false } = options || {};
+    const { readOnly = false, cacheTtl = 300, tags = [], forceRefresh = false } = true;
     const startTime = Date.now();
 
killedBy: DatabaseIntegration - Optimized Query Execution should force refresh and bypass cache when requested
statusReason: expected { id: 'old', name: 'Old Data' } to strictly equal { id: 'new', name: 'New Data' }

[Killed] ConditionalExpression
src/database/DatabaseIntegration.ts:172:11
 
     try {
       // Try cache first (unless force refresh)
-      if (!forceRefresh) {
+      if (true) {
         const cacheResponse = await this.config.cache.get<T>(queryKey);
 
killedBy: DatabaseIntegration - Optimized Query Execution should force refresh and bypass cache when requested
statusReason: expected { id: 'old', name: 'Old Data' } to strictly equal { id: 'new', name: 'New Data' }

[Killed] BooleanLiteral
src/database/DatabaseIntegration.ts:172:11
 
     try {
       // Try cache first (unless force refresh)
-      if (!forceRefresh) {
+      if (forceRefresh) {
         const cacheResponse = await this.config.cache.get<T>(queryKey);
 
killedBy: DatabaseIntegration - Optimized Query Execution should return cached result when available
statusReason: expected { id: '456', name: 'Fresh Data' } to strictly equal { id: '123', name: 'Cached Data' }

[Killed] LogicalOperator
src/database/DatabaseIntegration.ts:175:13
       if (!forceRefresh) {
         const cacheResponse = await this.config.cache.get<T>(queryKey);
 
-        if (cacheResponse.ok && cacheResponse.value !== null) {
+        if (cacheResponse.ok || cacheResponse.value !== null) {
           this.recordQueryAnalytics({
             queryType: readOnly ? "READ_CACHED" : "WRITE_CACHED",
killedBy: DatabaseIntegration - Optimized Query Execution should execute query and cache result when cache miss
statusReason: expected null to strictly equal { id: '789', name: 'Fresh Data' }

[Killed] EqualityOperator
src/database/DatabaseIntegration.ts:175:33
       if (!forceRefresh) {
         const cacheResponse = await this.config.cache.get<T>(queryKey);
 
-        if (cacheResponse.ok && cacheResponse.value !== null) {
+        if (cacheResponse.ok && cacheResponse.value === null) {
           this.recordQueryAnalytics({
             queryType: readOnly ? "READ_CACHED" : "WRITE_CACHED",
killedBy: DatabaseIntegration - Optimized Query Execution should return cached result when available
statusReason: expected { id: '456', name: 'Fresh Data' } to strictly equal { id: '123', name: 'Cached Data' }

[Survived] ObjectLiteral
src/database/DatabaseIntegration.ts:176:37
         const cacheResponse = await this.config.cache.get<T>(queryKey);
 
         if (cacheResponse.ok && cacheResponse.value !== null) {
-          this.recordQueryAnalytics({
-            queryType: readOnly ? "READ_CACHED" : "WRITE_CACHED",
-            executionTime: Date.now() - startTime,
-            resultSize: JSON.stringify(cacheResponse.value).length,
-            cacheHit: true,
-            replicaUsed: false,
-          });
+          this.recordQueryAnalytics({});
 
           return cacheResponse.value;

[Survived] ArithmeticOperator
src/database/DatabaseIntegration.ts:178:28
         if (cacheResponse.ok && cacheResponse.value !== null) {
           this.recordQueryAnalytics({
             queryType: readOnly ? "READ_CACHED" : "WRITE_CACHED",
-            executionTime: Date.now() - startTime,
+            executionTime: Date.now() + startTime,
             resultSize: JSON.stringify(cacheResponse.value).length,
             cacheHit: true,

[Survived] BooleanLiteral
src/database/DatabaseIntegration.ts:180:23
             queryType: readOnly ? "READ_CACHED" : "WRITE_CACHED",
             executionTime: Date.now() - startTime,
             resultSize: JSON.stringify(cacheResponse.value).length,
-            cacheHit: true,
+            cacheHit: false,
             replicaUsed: false,
           });

[Survived] BooleanLiteral
src/database/DatabaseIntegration.ts:181:26
             executionTime: Date.now() - startTime,
             resultSize: JSON.stringify(cacheResponse.value).length,
             cacheHit: true,
-            replicaUsed: false,
+            replicaUsed: true,
           });
 

[Killed] ObjectLiteral
src/database/DatabaseIntegration.ts:196:53
       });
 
       // Cache the result
-      await this.config.cache.set(queryKey, result, { ttl: cacheTtl, tags });
+      await this.config.cache.set(queryKey, result, {});
 
       // Record analytics
killedBy: DatabaseIntegration - Optimized Query Execution should use custom cache TTL when provided
statusReason: expected undefined to be 600 // Object.is equality

[Survived] StringLiteral
src/database/DatabaseIntegration.ts:200:43
 
       // Record analytics
       this.recordQueryAnalytics({
-        queryType: readOnly ? "READ_DB" : "WRITE_DB",
+        queryType: readOnly ? "READ_DB" : "",
         executionTime: Date.now() - startTime,
         resultSize: JSON.stringify(result).length,

[Survived] ArithmeticOperator
src/database/DatabaseIntegration.ts:201:24
       // Record analytics
       this.recordQueryAnalytics({
         queryType: readOnly ? "READ_DB" : "WRITE_DB",
-        executionTime: Date.now() - startTime,
+        executionTime: Date.now() + startTime,
         resultSize: JSON.stringify(result).length,
         cacheHit: false,

[Survived] BooleanLiteral
src/database/DatabaseIntegration.ts:203:19
         queryType: readOnly ? "READ_DB" : "WRITE_DB",
         executionTime: Date.now() - startTime,
         resultSize: JSON.stringify(result).length,
-        cacheHit: false,
+        cacheHit: true,
         replicaUsed: readOnly, // Assumes replicas are used for reads
       });

[Survived] ConditionalExpression
src/database/DatabaseIntegration.ts:208:11
       });
 
       // Update load metrics
-      if (readOnly) {
+      if (true) {
         this.loadMetrics.readQueries++;
         this.loadMetrics.averageReadTime = this.calculateMovingAverage(

[Survived] ConditionalExpression
src/database/DatabaseIntegration.ts:208:11
       });
 
       // Update load metrics
-      if (readOnly) {
+      if (false) {
         this.loadMetrics.readQueries++;
         this.loadMetrics.averageReadTime = this.calculateMovingAverage(

[Survived] UpdateOperator
src/database/DatabaseIntegration.ts:209:9
 
       // Update load metrics
       if (readOnly) {
-        this.loadMetrics.readQueries++;
+        this.loadMetrics.readQueries--;
         this.loadMetrics.averageReadTime = this.calculateMovingAverage(
           this.loadMetrics.averageReadTime,

[Survived] ArithmeticOperator
src/database/DatabaseIntegration.ts:212:11
         this.loadMetrics.readQueries++;
         this.loadMetrics.averageReadTime = this.calculateMovingAverage(
           this.loadMetrics.averageReadTime,
-          Date.now() - startTime,
+          Date.now() + startTime,
           this.loadMetrics.readQueries
         );

[Survived] BlockStatement
src/database/DatabaseIntegration.ts:215:14
           Date.now() - startTime,
           this.loadMetrics.readQueries
         );
-      } else {
-        this.loadMetrics.writeQueries++;
-        this.loadMetrics.averageWriteTime = this.calculateMovingAverage(
-          this.loadMetrics.averageWriteTime,
-          Date.now() - startTime,
-          this.loadMetrics.writeQueries
-        );
-      }
+      } else {}
 
       return result;

[Survived] UpdateOperator
src/database/DatabaseIntegration.ts:216:9
           this.loadMetrics.readQueries
         );
       } else {
-        this.loadMetrics.writeQueries++;
+        this.loadMetrics.writeQueries--;
         this.loadMetrics.averageWriteTime = this.calculateMovingAverage(
           this.loadMetrics.averageWriteTime,

[Survived] ArithmeticOperator
src/database/DatabaseIntegration.ts:219:11
         this.loadMetrics.writeQueries++;
         this.loadMetrics.averageWriteTime = this.calculateMovingAverage(
           this.loadMetrics.averageWriteTime,
-          Date.now() - startTime,
+          Date.now() + startTime,
           this.loadMetrics.writeQueries
         );

[Killed] BlockStatement
src/database/DatabaseIntegration.ts:225:21
       }
 
       return result;
-    } catch (error) {
-      dbLogger.error({ err: error, queryKey }, "Optimized query failed");
-
-      // Emit error event
-      const errorEvent = createDomainEvent(
-        "database.query-error",
-        queryKey,
-        "Database",
-        {
-          queryKey,
-          readOnly,
-          executionTime: Date.now() - startTime,
-          error: error instanceof Error ? error.message : "Unknown error",
-        },
-        { source: "DatabaseIntegration" }
-      );
-
-      await this.config.eventService.publishEvent(errorEvent);
-      throw error;
-    }
+    } catch (error) {}
   }
 
killedBy: DatabaseIntegration - Optimized Query Execution should publish error event on query failure
statusReason: promise resolved "undefined" instead of rejecting

[Survived] ArithmeticOperator
src/database/DatabaseIntegration.ts:236:26
         {
           queryKey,
           readOnly,
-          executionTime: Date.now() - startTime,
+          executionTime: Date.now() + startTime,
           error: error instanceof Error ? error.message : "Unknown error",
         },

[Survived] ObjectLiteral
src/database/DatabaseIntegration.ts:239:9
           executionTime: Date.now() - startTime,
           error: error instanceof Error ? error.message : "Unknown error",
         },
-        { source: "DatabaseIntegration" }
+        {}
       );
 

[Survived] StringLiteral
src/database/DatabaseIntegration.ts:239:19
           executionTime: Date.now() - startTime,
           error: error instanceof Error ? error.message : "Unknown error",
         },
-        { source: "DatabaseIntegration" }
+        { source: "" }
       );
 

[Killed] LogicalOperator
src/database/DatabaseIntegration.ts:255:49
     transaction: (client: any) => Promise<T>,
     options?: { timeout?: number; cacheTags?: string[] }
   ): Promise<T> {
-    const { timeout = 60000, cacheTags = [] } = options || {};
+    const { timeout = 60000, cacheTags = [] } = options && {};
     const startTime = Date.now();
 
killedBy: DatabaseIntegration - Optimized Transaction should execute transaction successfully
statusReason: Cannot read properties of undefined (reading 'timeout')

[Killed] ConditionalExpression
src/database/DatabaseIntegration.ts:255:49
     transaction: (client: any) => Promise<T>,
     options?: { timeout?: number; cacheTags?: string[] }
   ): Promise<T> {
-    const { timeout = 60000, cacheTags = [] } = options || {};
+    const { timeout = 60000, cacheTags = [] } = true;
     const startTime = Date.now();
 
killedBy: DatabaseIntegration - Optimized Transaction should invalidate cache tags after transaction
statusReason: expected +0 to be 2 // Object.is equality

[Killed] BlockStatement
src/database/DatabaseIntegration.ts:258:9
     const { timeout = 60000, cacheTags = [] } = options || {};
     const startTime = Date.now();
 
-    try {
-      const result = await this.connectionManager.executeTransaction(transaction, { timeout });
-
-      // Invalidate related caches
-      if (cacheTags.length > 0) {
-        for (const tag of cacheTags) {
-          await this.config.cache.invalidateByTag(tag);
-        }
-      }
-
-      // Record transaction analytics
-      this.recordQueryAnalytics({
-        queryType: "TRANSACTION",
-        executionTime: Date.now() - startTime,
-        resultSize: JSON.stringify(result).length,
-        cacheHit: false,
-        replicaUsed: false,
-      });
-
-      return result;
-    } catch (error) {
+    try {} catch (error) {
       dbLogger.error({ err: error, transactionKey }, "Transaction failed");
 
killedBy: DatabaseIntegration - Optimized Transaction should execute transaction successfully
statusReason: expected undefined to strictly equal { success: true, committed: true }

[Survived] ObjectLiteral
src/database/DatabaseIntegration.ts:259:83
     const startTime = Date.now();
 
     try {
-      const result = await this.connectionManager.executeTransaction(transaction, { timeout });
+      const result = await this.connectionManager.executeTransaction(transaction, {});
 
       // Invalidate related caches

[Killed] BlockStatement
src/database/DatabaseIntegration.ts:262:33
       const result = await this.connectionManager.executeTransaction(transaction, { timeout });
 
       // Invalidate related caches
-      if (cacheTags.length > 0) {
-        for (const tag of cacheTags) {
-          await this.config.cache.invalidateByTag(tag);
-        }
-      }
+      if (cacheTags.length > 0) {}
 
       // Record transaction analytics
killedBy: DatabaseIntegration - Optimized Transaction should invalidate cache tags after transaction
statusReason: expected +0 to be 2 // Object.is equality

[Killed] EqualityOperator
src/database/DatabaseIntegration.ts:262:11
       const result = await this.connectionManager.executeTransaction(transaction, { timeout });
 
       // Invalidate related caches
-      if (cacheTags.length > 0) {
+      if (cacheTags.length <= 0) {
         for (const tag of cacheTags) {
           await this.config.cache.invalidateByTag(tag);
killedBy: DatabaseIntegration - Optimized Transaction should invalidate cache tags after transaction
statusReason: expected +0 to be 2 // Object.is equality

[Killed] BlockStatement
src/database/DatabaseIntegration.ts:263:38
 
       // Invalidate related caches
       if (cacheTags.length > 0) {
-        for (const tag of cacheTags) {
-          await this.config.cache.invalidateByTag(tag);
-        }
+        for (const tag of cacheTags) {}
       }
 
killedBy: DatabaseIntegration - Optimized Transaction should invalidate cache tags after transaction
statusReason: expected +0 to be 2 // Object.is equality

[Survived] ObjectLiteral
src/database/DatabaseIntegration.ts:269:33
       }
 
       // Record transaction analytics
-      this.recordQueryAnalytics({
-        queryType: "TRANSACTION",
-        executionTime: Date.now() - startTime,
-        resultSize: JSON.stringify(result).length,
-        cacheHit: false,
-        replicaUsed: false,
-      });
+      this.recordQueryAnalytics({});
 
       return result;

[Survived] ArithmeticOperator
src/database/DatabaseIntegration.ts:271:24
       // Record transaction analytics
       this.recordQueryAnalytics({
         queryType: "TRANSACTION",
-        executionTime: Date.now() - startTime,
+        executionTime: Date.now() + startTime,
         resultSize: JSON.stringify(result).length,
         cacheHit: false,

[Survived] BooleanLiteral
src/database/DatabaseIntegration.ts:274:22
         executionTime: Date.now() - startTime,
         resultSize: JSON.stringify(result).length,
         cacheHit: false,
-        replicaUsed: false,
+        replicaUsed: true,
       });
 

[Killed] BlockStatement
src/database/DatabaseIntegration.ts:278:21
       });
 
       return result;
-    } catch (error) {
-      dbLogger.error({ err: error, transactionKey }, "Transaction failed");
-
-      // Emit transaction error event
-      const errorEvent = createDomainEvent(
-        "database.transaction-error",
-        transactionKey,
-        "Database",
-        {
-          transactionKey,
-          executionTime: Date.now() - startTime,
-          error: error instanceof Error ? error.message : "Unknown error",
-        },
-        { source: "DatabaseIntegration" }
-      );
-
-      await this.config.eventService.publishEvent(errorEvent);
-      throw error;
-    }
+    } catch (error) {}
   }
 
killedBy: DatabaseIntegration - Optimized Transaction should publish error event on transaction failure
statusReason: promise resolved "undefined" instead of rejecting

[Survived] StringLiteral
src/database/DatabaseIntegration.ts:279:54
 
       return result;
     } catch (error) {
-      dbLogger.error({ err: error, transactionKey }, "Transaction failed");
+      dbLogger.error({ err: error, transactionKey }, "");
 
       // Emit transaction error event

[Survived] StringLiteral
src/database/DatabaseIntegration.ts:283:9
 
       // Emit transaction error event
       const errorEvent = createDomainEvent(
-        "database.transaction-error",
+        "",
         transactionKey,
         "Database",

[Survived] StringLiteral
src/database/DatabaseIntegration.ts:285:9
       const errorEvent = createDomainEvent(
         "database.transaction-error",
         transactionKey,
-        "Database",
+        "",
         {
           transactionKey,

[Survived] ArithmeticOperator
src/database/DatabaseIntegration.ts:288:26
         "Database",
         {
           transactionKey,
-          executionTime: Date.now() - startTime,
+          executionTime: Date.now() + startTime,
           error: error instanceof Error ? error.message : "Unknown error",
         },

[NoCoverage] BlockStatement
src/database/DatabaseIntegration.ts:306:67
     const { fastify } = this.config;
 
     // Database health endpoint
-    fastify.get("/api/database/health", async (request, reply) => {
-      try {
-        const health = await this.connectionManager.healthCheck();
-        const stats = this.connectionManager.getConnectionStats();
-
-        return {
-          ...health,
-          connectionStats: stats,
-          loadMetrics: this.loadMetrics,
-          timestamp: new Date(),
-        };
-      } catch (error) {
-        dbLogger.error({ err: error }, "Database health check failed");
-        return reply.status(500).send({
-          status: "unhealthy",
-          error: "Health check failed",
-        });
-      }
-    });
+    fastify.get("/api/database/health", async (request, reply) => {});
 
     // Database statistics endpoint

[Killed] StringLiteral
src/database/DatabaseIntegration.ts:306:17
     const { fastify } = this.config;
 
     // Database health endpoint
-    fastify.get("/api/database/health", async (request, reply) => {
+    fastify.get("", async (request, reply) => {
       try {
         const health = await this.connectionManager.healthCheck();
killedBy: DatabaseIntegration - Route Registration should register health check route
statusReason: expected undefined to be truthy

[NoCoverage] BlockStatement
src/database/DatabaseIntegration.ts:307:11
 
     // Database health endpoint
     fastify.get("/api/database/health", async (request, reply) => {
-      try {
-        const health = await this.connectionManager.healthCheck();
-        const stats = this.connectionManager.getConnectionStats();
-
-        return {
-          ...health,
-          connectionStats: stats,
-          loadMetrics: this.loadMetrics,
-          timestamp: new Date(),
-        };
-      } catch (error) {
+      try {} catch (error) {
         dbLogger.error({ err: error }, "Database health check failed");
         return reply.status(500).send({

[NoCoverage] BlockStatement
src/database/DatabaseIntegration.ts:317:23
           loadMetrics: this.loadMetrics,
           timestamp: new Date(),
         };
-      } catch (error) {
-        dbLogger.error({ err: error }, "Database health check failed");
-        return reply.status(500).send({
-          status: "unhealthy",
-          error: "Health check failed",
-        });
-      }
+      } catch (error) {}
     });
 

[Killed] StringLiteral
src/database/DatabaseIntegration.ts:327:17
     });
 
     // Database statistics endpoint
-    fastify.get("/api/database/stats", async (request, reply) => {
+    fastify.get("", async (request, reply) => {
       try {
         const connectionStats = this.connectionManager.getConnectionStats();
killedBy: DatabaseIntegration - Route Registration should register statistics route
statusReason: expected undefined to be truthy
