[Killed] BlockStatement
src/database/DatabaseOptimizer.ts:70:51
   /**
    * Refresh all materialized views for optimal query performance
    */
-  async refreshMaterializedViews(): Promise<void> {
-    try {
-      this.logger.info("Starting materialized view refresh");
-
-      // Use the stored function we created in the migration
-      await this.prisma.$executeRaw`SELECT refresh_analytics_summary()`;
-
-      this.logger.info("Materialized views refreshed successfully");
-    } catch (error) {
-      this.logger.error({ error }, "Failed to refresh materialized views");
-      throw error;
-    }
-  }
+  async refreshMaterializedViews(): Promise<void> {}
 
   /**
killedBy: DatabaseOptimizer - Materialized View Refresh should refresh materialized views successfully
statusReason: expected +0 to be 1 // Object.is equality

[Killed] BlockStatement
src/database/DatabaseOptimizer.ts:71:9
    * Refresh all materialized views for optimal query performance
    */
   async refreshMaterializedViews(): Promise<void> {
-    try {
-      this.logger.info("Starting materialized view refresh");
-
-      // Use the stored function we created in the migration
-      await this.prisma.$executeRaw`SELECT refresh_analytics_summary()`;
-
-      this.logger.info("Materialized views refreshed successfully");
-    } catch (error) {
+    try {} catch (error) {
       this.logger.error({ error }, "Failed to refresh materialized views");
       throw error;
killedBy: DatabaseOptimizer - Materialized View Refresh should refresh materialized views successfully
statusReason: expected +0 to be 1 // Object.is equality

[Survived] StringLiteral
src/database/DatabaseOptimizer.ts:72:24
    */
   async refreshMaterializedViews(): Promise<void> {
     try {
-      this.logger.info("Starting materialized view refresh");
+      this.logger.info("");
 
       // Use the stored function we created in the migration

[Survived] StringLiteral
src/database/DatabaseOptimizer.ts:75:36
       this.logger.info("Starting materialized view refresh");
 
       // Use the stored function we created in the migration
-      await this.prisma.$executeRaw`SELECT refresh_analytics_summary()`;
+      await this.prisma.$executeRaw``;
 
       this.logger.info("Materialized views refreshed successfully");

[Survived] StringLiteral
src/database/DatabaseOptimizer.ts:77:24
       // Use the stored function we created in the migration
       await this.prisma.$executeRaw`SELECT refresh_analytics_summary()`;
 
-      this.logger.info("Materialized views refreshed successfully");
+      this.logger.info("");
     } catch (error) {
       this.logger.error({ error }, "Failed to refresh materialized views");

[Killed] BlockStatement
src/database/DatabaseOptimizer.ts:78:21
       await this.prisma.$executeRaw`SELECT refresh_analytics_summary()`;
 
       this.logger.info("Materialized views refreshed successfully");
-    } catch (error) {
-      this.logger.error({ error }, "Failed to refresh materialized views");
-      throw error;
-    }
+    } catch (error) {}
   }
 
killedBy: DatabaseOptimizer - Materialized View Refresh should log error on materialized view refresh failure
statusReason: promise resolved "undefined" instead of rejecting

[Survived] StringLiteral
src/database/DatabaseOptimizer.ts:79:36
 
       this.logger.info("Materialized views refreshed successfully");
     } catch (error) {
-      this.logger.error({ error }, "Failed to refresh materialized views");
+      this.logger.error({ error }, "");
       throw error;
     }

[Killed] BlockStatement
src/database/DatabaseOptimizer.ts:87:66
   /**
    * Get comprehensive database health report
    */
-  async getDatabaseHealthReport(): Promise<DatabaseHealthReport> {
-    try {
-      const [connectionStats, queryStats, indexStats, materializedViewStatus] = await Promise.all([
-        this.getConnectionStatistics(),
-        this.getQueryPerformanceMetrics(),
-        this.getIndexEfficiencyReport(),
-        this.getMaterializedViewStatus(),
-      ]);
-
-      const overall = this.calculateOverallHealth(connectionStats, queryStats);
-
-      return {
-        overall,
-        connectionUsage: connectionStats,
-        queryPerformance: queryStats,
-        indexEfficiency: indexStats,
-        materializedViewStatus,
-      };
-    } catch (error) {
-      this.logger.error({ error }, "Failed to generate database health report");
-      throw error;
-    }
-  }
+  async getDatabaseHealthReport(): Promise<DatabaseHealthReport> {}
 
   /**
killedBy: DatabaseOptimizer - Database Health Report should generate comprehensive health report
statusReason: expected undefined to be truthy

[Killed] BlockStatement
src/database/DatabaseOptimizer.ts:88:9
    * Get comprehensive database health report
    */
   async getDatabaseHealthReport(): Promise<DatabaseHealthReport> {
-    try {
-      const [connectionStats, queryStats, indexStats, materializedViewStatus] = await Promise.all([
-        this.getConnectionStatistics(),
-        this.getQueryPerformanceMetrics(),
-        this.getIndexEfficiencyReport(),
-        this.getMaterializedViewStatus(),
-      ]);
-
-      const overall = this.calculateOverallHealth(connectionStats, queryStats);
-
-      return {
-        overall,
-        connectionUsage: connectionStats,
-        queryPerformance: queryStats,
-        indexEfficiency: indexStats,
-        materializedViewStatus,
-      };
-    } catch (error) {
+    try {} catch (error) {
       this.logger.error({ error }, "Failed to generate database health report");
       throw error;
killedBy: DatabaseOptimizer - Database Health Report should generate comprehensive health report
statusReason: expected undefined to be truthy

[Killed] ArrayDeclaration
src/database/DatabaseOptimizer.ts:89:99
    */
   async getDatabaseHealthReport(): Promise<DatabaseHealthReport> {
     try {
-      const [connectionStats, queryStats, indexStats, materializedViewStatus] = await Promise.all([
-        this.getConnectionStatistics(),
-        this.getQueryPerformanceMetrics(),
-        this.getIndexEfficiencyReport(),
-        this.getMaterializedViewStatus(),
-      ]);
+      const [connectionStats, queryStats, indexStats, materializedViewStatus] = await Promise.all([]);
 
       const overall = this.calculateOverallHealth(connectionStats, queryStats);
killedBy: DatabaseOptimizer - Database Health Report should generate comprehensive health report
statusReason: Cannot read properties of undefined (reading 'utilization')

[Killed] BlockStatement
src/database/DatabaseOptimizer.ts:105:21
         indexEfficiency: indexStats,
         materializedViewStatus,
       };
-    } catch (error) {
-      this.logger.error({ error }, "Failed to generate database health report");
-      throw error;
-    }
+    } catch (error) {}
   }
 
killedBy: DatabaseOptimizer - Database Health Report should handle health check errors gracefully
statusReason: promise resolved "undefined" instead of rejecting

[Survived] ObjectLiteral
src/database/DatabaseOptimizer.ts:106:25
         materializedViewStatus,
       };
     } catch (error) {
-      this.logger.error({ error }, "Failed to generate database health report");
+      this.logger.error({}, "Failed to generate database health report");
       throw error;
     }

[Survived] StringLiteral
src/database/DatabaseOptimizer.ts:106:36
         materializedViewStatus,
       };
     } catch (error) {
-      this.logger.error({ error }, "Failed to generate database health report");
+      this.logger.error({ error }, "");
       throw error;
     }

[Killed] BlockStatement
src/database/DatabaseOptimizer.ts:115:9
    * Get optimized dashboard posts using the custom function
    */
   async getDashboardPosts(accountId: string, limit: number = 50, offset: number = 0) {
-    try {
-      const posts = await this.prisma.$queryRaw<
-        Array<{
-          post_id: string;
-          title: string;
-          status: string;
-          scheduled_at: Date | null;
-          created_at: Date;
-          channel_count: number;
-          total_views: number;
-        }>
-      >`
-        SELECT * FROM get_dashboard_posts(${accountId}::uuid, ${limit}, ${offset})
-      `;
-
-      return posts.map((post: any) => ({
-        id: post.post_id,
-        title: post.title,
-        status: post.status,
-        scheduledAt: post.scheduled_at,
-        createdAt: post.created_at,
-        channelCount: Number(post.channel_count),
-        totalViews: Number(post.total_views),
-      }));
-    } catch (error) {
+    try {} catch (error) {
       this.logger.error({ error, accountId }, "Failed to get dashboard posts");
       throw error;
killedBy: DatabaseOptimizer - Dashboard Posts should retrieve dashboard posts using optimized function
statusReason: expected false to be truthy

[Killed] ArrowFunction
src/database/DatabaseOptimizer.ts:130:24
         SELECT * FROM get_dashboard_posts(${accountId}::uuid, ${limit}, ${offset})
       `;
 
-      return posts.map((post: any) => ({
-        id: post.post_id,
-        title: post.title,
-        status: post.status,
-        scheduledAt: post.scheduled_at,
-        createdAt: post.created_at,
-        channelCount: Number(post.channel_count),
-        totalViews: Number(post.total_views),
-      }));
+      return posts.map(() => undefined);
     } catch (error) {
       this.logger.error({ error, accountId }, "Failed to get dashboard posts");
killedBy: DatabaseOptimizer - Dashboard Posts should format post data correctly
statusReason: expected undefined to be 'post-123' // Object.is equality

[Killed] BlockStatement
src/database/DatabaseOptimizer.ts:139:21
         channelCount: Number(post.channel_count),
         totalViews: Number(post.total_views),
       }));
-    } catch (error) {
-      this.logger.error({ error, accountId }, "Failed to get dashboard posts");
-      throw error;
-    }
+    } catch (error) {}
   }
 
killedBy: DatabaseOptimizer - Dashboard Posts should log error on query failure
statusReason: promise resolved "undefined" instead of rejecting

[Survived] StringLiteral
src/database/DatabaseOptimizer.ts:140:47
         totalViews: Number(post.total_views),
       }));
     } catch (error) {
-      this.logger.error({ error, accountId }, "Failed to get dashboard posts");
+      this.logger.error({ error, accountId }, "");
       throw error;
     }

[Survived] ObjectLiteral
src/database/DatabaseOptimizer.ts:140:25
         totalViews: Number(post.total_views),
       }));
     } catch (error) {
-      this.logger.error({ error, accountId }, "Failed to get dashboard posts");
+      this.logger.error({}, "Failed to get dashboard posts");
       throw error;
     }

[Survived] StringLiteral
src/database/DatabaseOptimizer.ts:161:8
           last_activity: Date | null;
           avg_post_views: number;
         }>
-      >`
-        SELECT * FROM tenant_dashboard_stats WHERE "accountId" = ${accountId}::uuid
-      `;
+      >``;
 
       return stats[0]

[Killed] BlockStatement
src/database/DatabaseOptimizer.ts:176:21
             avgPostViews: Number(stats[0].avg_post_views),
           }
         : null;
-    } catch (error) {
-      this.logger.error({ error, accountId }, "Failed to get tenant dashboard stats");
-      throw error;
-    }
+    } catch (error) {}
   }
 
killedBy: DatabaseOptimizer - Tenant Dashboard Stats should handle query errors
statusReason: promise resolved "undefined" instead of rejecting

[Survived] StringLiteral
src/database/DatabaseOptimizer.ts:177:47
           }
         : null;
     } catch (error) {
-      this.logger.error({ error, accountId }, "Failed to get tenant dashboard stats");
+      this.logger.error({ error, accountId }, "");
       throw error;
     }

[Survived] ObjectLiteral
src/database/DatabaseOptimizer.ts:177:25
           }
         : null;
     } catch (error) {
-      this.logger.error({ error, accountId }, "Failed to get tenant dashboard stats");
+      this.logger.error({}, "Failed to get tenant dashboard stats");
       throw error;
     }

[NoCoverage] BlockStatement
src/database/DatabaseOptimizer.ts:185:68
   /**
    * Get total count of dashboard posts for pagination
    */
-  async getDashboardPostsCount(accountId: string): Promise<number> {
-    try {
-      const countResult = await this.prisma.$queryRaw<Array<{ count: bigint }>>`
-        SELECT COUNT(*) as count
-        FROM "Post" p
-        INNER JOIN "Project" pr ON pr.id = p."projectId"
-        WHERE pr."accountId"::text = ${accountId}
-      `;
-      const firstResult = countResult[0];
-      return Number(firstResult?.count ?? 0);
-    } catch (error) {
-      this.logger.error({ error, accountId }, "Failed to get dashboard posts count");
-      throw error;
-    }
-  }
+  async getDashboardPostsCount(accountId: string): Promise<number> {}
 
   /**

[NoCoverage] BlockStatement
src/database/DatabaseOptimizer.ts:186:9
    * Get total count of dashboard posts for pagination
    */
   async getDashboardPostsCount(accountId: string): Promise<number> {
-    try {
-      const countResult = await this.prisma.$queryRaw<Array<{ count: bigint }>>`
-        SELECT COUNT(*) as count
-        FROM "Post" p
-        INNER JOIN "Project" pr ON pr.id = p."projectId"
-        WHERE pr."accountId"::text = ${accountId}
-      `;
-      const firstResult = countResult[0];
-      return Number(firstResult?.count ?? 0);
-    } catch (error) {
+    try {} catch (error) {
       this.logger.error({ error, accountId }, "Failed to get dashboard posts count");
       throw error;

[NoCoverage] LogicalOperator
src/database/DatabaseOptimizer.ts:194:21
         WHERE pr."accountId"::text = ${accountId}
       `;
       const firstResult = countResult[0];
-      return Number(firstResult?.count ?? 0);
+      return Number(firstResult?.count && 0);
     } catch (error) {
       this.logger.error({ error, accountId }, "Failed to get dashboard posts count");

[NoCoverage] OptionalChaining
src/database/DatabaseOptimizer.ts:194:21
         WHERE pr."accountId"::text = ${accountId}
       `;
       const firstResult = countResult[0];
-      return Number(firstResult?.count ?? 0);
+      return Number(firstResult.count ?? 0);
     } catch (error) {
       this.logger.error({ error, accountId }, "Failed to get dashboard posts count");

[NoCoverage] BlockStatement
src/database/DatabaseOptimizer.ts:195:21
       `;
       const firstResult = countResult[0];
       return Number(firstResult?.count ?? 0);
-    } catch (error) {
-      this.logger.error({ error, accountId }, "Failed to get dashboard posts count");
-      throw error;
-    }
+    } catch (error) {}
   }
 

[NoCoverage] ObjectLiteral
src/database/DatabaseOptimizer.ts:196:25
       const firstResult = countResult[0];
       return Number(firstResult?.count ?? 0);
     } catch (error) {
-      this.logger.error({ error, accountId }, "Failed to get dashboard posts count");
+      this.logger.error({}, "Failed to get dashboard posts count");
       throw error;
     }

[Killed] ArrowFunction
src/database/DatabaseOptimizer.ts:229:26
         ORDER BY hour DESC
       `;
 
-      return summary.map((row: any) => ({
-        hour: row.hour,
-        totalViews: Number(row.total_views),
-        totalLikes: Number(row.total_likes),
-        totalComments: Number(row.total_comments),
-        totalShares: Number(row.total_shares),
-        dataPoints: Number(row.data_points),
-      }));
+      return summary.map(() => undefined);
     } catch (error) {
       this.logger.error({ error, channelId }, "Failed to get hourly analytics summary");
killedBy: DatabaseOptimizer - Hourly Analytics Summary should format analytics data correctly
statusReason: expected undefined to be truthy

[Killed] BlockStatement
src/database/DatabaseOptimizer.ts:237:21
         totalShares: Number(row.total_shares),
         dataPoints: Number(row.data_points),
       }));
-    } catch (error) {
-      this.logger.error({ error, channelId }, "Failed to get hourly analytics summary");
-      throw error;
-    }
+    } catch (error) {}
   }
 
killedBy: DatabaseOptimizer - Hourly Analytics Summary should log error on query failure
statusReason: promise resolved "undefined" instead of rejecting

[Survived] ObjectLiteral
src/database/DatabaseOptimizer.ts:238:25
         dataPoints: Number(row.data_points),
       }));
     } catch (error) {
-      this.logger.error({ error, channelId }, "Failed to get hourly analytics summary");
+      this.logger.error({}, "Failed to get hourly analytics summary");
       throw error;
     }

[Killed] BlockStatement
src/database/DatabaseOptimizer.ts:251:20
     value: number,
     unit: string,
     metadata?: Record<string, any>
-  ): Promise<void> {
-    try {
-      await this.prisma.$executeRaw`
-        SELECT record_performance_metric(
-          ${metricName},
-          ${value},
-          ${unit},
-          ${JSON.stringify(metadata || {})}::jsonb
-        )
-      `;
-    } catch (error) {
-      this.logger.error({ error, metricName }, "Failed to record performance metric");
-      throw error;
-    }
-  }
+  ): Promise<void> {}
 
   /**
killedBy: DatabaseOptimizer - Performance Metrics should record performance metric
statusReason: expected +0 to be 1 // Object.is equality

[Killed] BlockStatement
src/database/DatabaseOptimizer.ts:252:9
     unit: string,
     metadata?: Record<string, any>
   ): Promise<void> {
-    try {
-      await this.prisma.$executeRaw`
-        SELECT record_performance_metric(
-          ${metricName},
-          ${value},
-          ${unit},
-          ${JSON.stringify(metadata || {})}::jsonb
-        )
-      `;
-    } catch (error) {
+    try {} catch (error) {
       this.logger.error({ error, metricName }, "Failed to record performance metric");
       throw error;
killedBy: DatabaseOptimizer - Performance Metrics should record performance metric
statusReason: expected +0 to be 1 // Object.is equality

[Survived] LogicalOperator
src/database/DatabaseOptimizer.ts:258:28
           ${metricName},
           ${value},
           ${unit},
-          ${JSON.stringify(metadata || {})}::jsonb
+          ${JSON.stringify(metadata && {})}::jsonb
         )
       `;

[Survived] ConditionalExpression
src/database/DatabaseOptimizer.ts:258:28
           ${metricName},
           ${value},
           ${unit},
-          ${JSON.stringify(metadata || {})}::jsonb
+          ${JSON.stringify(true)}::jsonb
         )
       `;

[Killed] BlockStatement
src/database/DatabaseOptimizer.ts:261:21
           ${JSON.stringify(metadata || {})}::jsonb
         )
       `;
-    } catch (error) {
-      this.logger.error({ error, metricName }, "Failed to record performance metric");
-      throw error;
-    }
+    } catch (error) {}
   }
 
killedBy: DatabaseOptimizer - Performance Metrics should handle metric recording errors
statusReason: promise resolved "undefined" instead of rejecting

[Survived] StringLiteral
src/database/DatabaseOptimizer.ts:262:48
         )
       `;
     } catch (error) {
-      this.logger.error({ error, metricName }, "Failed to record performance metric");
+      this.logger.error({ error, metricName }, "");
       throw error;
     }

[Killed] ArrowFunction
src/database/DatabaseOptimizer.ts:308:28
         LEFT JOIN current_metrics c ON b.metric_name = c.metric_name AND c.rn = 1
       `;
 
-      return baselines.map((row: any) => ({
-        metricName: row.metric_name,
-        currentValue: Number(row.current_value),
-        baselineValue: Number(row.baseline_value),
-        improvement: Number(row.improvement),
-        status: this.getPerformanceStatus(Number(row.improvement)),
-      }));
+      return baselines.map(() => undefined);
     } catch (error) {
       this.logger.error({ error }, "Failed to get performance baselines");
killedBy: DatabaseOptimizer - Performance Baselines should format baseline data with status
statusReason: Cannot read properties of undefined (reading 'metricName')

[Killed] BlockStatement
src/database/DatabaseOptimizer.ts:315:21
         improvement: Number(row.improvement),
         status: this.getPerformanceStatus(Number(row.improvement)),
       }));
-    } catch (error) {
-      this.logger.error({ error }, "Failed to get performance baselines");
-      throw error;
-    }
+    } catch (error) {}
   }
 
killedBy: DatabaseOptimizer - Performance Baselines should handle baseline query errors
statusReason: promise resolved "undefined" instead of rejecting

[Survived] StringLiteral
src/database/DatabaseOptimizer.ts:316:36
         status: this.getPerformanceStatus(Number(row.improvement)),
       }));
     } catch (error) {
-      this.logger.error({ error }, "Failed to get performance baselines");
+      this.logger.error({ error }, "");
       throw error;
     }

[Killed] BlockStatement
src/database/DatabaseOptimizer.ts:324:41
   /**
    * Optimize database tables by updating statistics and reindexing if needed
    */
-  async optimizeTables(): Promise<void> {
-    try {
-      this.logger.info("Starting table optimization");
-
-      // Update table statistics
-      await this.prisma.$executeRaw`ANALYZE`;
-
-      // Collect updated connection pool stats
-      await this.prisma.$executeRaw`SELECT collect_connection_pool_stats()`;
-
-      this.logger.info("Table optimization completed");
-    } catch (error) {
-      this.logger.error({ error }, "Failed to optimize tables");
-      throw error;
-    }
-  }
+  async optimizeTables(): Promise<void> {}
 
   /**
killedBy: DatabaseOptimizer - Table Optimization should optimize tables successfully
statusReason: expected +0 to be 2 // Object.is equality

[Killed] BlockStatement
src/database/DatabaseOptimizer.ts:325:9
    * Optimize database tables by updating statistics and reindexing if needed
    */
   async optimizeTables(): Promise<void> {
-    try {
-      this.logger.info("Starting table optimization");
-
-      // Update table statistics
-      await this.prisma.$executeRaw`ANALYZE`;
-
-      // Collect updated connection pool stats
-      await this.prisma.$executeRaw`SELECT collect_connection_pool_stats()`;
-
-      this.logger.info("Table optimization completed");
-    } catch (error) {
+    try {} catch (error) {
       this.logger.error({ error }, "Failed to optimize tables");
       throw error;
killedBy: DatabaseOptimizer - Table Optimization should optimize tables successfully
statusReason: expected +0 to be 2 // Object.is equality

[Survived] StringLiteral
src/database/DatabaseOptimizer.ts:326:24
    */
   async optimizeTables(): Promise<void> {
     try {
-      this.logger.info("Starting table optimization");
+      this.logger.info("");
 
       // Update table statistics

[Survived] StringLiteral
src/database/DatabaseOptimizer.ts:332:36
       await this.prisma.$executeRaw`ANALYZE`;
 
       // Collect updated connection pool stats
-      await this.prisma.$executeRaw`SELECT collect_connection_pool_stats()`;
+      await this.prisma.$executeRaw``;
 
       this.logger.info("Table optimization completed");

[Survived] StringLiteral
src/database/DatabaseOptimizer.ts:334:24
       // Collect updated connection pool stats
       await this.prisma.$executeRaw`SELECT collect_connection_pool_stats()`;
 
-      this.logger.info("Table optimization completed");
+      this.logger.info("");
     } catch (error) {
       this.logger.error({ error }, "Failed to optimize tables");

[Killed] BlockStatement
src/database/DatabaseOptimizer.ts:335:21
       await this.prisma.$executeRaw`SELECT collect_connection_pool_stats()`;
 
       this.logger.info("Table optimization completed");
-    } catch (error) {
-      this.logger.error({ error }, "Failed to optimize tables");
-      throw error;
-    }
+    } catch (error) {}
   }
 
killedBy: DatabaseOptimizer - Table Optimization should handle optimization errors
statusReason: promise resolved "undefined" instead of rejecting

[Killed] StringLiteral
src/database/DatabaseOptimizer.ts:352:6
         idle_connections: number;
         pool_utilization: number;
       }>
-    >`
-      SELECT
-        total_connections,
-        active_connections,
-        idle_connections,
-        pool_utilization
-      FROM connection_pool_stats
-      ORDER BY timestamp DESC
-      LIMIT 1
-    `;
+    >``;
 
     const latest = stats[0];
killedBy: DatabaseOptimizer - Database Health Report should report warning status with high utilization
statusReason: expected 'healthy' to be 'warning' // Object.is equality

[Killed] ObjectLiteral
src/database/DatabaseOptimizer.ts:364:12
     `;
 
     const latest = stats[0];
-    return {
-      total: latest?.total_connections || 0,
-      active: latest?.active_connections || 0,
-      idle: latest?.idle_connections || 0,
-      utilization: Number(latest?.pool_utilization || 0),
-    };
+    return {};
   }
 
killedBy: DatabaseOptimizer - Database Health Report should include connection usage in health report
statusReason: expected 'undefined' to be 'number' // Object.is equality

[Killed] ConditionalExpression
src/database/DatabaseOptimizer.ts:365:14
 
     const latest = stats[0];
     return {
-      total: latest?.total_connections || 0,
+      total: false,
       active: latest?.active_connections || 0,
       idle: latest?.idle_connections || 0,
killedBy: DatabaseOptimizer - Database Health Report should include connection usage in health report
statusReason: expected 'boolean' to be 'number' // Object.is equality

[Killed] ConditionalExpression
src/database/DatabaseOptimizer.ts:365:14
 
     const latest = stats[0];
     return {
-      total: latest?.total_connections || 0,
+      total: true,
       active: latest?.active_connections || 0,
       idle: latest?.idle_connections || 0,
killedBy: DatabaseOptimizer - Database Health Report should include connection usage in health report
statusReason: expected 'boolean' to be 'number' // Object.is equality

[Killed] ConditionalExpression
src/database/DatabaseOptimizer.ts:366:15
     const latest = stats[0];
     return {
       total: latest?.total_connections || 0,
-      active: latest?.active_connections || 0,
+      active: false,
       idle: latest?.idle_connections || 0,
       utilization: Number(latest?.pool_utilization || 0),
killedBy: DatabaseOptimizer - Database Health Report should include connection usage in health report
statusReason: expected 'boolean' to be 'number' // Object.is equality

[Killed] ConditionalExpression
src/database/DatabaseOptimizer.ts:366:15
     const latest = stats[0];
     return {
       total: latest?.total_connections || 0,
-      active: latest?.active_connections || 0,
+      active: true,
       idle: latest?.idle_connections || 0,
       utilization: Number(latest?.pool_utilization || 0),
killedBy: DatabaseOptimizer - Database Health Report should include connection usage in health report
statusReason: expected 'boolean' to be 'number' // Object.is equality

[Killed] ConditionalExpression
src/database/DatabaseOptimizer.ts:367:13
     return {
       total: latest?.total_connections || 0,
       active: latest?.active_connections || 0,
-      idle: latest?.idle_connections || 0,
+      idle: false,
       utilization: Number(latest?.pool_utilization || 0),
     };
killedBy: DatabaseOptimizer - Database Health Report should include connection usage in health report
statusReason: expected 'boolean' to be 'number' // Object.is equality

[Killed] ConditionalExpression
src/database/DatabaseOptimizer.ts:367:13
     return {
       total: latest?.total_connections || 0,
       active: latest?.active_connections || 0,
-      idle: latest?.idle_connections || 0,
+      idle: true,
       utilization: Number(latest?.pool_utilization || 0),
     };
killedBy: DatabaseOptimizer - Database Health Report should include connection usage in health report
statusReason: expected 'boolean' to be 'number' // Object.is equality

[Killed] ConditionalExpression
src/database/DatabaseOptimizer.ts:368:27
       total: latest?.total_connections || 0,
       active: latest?.active_connections || 0,
       idle: latest?.idle_connections || 0,
-      utilization: Number(latest?.pool_utilization || 0),
+      utilization: Number(true),
     };
   }
killedBy: DatabaseOptimizer - Database Health Report should report warning status with high utilization
statusReason: expected 'healthy' to be 'warning' // Object.is equality

[Killed] LogicalOperator
src/database/DatabaseOptimizer.ts:368:27
       total: latest?.total_connections || 0,
       active: latest?.active_connections || 0,
       idle: latest?.idle_connections || 0,
-      utilization: Number(latest?.pool_utilization || 0),
+      utilization: Number(latest?.pool_utilization && 0),
     };
   }
killedBy: DatabaseOptimizer - Database Health Report should report warning status with high utilization
statusReason: expected 'healthy' to be 'warning' // Object.is equality

[Killed] ArrowFunction
src/database/DatabaseOptimizer.ts:395:24
       LIMIT 10
     `;
 
-    return metrics.map((row: any) => ({
-      queryType: row.query.replace(/\s+/g, " ").trim(),
-      averageExecutionTime: Number(row.mean_exec_time),
-      maxExecutionTime: Number(row.max_exec_time),
-      totalCalls: Number(row.calls),
-    }));
+    return metrics.map(() => undefined);
   }
 
killedBy: DatabaseOptimizer - Database Health Report should generate comprehensive health report
statusReason: Cannot read properties of undefined (reading 'averageExecutionTime')

[Survived] MethodExpression
src/database/DatabaseOptimizer.ts:396:18
     `;
 
     return metrics.map((row: any) => ({
-      queryType: row.query.replace(/\s+/g, " ").trim(),
+      queryType: row.query.replace(/\s+/g, " "),
       averageExecutionTime: Number(row.mean_exec_time),
       maxExecutionTime: Number(row.max_exec_time),
