[Killed] BlockStatement
src/providers/providerConstraintValidator.ts:210:54
   async suggestAdaptations(
     content: CanonicalPost,
     provider: ProviderAdapter
-  ): Promise<ContentValidationResult["adaptations"]> {
-    const validation = await this.validateContent(content, provider);
-    return this.generateAdaptations(content, provider, validation.errors);
-  }
+  ): Promise<ContentValidationResult["adaptations"]> {}
 
   // Private methods
killedBy: Provider Constraint Validator - Adaptation Suggestions should provide adaptations for content requiring changes
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] BlockStatement
src/providers/providerConstraintValidator.ts:223:40
       name: "basic_validation",
       description: "Basic provider constraint validation",
       severity: "error",
-      validate: (content, provider) => {
-        const textLength = content.body?.length || 0;
-        const mediaCount = content.media?.length || 0;
-
-        // Use centralized validation
-        const validation = validateContentForProvider(provider.id, content.body || "", mediaCount);
-
-        if (!validation.valid) {
-          return {
-            valid: false,
-            message: validation.errors.join("; "),
-            suggestion: validation.warnings.join("; ") || "Check content constraints",
-            field: textLength > provider.limits.maxChars ? "text" : "media",
-          };
-        }
-
-        return { valid: true };
-      },
+      validate: (content, provider) => {},
     });
 
killedBy: Provider Constraint Validator - Initialization & Basic Validation should pass validation for short valid content
statusReason: expected false to be true // Object.is equality

[Killed] LogicalOperator
src/providers/providerConstraintValidator.ts:224:28
       description: "Basic provider constraint validation",
       severity: "error",
       validate: (content, provider) => {
-        const textLength = content.body?.length || 0;
+        const textLength = content.body?.length && 0;
         const mediaCount = content.media?.length || 0;
 
killedBy: Provider Constraint Validator - Adaptation Suggestions should provide adaptations for content requiring changes
statusReason: expected false to be truthy

[Killed] ConditionalExpression
src/providers/providerConstraintValidator.ts:224:28
       description: "Basic provider constraint validation",
       severity: "error",
       validate: (content, provider) => {
-        const textLength = content.body?.length || 0;
+        const textLength = true;
         const mediaCount = content.media?.length || 0;
 
killedBy: Provider Constraint Validator - Adaptation Suggestions should provide adaptations for content requiring changes
statusReason: expected false to be truthy

[Killed] ConditionalExpression
src/providers/providerConstraintValidator.ts:225:28
       severity: "error",
       validate: (content, provider) => {
         const textLength = content.body?.length || 0;
-        const mediaCount = content.media?.length || 0;
+        const mediaCount = true;
 
         // Use centralized validation
killedBy: Provider Constraint Validator - Media Validation should fail validation for excessive media count
statusReason: expected true to be false // Object.is equality

[Killed] LogicalOperator
src/providers/providerConstraintValidator.ts:225:28
       severity: "error",
       validate: (content, provider) => {
         const textLength = content.body?.length || 0;
-        const mediaCount = content.media?.length || 0;
+        const mediaCount = content.media?.length && 0;
 
         // Use centralized validation
killedBy: Provider Constraint Validator - Media Validation should fail validation for excessive media count
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/providers/providerConstraintValidator.ts:228:68
         const mediaCount = content.media?.length || 0;
 
         // Use centralized validation
-        const validation = validateContentForProvider(provider.id, content.body || "", mediaCount);
+        const validation = validateContentForProvider(provider.id, true, mediaCount);
 
         if (!validation.valid) {
killedBy: Provider Constraint Validator - Character Limit Validation should fail validation for content exceeding character limit
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/providers/providerConstraintValidator.ts:228:68
         const mediaCount = content.media?.length || 0;
 
         // Use centralized validation
-        const validation = validateContentForProvider(provider.id, content.body || "", mediaCount);
+        const validation = validateContentForProvider(provider.id, false, mediaCount);
 
         if (!validation.valid) {
killedBy: Provider Constraint Validator - Character Limit Validation should fail validation for content exceeding character limit
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/providers/providerConstraintValidator.ts:230:32
         // Use centralized validation
         const validation = validateContentForProvider(provider.id, content.body || "", mediaCount);
 
-        if (!validation.valid) {
-          return {
-            valid: false,
-            message: validation.errors.join("; "),
-            suggestion: validation.warnings.join("; ") || "Check content constraints",
-            field: textLength > provider.limits.maxChars ? "text" : "media",
-          };
-        }
+        if (!validation.valid) {}
 
         return { valid: true };
killedBy: Provider Constraint Validator - Character Limit Validation should fail validation for content exceeding character limit
statusReason: expected true to be false // Object.is equality

[Killed] LogicalOperator
src/providers/providerConstraintValidator.ts:234:25
           return {
             valid: false,
             message: validation.errors.join("; "),
-            suggestion: validation.warnings.join("; ") || "Check content constraints",
+            suggestion: validation.warnings.join("; ") && "Check content constraints",
             field: textLength > provider.limits.maxChars ? "text" : "media",
           };
killedBy: Provider Constraint Validator - Character Limit Validation should provide suggestions for character limit violation
statusReason: expected false to be truthy

[Killed] ConditionalExpression
src/providers/providerConstraintValidator.ts:234:25
           return {
             valid: false,
             message: validation.errors.join("; "),
-            suggestion: validation.warnings.join("; ") || "Check content constraints",
+            suggestion: false,
             field: textLength > provider.limits.maxChars ? "text" : "media",
           };
killedBy: Provider Constraint Validator - Character Limit Validation should provide suggestions for character limit violation
statusReason: expected false to be truthy

[Killed] ConditionalExpression
src/providers/providerConstraintValidator.ts:235:20
             valid: false,
             message: validation.errors.join("; "),
             suggestion: validation.warnings.join("; ") || "Check content constraints",
-            field: textLength > provider.limits.maxChars ? "text" : "media",
+            field: false ? "text" : "media",
           };
         }
killedBy: Provider Constraint Validator - Adaptation Suggestions should provide adaptations for content requiring changes
statusReason: expected false to be truthy

[Killed] EqualityOperator
src/providers/providerConstraintValidator.ts:235:20
             valid: false,
             message: validation.errors.join("; "),
             suggestion: validation.warnings.join("; ") || "Check content constraints",
-            field: textLength > provider.limits.maxChars ? "text" : "media",
+            field: textLength <= provider.limits.maxChars ? "text" : "media",
           };
         }
killedBy: Provider Constraint Validator - Adaptation Suggestions should provide adaptations for content requiring changes
statusReason: expected false to be truthy

[Survived] StringLiteral
src/providers/providerConstraintValidator.ts:245:13
 
     // Media type validation
     this.registerRule({
-      name: "media_type",
+      name: "",
       description: "Unsupported media type",
       severity: "error",

[Killed] BlockStatement
src/providers/providerConstraintValidator.ts:248:40
       name: "media_type",
       description: "Unsupported media type",
       severity: "error",
-      validate: (content, provider) => {
-        if (!content.media?.length) return { valid: true };
-
-        const allowedTypes = provider.limits.allowedMedia;
-        const unsupportedMedia = content.media.filter(
-          (media) => !allowedTypes.includes(media.type)
-        );
-
-        if (unsupportedMedia.length > 0) {
-          const types = unsupportedMedia.map((m) => m.type).join(", ");
-          return {
-            valid: false,
-            message: `Unsupported media types: ${types}`,
-            suggestion: `Convert media to supported formats: ${allowedTypes.join(", ")}`,
-            field: "media",
-          };
-        }
-
-        return { valid: true };
-      },
+      validate: (content, provider) => {},
     });
 
killedBy: Provider Constraint Validator - Initialization & Basic Validation should pass validation for short valid content
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/providers/providerConstraintValidator.ts:249:13
       description: "Unsupported media type",
       severity: "error",
       validate: (content, provider) => {
-        if (!content.media?.length) return { valid: true };
+        if (content.media?.length) return { valid: true };
 
         const allowedTypes = provider.limits.allowedMedia;
killedBy: Provider Constraint Validator - Media Validation should fail validation for unsupported media type
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/providers/providerConstraintValidator.ts:249:13
       description: "Unsupported media type",
       severity: "error",
       validate: (content, provider) => {
-        if (!content.media?.length) return { valid: true };
+        if (true) return { valid: true };
 
         const allowedTypes = provider.limits.allowedMedia;
killedBy: Provider Constraint Validator - Media Validation should fail validation for unsupported media type
statusReason: expected true to be false // Object.is equality

[Killed] MethodExpression
src/providers/providerConstraintValidator.ts:252:34
         if (!content.media?.length) return { valid: true };
 
         const allowedTypes = provider.limits.allowedMedia;
-        const unsupportedMedia = content.media.filter(
-          (media) => !allowedTypes.includes(media.type)
-        );
+        const unsupportedMedia = content.media;
 
         if (unsupportedMedia.length > 0) {
killedBy: Provider Constraint Validator - Media Validation should pass validation for content with valid media count
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/providers/providerConstraintValidator.ts:253:22
 
         const allowedTypes = provider.limits.allowedMedia;
         const unsupportedMedia = content.media.filter(
-          (media) => !allowedTypes.includes(media.type)
+          (media) => allowedTypes.includes(media.type)
         );
 
killedBy: Provider Constraint Validator - Media Validation should pass validation for content with valid media count
statusReason: expected false to be true // Object.is equality

[Killed] ArrowFunction
src/providers/providerConstraintValidator.ts:253:11
 
         const allowedTypes = provider.limits.allowedMedia;
         const unsupportedMedia = content.media.filter(
-          (media) => !allowedTypes.includes(media.type)
+          () => undefined
         );
 
killedBy: Provider Constraint Validator - Media Validation should fail validation for unsupported media type
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
src/providers/providerConstraintValidator.ts:256:13
           (media) => !allowedTypes.includes(media.type)
         );
 
-        if (unsupportedMedia.length > 0) {
+        if (unsupportedMedia.length >= 0) {
           const types = unsupportedMedia.map((m) => m.type).join(", ");
           return {
killedBy: Provider Constraint Validator - Media Validation should pass validation for content with valid media count
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/providers/providerConstraintValidator.ts:256:13
           (media) => !allowedTypes.includes(media.type)
         );
 
-        if (unsupportedMedia.length > 0) {
+        if (unsupportedMedia.length <= 0) {
           const types = unsupportedMedia.map((m) => m.type).join(", ");
           return {
killedBy: Provider Constraint Validator - Media Validation should pass validation for content with valid media count
statusReason: expected false to be true // Object.is equality

[Survived] ArrowFunction
src/providers/providerConstraintValidator.ts:257:46
         );
 
         if (unsupportedMedia.length > 0) {
-          const types = unsupportedMedia.map((m) => m.type).join(", ");
+          const types = unsupportedMedia.map(() => undefined).join(", ");
           return {
             valid: false,

[Survived] ObjectLiteral
src/providers/providerConstraintValidator.ts:258:18
 
         if (unsupportedMedia.length > 0) {
           const types = unsupportedMedia.map((m) => m.type).join(", ");
-          return {
-            valid: false,
-            message: `Unsupported media types: ${types}`,
-            suggestion: `Convert media to supported formats: ${allowedTypes.join(", ")}`,
-            field: "media",
-          };
+          return {};
         }
 

[Survived] StringLiteral
src/providers/providerConstraintValidator.ts:261:82
           return {
             valid: false,
             message: `Unsupported media types: ${types}`,
-            suggestion: `Convert media to supported formats: ${allowedTypes.join(", ")}`,
+            suggestion: `Convert media to supported formats: ${allowedTypes.join("")}`,
             field: "media",
           };

[Killed] BlockStatement
src/providers/providerConstraintValidator.ts:275:40
       name: "media_size",
       description: "Media file too large",
       severity: "warning",
-      validate: (content, provider) => {
-        if (!content.media?.length) return { valid: true };
-
-        const _maxImageSize = provider.limits.maxImageSize;
-        const _maxVideoSize = provider.limits.maxVideoSize;
-
-        for (const _media of content.media) {
-          // Note: Media type doesn't have metadata.size, this would need to be implemented
-          // For now, skip size validation
-          continue;
-        }
-
-        return { valid: true };
-      },
+      validate: (content, provider) => {},
     });
 
killedBy: Provider Constraint Validator - Initialization & Basic Validation should pass validation for short valid content
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/providers/providerConstraintValidator.ts:276:53
       description: "Media file too large",
       severity: "warning",
       validate: (content, provider) => {
-        if (!content.media?.length) return { valid: true };
+        if (!content.media?.length) return { valid: false };
 
         const _maxImageSize = provider.limits.maxImageSize;
killedBy: Provider Constraint Validator - Initialization & Basic Validation should pass validation for short valid content
statusReason: expected 1 to be +0 // Object.is equality

[Survived] BlockStatement
src/providers/providerConstraintValidator.ts:281:45
         const _maxImageSize = provider.limits.maxImageSize;
         const _maxVideoSize = provider.limits.maxVideoSize;
 
-        for (const _media of content.media) {
-          // Note: Media type doesn't have metadata.size, this would need to be implemented
-          // For now, skip size validation
-          continue;
-        }
+        for (const _media of content.media) {}
 
         return { valid: true };

[Survived] StringLiteral
src/providers/providerConstraintValidator.ts:293:13
 
     // Video duration validation
     this.registerRule({
-      name: "video_duration",
+      name: "",
       description: "Video too long",
       severity: "warning",

[Killed] BlockStatement
src/providers/providerConstraintValidator.ts:296:40
       name: "video_duration",
       description: "Video too long",
       severity: "warning",
-      validate: (content, provider) => {
-        if (!content.media?.length) return { valid: true };
-
-        const maxDuration = provider.limits.maxVideoDuration;
-        if (!maxDuration) return { valid: true };
-
-        const videos = content.media.filter((m) => m.type === "video");
-        for (const video of videos) {
-          const duration = video.durationMs ? video.durationMs / 1000 : null;
-          if (duration && duration > maxDuration) {
-            return {
-              valid: false,
-              message: `Video is ${duration}s long, limit is ${maxDuration}s`,
-              suggestion: `Trim video to ${maxDuration} seconds or less`,
-              field: "media",
-            };
-          }
-        }
-
-        return { valid: true };
-      },
+      validate: (content, provider) => {},
     });
 
killedBy: Provider Constraint Validator - Initialization & Basic Validation should pass validation for short valid content
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/providers/providerConstraintValidator.ts:300:13
         if (!content.media?.length) return { valid: true };
 
         const maxDuration = provider.limits.maxVideoDuration;
-        if (!maxDuration) return { valid: true };
+        if (true) return { valid: true };
 
         const videos = content.media.filter((m) => m.type === "video");
killedBy: Provider Constraint Validator - Media Validation should warn about video duration exceeding limit
statusReason: expected false to be truthy

[Killed] BooleanLiteral
src/providers/providerConstraintValidator.ts:300:13
         if (!content.media?.length) return { valid: true };
 
         const maxDuration = provider.limits.maxVideoDuration;
-        if (!maxDuration) return { valid: true };
+        if (maxDuration) return { valid: true };
 
         const videos = content.media.filter((m) => m.type === "video");
killedBy: Provider Constraint Validator - Media Validation should warn about video duration exceeding limit
statusReason: expected false to be truthy

[Killed] ConditionalExpression
src/providers/providerConstraintValidator.ts:302:52
         const maxDuration = provider.limits.maxVideoDuration;
         if (!maxDuration) return { valid: true };
 
-        const videos = content.media.filter((m) => m.type === "video");
+        const videos = content.media.filter((m) => false);
         for (const video of videos) {
           const duration = video.durationMs ? video.durationMs / 1000 : null;
killedBy: Provider Constraint Validator - Media Validation should warn about video duration exceeding limit
statusReason: expected false to be truthy

[Killed] ArrowFunction
src/providers/providerConstraintValidator.ts:302:45
         const maxDuration = provider.limits.maxVideoDuration;
         if (!maxDuration) return { valid: true };
 
-        const videos = content.media.filter((m) => m.type === "video");
+        const videos = content.media.filter(() => undefined);
         for (const video of videos) {
           const duration = video.durationMs ? video.durationMs / 1000 : null;
killedBy: Provider Constraint Validator - Media Validation should warn about video duration exceeding limit
statusReason: expected false to be truthy

[Killed] BlockStatement
src/providers/providerConstraintValidator.ts:303:37
         if (!maxDuration) return { valid: true };
 
         const videos = content.media.filter((m) => m.type === "video");
-        for (const video of videos) {
-          const duration = video.durationMs ? video.durationMs / 1000 : null;
-          if (duration && duration > maxDuration) {
-            return {
-              valid: false,
-              message: `Video is ${duration}s long, limit is ${maxDuration}s`,
-              suggestion: `Trim video to ${maxDuration} seconds or less`,
-              field: "media",
-            };
-          }
-        }
+        for (const video of videos) {}
 
         return { valid: true };
killedBy: Provider Constraint Validator - Media Validation should warn about video duration exceeding limit
statusReason: expected false to be truthy

[Survived] ArithmeticOperator
src/providers/providerConstraintValidator.ts:304:47
 
         const videos = content.media.filter((m) => m.type === "video");
         for (const video of videos) {
-          const duration = video.durationMs ? video.durationMs / 1000 : null;
+          const duration = video.durationMs ? video.durationMs * 1000 : null;
           if (duration && duration > maxDuration) {
             return {

[Killed] EqualityOperator
src/providers/providerConstraintValidator.ts:305:27
         const videos = content.media.filter((m) => m.type === "video");
         for (const video of videos) {
           const duration = video.durationMs ? video.durationMs / 1000 : null;
-          if (duration && duration > maxDuration) {
+          if (duration && duration <= maxDuration) {
             return {
               valid: false,
killedBy: Provider Constraint Validator - Media Validation should warn about video duration exceeding limit
statusReason: expected false to be truthy

[Killed] BlockStatement
src/providers/providerConstraintValidator.ts:305:51
         const videos = content.media.filter((m) => m.type === "video");
         for (const video of videos) {
           const duration = video.durationMs ? video.durationMs / 1000 : null;
-          if (duration && duration > maxDuration) {
-            return {
-              valid: false,
-              message: `Video is ${duration}s long, limit is ${maxDuration}s`,
-              suggestion: `Trim video to ${maxDuration} seconds or less`,
-              field: "media",
-            };
-          }
+          if (duration && duration > maxDuration) {}
         }
 
killedBy: Provider Constraint Validator - Media Validation should warn about video duration exceeding limit
statusReason: expected false to be truthy

[Survived] StringLiteral
src/providers/providerConstraintValidator.ts:308:24
           if (duration && duration > maxDuration) {
             return {
               valid: false,
-              message: `Video is ${duration}s long, limit is ${maxDuration}s`,
+              message: ``,
               suggestion: `Trim video to ${maxDuration} seconds or less`,
               field: "media",

[Survived] StringLiteral
src/providers/providerConstraintValidator.ts:321:13
 
     // Hashtag validation
     this.registerRule({
-      name: "hashtag_limit",
+      name: "",
       description: "Too many hashtags",
       severity: "warning",

[Survived] StringLiteral
src/providers/providerConstraintValidator.ts:323:17
     this.registerRule({
       name: "hashtag_limit",
       description: "Too many hashtags",
-      severity: "warning",
+      severity: "",
       validate: (content, provider) => {
         const text = content.body || "";

[Killed] BlockStatement
src/providers/providerConstraintValidator.ts:324:40
       name: "hashtag_limit",
       description: "Too many hashtags",
       severity: "warning",
-      validate: (content, provider) => {
-        const text = content.body || "";
-        const hashtags = text.match(/#\w+/g) || [];
-        const limit = provider.limits.maxHashtags;
-
-        if (limit && hashtags.length > limit) {
-          return {
-            valid: false,
-            message: `${hashtags.length} hashtags found, limit is ${limit}`,
-            suggestion: `Remove ${hashtags.length - limit} hashtags`,
-            field: "text",
-          };
-        }
-
-        return { valid: true };
-      },
+      validate: (content, provider) => {},
     });
 
killedBy: Provider Constraint Validator - Initialization & Basic Validation should pass validation for short valid content
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/providers/providerConstraintValidator.ts:325:22
       description: "Too many hashtags",
       severity: "warning",
       validate: (content, provider) => {
-        const text = content.body || "";
+        const text = false;
         const hashtags = text.match(/#\w+/g) || [];
         const limit = provider.limits.maxHashtags;
killedBy: Provider Constraint Validator - Initialization & Basic Validation should pass validation for short valid content
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/providers/providerConstraintValidator.ts:325:22
       description: "Too many hashtags",
       severity: "warning",
       validate: (content, provider) => {
-        const text = content.body || "";
+        const text = true;
         const hashtags = text.match(/#\w+/g) || [];
         const limit = provider.limits.maxHashtags;
killedBy: Provider Constraint Validator - Initialization & Basic Validation should pass validation for short valid content
statusReason: expected false to be true // Object.is equality

[Survived] ConditionalExpression
src/providers/providerConstraintValidator.ts:326:26
       severity: "warning",
       validate: (content, provider) => {
         const text = content.body || "";
-        const hashtags = text.match(/#\w+/g) || [];
+        const hashtags = false;
         const limit = provider.limits.maxHashtags;
 

[Survived] ConditionalExpression
src/providers/providerConstraintValidator.ts:326:26
       severity: "warning",
       validate: (content, provider) => {
         const text = content.body || "";
-        const hashtags = text.match(/#\w+/g) || [];
+        const hashtags = true;
         const limit = provider.limits.maxHashtags;
 

[Killed] ConditionalExpression
src/providers/providerConstraintValidator.ts:329:13
         const hashtags = text.match(/#\w+/g) || [];
         const limit = provider.limits.maxHashtags;
 
-        if (limit && hashtags.length > limit) {
+        if (true) {
           return {
             valid: false,
killedBy: Provider Constraint Validator - Initialization & Basic Validation should pass validation for short valid content
statusReason: expected 1 to be +0 // Object.is equality

[NoCoverage] ConditionalExpression
src/providers/providerConstraintValidator.ts:329:22
         const hashtags = text.match(/#\w+/g) || [];
         const limit = provider.limits.maxHashtags;
 
-        if (limit && hashtags.length > limit) {
+        if (limit && true) {
           return {
             valid: false,

[NoCoverage] ArithmeticOperator
src/providers/providerConstraintValidator.ts:333:35
           return {
             valid: false,
             message: `${hashtags.length} hashtags found, limit is ${limit}`,
-            suggestion: `Remove ${hashtags.length - limit} hashtags`,
+            suggestion: `Remove ${hashtags.length + limit} hashtags`,
             field: "text",
           };

[NoCoverage] StringLiteral
src/providers/providerConstraintValidator.ts:333:25
           return {
             valid: false,
             message: `${hashtags.length} hashtags found, limit is ${limit}`,
-            suggestion: `Remove ${hashtags.length - limit} hashtags`,
+            suggestion: ``,
             field: "text",
           };

[NoCoverage] StringLiteral
src/providers/providerConstraintValidator.ts:334:20
             valid: false,
             message: `${hashtags.length} hashtags found, limit is ${limit}`,
             suggestion: `Remove ${hashtags.length - limit} hashtags`,
-            field: "text",
+            field: "",
           };
         }

[Survived] StringLiteral
src/providers/providerConstraintValidator.ts:345:20
     // Threading capability validation
     this.registerRule({
       name: "threading_required",
-      description: "Content requires threading but provider does not support it",
+      description: "",
       severity: "error",
       validate: (content, provider) => {

[Survived] StringLiteral
src/providers/providerConstraintValidator.ts:346:17
     this.registerRule({
       name: "threading_required",
       description: "Content requires threading but provider does not support it",
-      severity: "error",
+      severity: "",
       validate: (content, provider) => {
         const textLength = content.body?.length || 0;
