[Killed] BlockStatement
src/providers/providerRegistry.ts:33:17
 class ProviderRegistryService {
   private adapters: Map<string, ProviderAdapter> = new Map();
 
-  constructor() {
-    this.registerBuiltInAdapters();
-  }
+  constructor() {}
 
   /**
killedBy: contentRoutes Unit Tests should transform content for a single provider
statusReason: expected 400 to be 200 // Object.is equality

[Killed] BlockStatement
src/providers/providerRegistry.ts:44:37
    *
    * Now uses class-based adapters (singleton instances)
    */
-  private registerBuiltInAdapters() {
-    // Register all provider adapters (class-based singletons)
-    this.adapters.set("x", xAdapter);
-    this.adapters.set("instagram", instagramAdapter);
-    this.adapters.set("facebook", facebookAdapter);
-    this.adapters.set("tiktok", tiktokAdapter);
-    this.adapters.set("youtube", youtubeAdapter);
-    this.adapters.set("snapchat", snapchatAdapter);
-    this.adapters.set("telegram", telegramAdapter);
-    this.adapters.set("pinterest", pinterestAdapter);
-    this.adapters.set("linkedin", linkedInAdapter);
-  }
+  private registerBuiltInAdapters() {}
 
   /**
killedBy: contentRoutes Unit Tests should transform content for a single provider
statusReason: expected 400 to be 200 // Object.is equality

[Killed] StringLiteral
src/providers/providerRegistry.ts:46:23
    */
   private registerBuiltInAdapters() {
     // Register all provider adapters (class-based singletons)
-    this.adapters.set("x", xAdapter);
+    this.adapters.set("", xAdapter);
     this.adapters.set("instagram", instagramAdapter);
     this.adapters.set("facebook", facebookAdapter);
killedBy: contentRoutes Unit Tests should transform content for a single provider
statusReason: expected 400 to be 200 // Object.is equality

[Killed] StringLiteral
src/providers/providerRegistry.ts:48:23
     // Register all provider adapters (class-based singletons)
     this.adapters.set("x", xAdapter);
     this.adapters.set("instagram", instagramAdapter);
-    this.adapters.set("facebook", facebookAdapter);
+    this.adapters.set("", facebookAdapter);
     this.adapters.set("tiktok", tiktokAdapter);
     this.adapters.set("youtube", youtubeAdapter);
killedBy: PlatformContentAdapter - Facebook, YouTube, TikTok, Multi Facebook Adaptation should handle longer content for Facebook
statusReason: expected false to be true // Object.is equality

[Killed] StringLiteral
src/providers/providerRegistry.ts:49:23
     this.adapters.set("x", xAdapter);
     this.adapters.set("instagram", instagramAdapter);
     this.adapters.set("facebook", facebookAdapter);
-    this.adapters.set("tiktok", tiktokAdapter);
+    this.adapters.set("", tiktokAdapter);
     this.adapters.set("youtube", youtubeAdapter);
     this.adapters.set("snapchat", snapchatAdapter);
killedBy: PlatformContentAdapter - Facebook, YouTube, TikTok, Multi TikTok Adaptation should handle vertical video for TikTok
statusReason: expected false to be true // Object.is equality

[Survived] StringLiteral
src/providers/providerRegistry.ts:52:23
     this.adapters.set("tiktok", tiktokAdapter);
     this.adapters.set("youtube", youtubeAdapter);
     this.adapters.set("snapchat", snapchatAdapter);
-    this.adapters.set("telegram", telegramAdapter);
+    this.adapters.set("", telegramAdapter);
     this.adapters.set("pinterest", pinterestAdapter);
     this.adapters.set("linkedin", linkedInAdapter);

[Survived] StringLiteral
src/providers/providerRegistry.ts:53:23
     this.adapters.set("youtube", youtubeAdapter);
     this.adapters.set("snapchat", snapchatAdapter);
     this.adapters.set("telegram", telegramAdapter);
-    this.adapters.set("pinterest", pinterestAdapter);
+    this.adapters.set("", pinterestAdapter);
     this.adapters.set("linkedin", linkedInAdapter);
   }

[Survived] StringLiteral
src/providers/providerRegistry.ts:54:23
     this.adapters.set("snapchat", snapchatAdapter);
     this.adapters.set("telegram", telegramAdapter);
     this.adapters.set("pinterest", pinterestAdapter);
-    this.adapters.set("linkedin", linkedInAdapter);
+    this.adapters.set("", linkedInAdapter);
   }
 

[NoCoverage] BlockStatement
src/providers/providerRegistry.ts:64:75
    * Note: For built-in providers, metadata is already in PROVIDER_CONFIGS.
    * This method is mainly for custom/plugin providers.
    */
-  registerProvider(metadata: ProviderMetadata, adapter?: ProviderAdapter) {
-    // Custom providers would need to be added to PROVIDER_CONFIGS externally
-    // or we need a separate custom providers map
-    providerLogger.warn(
-      "registerProvider is deprecated for built-in providers. Use registerAdapter instead."
-    );
-    if (adapter) {
-      this.adapters.set(metadata.id, adapter);
-    }
-  }
+  registerProvider(metadata: ProviderMetadata, adapter?: ProviderAdapter) {}
 
   /**

[NoCoverage] BlockStatement
src/providers/providerRegistry.ts:70:18
     providerLogger.warn(
       "registerProvider is deprecated for built-in providers. Use registerAdapter instead."
     );
-    if (adapter) {
-      this.adapters.set(metadata.id, adapter);
-    }
+    if (adapter) {}
   }
 

[NoCoverage] ConditionalExpression
src/providers/providerRegistry.ts:70:9
     providerLogger.warn(
       "registerProvider is deprecated for built-in providers. Use registerAdapter instead."
     );
-    if (adapter) {
+    if (false) {
       this.adapters.set(metadata.id, adapter);
     }

[Killed] BlockStatement
src/providers/providerRegistry.ts:79:65
    * Register an adapter for an existing provider in PROVIDER_CONFIGS.
    * This is the preferred method for adding adapter implementations.
    */
-  registerAdapter(providerId: string, adapter: ProviderAdapter) {
-    const metadata = getProviderConfig(providerId);
-    if (!metadata) {
-      throw new Error(
-        `Cannot register adapter for unknown provider: ${providerId}. ` +
-          `Provider must exist in PROVIDER_CONFIGS first.`
-      );
-    }
-    this.adapters.set(providerId, adapter);
-  }
+  registerAdapter(providerId: string, adapter: ProviderAdapter) {}
 
   /**
killedBy: Provider Registry - Adapter Management should register new adapter for existing provider
statusReason: expected XAdapter{ id: 'x', …(5) } to be MockProviderAdapter{} // Object.is equality

[Killed] ConditionalExpression
src/providers/providerRegistry.ts:81:9
    */
   registerAdapter(providerId: string, adapter: ProviderAdapter) {
     const metadata = getProviderConfig(providerId);
-    if (!metadata) {
+    if (true) {
       throw new Error(
         `Cannot register adapter for unknown provider: ${providerId}. ` +
killedBy: Provider Registry - Adapter Management should register new adapter for existing provider
statusReason: Cannot register adapter for unknown provider: x. Provider must exist in PROVIDER_CONFIGS first.

[Killed] ConditionalExpression
src/providers/providerRegistry.ts:81:9
    */
   registerAdapter(providerId: string, adapter: ProviderAdapter) {
     const metadata = getProviderConfig(providerId);
-    if (!metadata) {
+    if (false) {
       throw new Error(
         `Cannot register adapter for unknown provider: ${providerId}. ` +
killedBy: Provider Registry - Adapter Management should throw error when registering adapter for unknown provider
statusReason: expected [Function] to throw an error

[Killed] StringLiteral
src/providers/providerRegistry.ts:83:9
     const metadata = getProviderConfig(providerId);
     if (!metadata) {
       throw new Error(
-        `Cannot register adapter for unknown provider: ${providerId}. ` +
+        `` +
           `Provider must exist in PROVIDER_CONFIGS first.`
       );
killedBy: Provider Registry - Adapter Management should throw error when registering adapter for unknown provider
statusReason: expected [Function] to throw error matching /unknown provider/i but got 'Provider must exist in PROVIDER_CONFI…'

[Killed] BlockStatement
src/providers/providerRegistry.ts:93:57
   /**
    * Get provider metadata from the centralized configuration.
    */
-  getProvider(id: string): ProviderMetadata | undefined {
-    return getProviderConfig(id);
-  }
+  getProvider(id: string): ProviderMetadata | undefined {}
 
   /**
killedBy: Provider Registry - Initialization & Built-in Providers should get specific provider by ID
statusReason: expected false to be truthy

[Killed] BlockStatement
src/providers/providerRegistry.ts:100:55
   /**
    * Get provider adapter implementation.
    */
-  getAdapter(id: string): ProviderAdapter | undefined {
-    return this.adapters.get(id);
-  }
+  getAdapter(id: string): ProviderAdapter | undefined {}
 
   /**
killedBy: Provider Registry - Adapter Management should get adapter for registered provider
statusReason: expected false to be truthy

[Killed] BlockStatement
src/providers/providerRegistry.ts:107:41
   /**
    * Get all providers from the centralized configuration.
    */
-  getAllProviders(): ProviderMetadata[] {
-    return Object.values(PROVIDER_CONFIGS);
-  }
+  getAllProviders(): ProviderMetadata[] {}
 
   /**
killedBy: Provider Registry - Initialization & Built-in Providers should initialize with built-in providers
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] BlockStatement
src/providers/providerRegistry.ts:114:44
   /**
    * Get only active providers (status: "active").
    */
-  getActiveProviders(): ProviderMetadata[] {
-    return this.getAllProviders().filter((p) => p.status === "active");
-  }
+  getActiveProviders(): ProviderMetadata[] {}
 
   /**
killedBy: Provider Registry - Filtering & Queries should get only active providers
statusReason: Cannot read properties of undefined (reading 'every')

[Killed] ArrowFunction
src/providers/providerRegistry.ts:115:42
    * Get only active providers (status: "active").
    */
   getActiveProviders(): ProviderMetadata[] {
-    return this.getAllProviders().filter((p) => p.status === "active");
+    return this.getAllProviders().filter(() => undefined);
   }
 
killedBy: Provider Registry - Filtering & Queries should get only active providers
statusReason: expected false to be truthy

[Killed] EqualityOperator
src/providers/providerRegistry.ts:115:49
    * Get only active providers (status: "active").
    */
   getActiveProviders(): ProviderMetadata[] {
-    return this.getAllProviders().filter((p) => p.status === "active");
+    return this.getAllProviders().filter((p) => p.status !== "active");
   }
 
killedBy: Provider Registry - Filtering & Queries should get only active providers
statusReason: expected false to be truthy

[Killed] BlockStatement
src/providers/providerRegistry.ts:121:88
   /**
    * Get providers that have a specific capability enabled.
    */
-  getProvidersByCapability(capability: keyof ProviderCapabilities): ProviderMetadata[] {
-    return this.getAllProviders().filter((p) => p.capabilities[capability]);
-  }
+  getProvidersByCapability(capability: keyof ProviderCapabilities): ProviderMetadata[] {}
 
   /**
killedBy: ProviderService - Get Providers by Capability should return providers with threading capability
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] MethodExpression
src/providers/providerRegistry.ts:122:12
    * Get providers that have a specific capability enabled.
    */
   getProvidersByCapability(capability: keyof ProviderCapabilities): ProviderMetadata[] {
-    return this.getAllProviders().filter((p) => p.capabilities[capability]);
+    return this.getAllProviders();
   }
 
killedBy: Provider Registry - Filtering & Queries should filter providers by threading capability
statusReason: expected false to be truthy

[Killed] ArrowFunction
src/providers/providerRegistry.ts:122:42
    * Get providers that have a specific capability enabled.
    */
   getProvidersByCapability(capability: keyof ProviderCapabilities): ProviderMetadata[] {
-    return this.getAllProviders().filter((p) => p.capabilities[capability]);
+    return this.getAllProviders().filter(() => undefined);
   }
 
killedBy: ProviderService - Get Providers by Capability should return providers with publish capability
statusReason: expected false to be truthy

[Killed] BlockStatement
src/providers/providerRegistry.ts:128:50
   /**
    * Get providers that have adapter implementations registered.
    */
-  getProvidersWithAdapters(): ProviderMetadata[] {
-    return this.getAllProviders().filter((p) => this.adapters.has(p.id));
-  }
+  getProvidersWithAdapters(): ProviderMetadata[] {}
 
   /**
killedBy: Provider Registry - Adapter Management should return providers with adapters
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] ArrowFunction
src/providers/providerRegistry.ts:129:42
    * Get providers that have adapter implementations registered.
    */
   getProvidersWithAdapters(): ProviderMetadata[] {
-    return this.getAllProviders().filter((p) => this.adapters.has(p.id));
+    return this.getAllProviders().filter(() => undefined);
   }
 
killedBy: Provider Registry - Adapter Management should return providers with adapters
statusReason: expected false to be truthy

[Survived] MethodExpression
src/providers/providerRegistry.ts:129:12
    * Get providers that have adapter implementations registered.
    */
   getProvidersWithAdapters(): ProviderMetadata[] {
-    return this.getAllProviders().filter((p) => this.adapters.has(p.id));
+    return this.getAllProviders();
   }
 

[Killed] BlockStatement
src/providers/providerRegistry.ts:135:35
   /**
    * Check if a provider has an adapter registered.
    */
-  hasAdapter(id: string): boolean {
-    return this.adapters.has(id);
-  }
+  hasAdapter(id: string): boolean {}
 
   /**
killedBy: Provider Registry - Initialization & Built-in Providers should have adapters registered for all built-in providers
statusReason: expected false to be truthy

[Killed] BlockStatement
src/providers/providerRegistry.ts:147:6
     healthy: boolean;
     latency?: number;
     error?: string;
-  }> {
-    const adapter = this.adapters.get(id);
-    if (!adapter) {
-      return { healthy: false, error: "Provider not found or adapter not implemented" };
-    }
-
-    const startTime = Date.now();
-    try {
-      // Try to validate with dummy credentials to check if the adapter is responsive
-      const _result = await adapter.validateCredentials({});
-      const latency = Date.now() - startTime;
-
-      // We expect this to fail with AUTH_INVALID for dummy creds
-      // But if it doesn't throw, the adapter is healthy
-      return { healthy: true, latency };
-    } catch {
-      const latency = Date.now() - startTime;
-      return {
-        healthy: true, // Adapter is healthy if it responds, even with auth error
-        latency,
-      };
-    }
-  }
+  }> {}
 
   /**
killedBy: Provider Registry - Health Checking should return health status for registered provider
statusReason: Cannot read properties of undefined (reading 'healthy')

[Killed] BooleanLiteral
src/providers/providerRegistry.ts:149:9
     error?: string;
   }> {
     const adapter = this.adapters.get(id);
-    if (!adapter) {
+    if (adapter) {
       return { healthy: false, error: "Provider not found or adapter not implemented" };
     }
killedBy: Provider Registry - Health Checking should return unhealthy for unknown provider
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/providers/providerRegistry.ts:149:19
     error?: string;
   }> {
     const adapter = this.adapters.get(id);
-    if (!adapter) {
-      return { healthy: false, error: "Provider not found or adapter not implemented" };
-    }
+    if (!adapter) {}
 
     const startTime = Date.now();
killedBy: Provider Registry - Health Checking should return unhealthy for unknown provider
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/providers/providerRegistry.ts:150:25
   }> {
     const adapter = this.adapters.get(id);
     if (!adapter) {
-      return { healthy: false, error: "Provider not found or adapter not implemented" };
+      return { healthy: true, error: "Provider not found or adapter not implemented" };
     }
 
killedBy: Provider Registry - Health Checking should return unhealthy for unknown provider
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/providers/providerRegistry.ts:154:9
     }
 
     const startTime = Date.now();
-    try {
-      // Try to validate with dummy credentials to check if the adapter is responsive
-      const _result = await adapter.validateCredentials({});
-      const latency = Date.now() - startTime;
-
-      // We expect this to fail with AUTH_INVALID for dummy creds
-      // But if it doesn't throw, the adapter is healthy
-      return { healthy: true, latency };
-    } catch {
+    try {} catch {
       const latency = Date.now() - startTime;
       return {
killedBy: Provider Registry - Health Checking should return health status for registered provider
statusReason: Cannot read properties of undefined (reading 'healthy')

[Survived] ArithmeticOperator
src/providers/providerRegistry.ts:157:23
     try {
       // Try to validate with dummy credentials to check if the adapter is responsive
       const _result = await adapter.validateCredentials({});
-      const latency = Date.now() - startTime;
+      const latency = Date.now() + startTime;
 
       // We expect this to fail with AUTH_INVALID for dummy creds

[Survived] BooleanLiteral
src/providers/providerRegistry.ts:161:25
 
       // We expect this to fail with AUTH_INVALID for dummy creds
       // But if it doesn't throw, the adapter is healthy
-      return { healthy: true, latency };
+      return { healthy: false, latency };
     } catch {
       const latency = Date.now() - startTime;

[Killed] ObjectLiteral
src/providers/providerRegistry.ts:161:14
 
       // We expect this to fail with AUTH_INVALID for dummy creds
       // But if it doesn't throw, the adapter is healthy
-      return { healthy: true, latency };
+      return {};
     } catch {
       const latency = Date.now() - startTime;
killedBy: Provider Registry - Health Checking should return health status for registered provider
statusReason: expected false to be truthy

[NoCoverage] BlockStatement
src/providers/providerRegistry.ts:162:13
       // We expect this to fail with AUTH_INVALID for dummy creds
       // But if it doesn't throw, the adapter is healthy
       return { healthy: true, latency };
-    } catch {
-      const latency = Date.now() - startTime;
-      return {
-        healthy: true, // Adapter is healthy if it responds, even with auth error
-        latency,
-      };
-    }
+    } catch {}
   }
 

[NoCoverage] ArithmeticOperator
src/providers/providerRegistry.ts:163:23
       // But if it doesn't throw, the adapter is healthy
       return { healthy: true, latency };
     } catch {
-      const latency = Date.now() - startTime;
+      const latency = Date.now() + startTime;
       return {
         healthy: true, // Adapter is healthy if it responds, even with auth error

[NoCoverage] ObjectLiteral
src/providers/providerRegistry.ts:164:14
       return { healthy: true, latency };
     } catch {
       const latency = Date.now() - startTime;
-      return {
-        healthy: true, // Adapter is healthy if it responds, even with auth error
-        latency,
-      };
+      return {};
     }
   }

[NoCoverage] BooleanLiteral
src/providers/providerRegistry.ts:165:18
     } catch {
       const latency = Date.now() - startTime;
       return {
-        healthy: true, // Adapter is healthy if it responds, even with auth error
+        healthy: false, // Adapter is healthy if it responds, even with auth error
         latency,
       };

[Killed] BlockStatement
src/providers/providerRegistry.ts:184:5
         error?: string;
       }
     >
-  > {
-    const results = new Map();
-
-    // Only check health for providers with registered adapters
-    const adapterIds = Array.from(this.adapters.keys());
-    for (const id of adapterIds) {
-      const health = await this.checkProviderHealth(id);
-      results.set(id, health);
-    }
-
-    return results;
-  }
+  > {}
 
   /**
killedBy: Provider Registry - Health Checking should check all providers health
statusReason: Cannot read properties of undefined (reading 'size')

[Killed] BlockStatement
src/providers/providerRegistry.ts:189:34
 
     // Only check health for providers with registered adapters
     const adapterIds = Array.from(this.adapters.keys());
-    for (const id of adapterIds) {
-      const health = await this.checkProviderHealth(id);
-      results.set(id, health);
-    }
+    for (const id of adapterIds) {}
 
     return results;
killedBy: Provider Registry - Health Checking should check all providers health
statusReason: expected false to be truthy

[Killed] BlockStatement
src/providers/providerRegistry.ts:205:63
     providerId: string,
     content: string,
     mediaCount: number = 0
-  ): { valid: boolean; errors: string[]; warnings: string[] } {
-    const result = validateContentForProvider(providerId, content, mediaCount);
-    return result;
-  }
+  ): { valid: boolean; errors: string[]; warnings: string[] } {}
 
   /**
killedBy: Provider Registry - Limits & Validation should validate content within limits
statusReason: Cannot read properties of undefined (reading 'valid')

[Killed] BlockStatement
src/providers/providerRegistry.ts:213:44
   /**
    * Get the character limit for a specific provider.
    */
-  getCharLimit(providerId: string): number {
-    const provider = this.getProvider(providerId);
-    return provider?.limits.maxChars || 280;
-  }
+  getCharLimit(providerId: string): number {}
 
   /**
killedBy: Provider Registry - Limits & Validation should return correct character limit for X/Twitter
statusReason: expected undefined to be 280 // Object.is equality

[Killed] OptionalChaining
src/providers/providerRegistry.ts:215:12
    */
   getCharLimit(providerId: string): number {
     const provider = this.getProvider(providerId);
-    return provider?.limits.maxChars || 280;
+    return provider.limits.maxChars || 280;
   }
 
killedBy: Provider Registry - Limits & Validation should return default character limit for unknown provider
statusReason: Cannot read properties of undefined (reading 'limits')

[Killed] LogicalOperator
src/providers/providerRegistry.ts:215:12
    */
   getCharLimit(providerId: string): number {
     const provider = this.getProvider(providerId);
-    return provider?.limits.maxChars || 280;
+    return provider?.limits.maxChars && 280;
   }
 
killedBy: Provider Registry - Limits & Validation should return default character limit for unknown provider
statusReason: expected undefined to be 280 // Object.is equality

[Killed] BlockStatement
src/providers/providerRegistry.ts:221:66
   /**
    * Get media limits for a specific provider.
    */
-  getMediaLimits(providerId: string): ProviderLimits | undefined {
-    const provider = this.getProvider(providerId);
-    return provider?.limits;
-  }
+  getMediaLimits(providerId: string): ProviderLimits | undefined {}
 
   /**
killedBy: Provider Registry - Limits & Validation should return media limits for provider
statusReason: expected false to be truthy

[Killed] OptionalChaining
src/providers/providerRegistry.ts:223:12
    */
   getMediaLimits(providerId: string): ProviderLimits | undefined {
     const provider = this.getProvider(providerId);
-    return provider?.limits;
+    return provider.limits;
   }
 
killedBy: Provider Registry - Limits & Validation should return undefined media limits for unknown provider
statusReason: Cannot read properties of undefined (reading 'limits')

[Killed] BlockStatement
src/providers/providerRegistry.ts:229:91
   /**
    * Check if a provider supports a specific capability.
    */
-  supportsCapability(providerId: string, capability: keyof ProviderCapabilities): boolean {
-    const provider = this.getProvider(providerId);
-    return provider?.capabilities[capability] || false;
-  }
+  supportsCapability(providerId: string, capability: keyof ProviderCapabilities): boolean {}
 
   /**
killedBy: Provider Registry - Filtering & Queries should check if individual provider supports capability
statusReason: expected undefined to be true // Object.is equality

[Killed] ConditionalExpression
src/providers/providerRegistry.ts:231:12
    */
   supportsCapability(providerId: string, capability: keyof ProviderCapabilities): boolean {
     const provider = this.getProvider(providerId);
-    return provider?.capabilities[capability] || false;
+    return false;
   }
 
killedBy: Provider Registry - Filtering & Queries should check if individual provider supports capability
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/providers/providerRegistry.ts:231:50
    */
   supportsCapability(providerId: string, capability: keyof ProviderCapabilities): boolean {
     const provider = this.getProvider(providerId);
-    return provider?.capabilities[capability] || false;
+    return provider?.capabilities[capability] || true;
   }
 
killedBy: Provider Registry - Filtering & Queries should return false for capability check on unknown provider
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/providers/providerRegistry.ts:237:64
   /**
    * Check if content needs to be threaded for a given provider.
    */
-  needsThreading(providerId: string, content: string): boolean {
-    const provider = this.getProvider(providerId);
-    if (!provider) return false;
-
-    return content.length > provider.limits.maxChars && provider.capabilities.threading === true;
-  }
+  needsThreading(providerId: string, content: string): boolean {}
 
   /**
killedBy: Provider Registry - Threading Logic should return false for short content
statusReason: expected undefined to be false // Object.is equality

[Killed] BooleanLiteral
src/providers/providerRegistry.ts:239:9
    */
   needsThreading(providerId: string, content: string): boolean {
     const provider = this.getProvider(providerId);
-    if (!provider) return false;
+    if (provider) return false;
 
     return content.length > provider.limits.maxChars && provider.capabilities.threading === true;
killedBy: Provider Registry - Threading Logic should return true for long content on X
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/providers/providerRegistry.ts:239:9
    */
   needsThreading(providerId: string, content: string): boolean {
     const provider = this.getProvider(providerId);
-    if (!provider) return false;
+    if (true) return false;
 
     return content.length > provider.limits.maxChars && provider.capabilities.threading === true;
killedBy: Provider Registry - Threading Logic should return true for long content on X
statusReason: expected false to be true // Object.is equality

[Killed] LogicalOperator
src/providers/providerRegistry.ts:241:12
     const provider = this.getProvider(providerId);
     if (!provider) return false;
 
-    return content.length > provider.limits.maxChars && provider.capabilities.threading === true;
+    return content.length > provider.limits.maxChars || provider.capabilities.threading === true;
   }
 
killedBy: Provider Registry - Threading Logic should return false for short content
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/providers/providerRegistry.ts:241:12
     const provider = this.getProvider(providerId);
     if (!provider) return false;
 
-    return content.length > provider.limits.maxChars && provider.capabilities.threading === true;
+    return false;
   }
 
killedBy: Provider Registry - Threading Logic should return true for long content on X
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/providers/providerRegistry.ts:247:68
   /**
    * Calculate the number of posts needed for threading.
    */
-  calculateThreadSize(providerId: string, content: string): number {
-    if (!this.needsThreading(providerId, content)) {
-      return 1;
-    }
-
-    const charLimit = this.getCharLimit(providerId);
-    return Math.ceil(content.length / charLimit);
-  }
+  calculateThreadSize(providerId: string, content: string): number {}
 }
 
killedBy: Provider Registry - Threading Logic should calculate thread size 1 for short content
statusReason: expected undefined to be 1 // Object.is equality

[Killed] BooleanLiteral
src/providers/providerRegistry.ts:248:9
    * Calculate the number of posts needed for threading.
    */
   calculateThreadSize(providerId: string, content: string): number {
-    if (!this.needsThreading(providerId, content)) {
+    if (this.needsThreading(providerId, content)) {
       return 1;
     }
killedBy: Provider Registry - Threading Logic should calculate thread size 2 for content exactly 2x limit
statusReason: expected 1 to be 2 // Object.is equality

[Killed] ConditionalExpression
src/providers/providerRegistry.ts:248:9
    * Calculate the number of posts needed for threading.
    */
   calculateThreadSize(providerId: string, content: string): number {
-    if (!this.needsThreading(providerId, content)) {
+    if (true) {
       return 1;
     }
killedBy: Provider Registry - Threading Logic should calculate thread size 2 for content exactly 2x limit
statusReason: expected 1 to be 2 // Object.is equality

[Killed] ArithmeticOperator
src/providers/providerRegistry.ts:253:22
     }
 
     const charLimit = this.getCharLimit(providerId);
-    return Math.ceil(content.length / charLimit);
+    return Math.ceil(content.length * charLimit);
   }
 }
killedBy: Provider Registry - Threading Logic should calculate thread size 2 for content exactly 2x limit
statusReason: expected 156800 to be 2 // Object.is equality
