[NoCoverage] MethodExpression
src/providers/providerRoutes.ts:26:7
 });
 
 const GetProviderParamsSchema = z.object({
-  id: z.string().min(1),
+  id: z.string().max(1),
 });
 

[NoCoverage] MethodExpression
src/providers/providerRoutes.ts:30:14
 });
 
 const GetProviderConnectionsParamsSchema = z.object({
-  projectId: z.string().min(1),
+  projectId: z.string().max(1),
 });
 

[NoCoverage] StringLiteral
src/providers/providerRoutes.ts:47:25
  * Provider route handler extending BaseRouteHandler
  */
 class ProviderRouteHandler extends BaseRouteHandler {
-  protected routeName = "providers";
+  protected routeName = "";
 
   constructor(

[NoCoverage] BlockStatement
src/providers/providerRoutes.ts:59:59
   /**
    * GET /providers - Get all providers
    */
-  async getAllProviders(ctx: RouteContext): Promise<void> {
-    const result = await this.providerService.getAllProviders();
-    this.sendSuccess(ctx, result);
-  }
+  async getAllProviders(ctx: RouteContext): Promise<void> {}
 
   /**

[NoCoverage] BlockStatement
src/providers/providerRoutes.ts:67:62
   /**
    * GET /providers/active - Get active providers only
    */
-  async getActiveProviders(ctx: RouteContext): Promise<void> {
-    const result = await this.providerService.getActiveProviders();
-    this.sendSuccess(ctx, result);
-  }
+  async getActiveProviders(ctx: RouteContext): Promise<void> {}
 
   /**

[NoCoverage] BlockStatement
src/providers/providerRoutes.ts:75:68
   /**
    * GET /providers/by-capability/:capability - Get providers by capability
    */
-  async getProvidersByCapability(ctx: RouteContext): Promise<void> {
-    // Validate params
-    const validationResult = await this.validateRequest(ctx, {
-      params: GetProviderByCapabilityParamsSchema,
-    });
-
-    if (!validationResult.ok) {
-      return this.sendError(ctx, 400, "Invalid capability", {
-        validCapabilities: ProviderCapabilitySchema.options,
-      });
-    }
-
-    const { params } = validationResult.value as {
-      params: z.infer<typeof GetProviderByCapabilityParamsSchema>;
-    };
-
-    const result = await this.providerService.getProvidersByCapability(params.capability);
-    this.sendSuccess(ctx, result);
-  }
+  async getProvidersByCapability(ctx: RouteContext): Promise<void> {}
 
   /**

[NoCoverage] ObjectLiteral
src/providers/providerRoutes.ts:77:62
    */
   async getProvidersByCapability(ctx: RouteContext): Promise<void> {
     // Validate params
-    const validationResult = await this.validateRequest(ctx, {
-      params: GetProviderByCapabilityParamsSchema,
-    });
+    const validationResult = await this.validateRequest(ctx, {});
 
     if (!validationResult.ok) {

[NoCoverage] ConditionalExpression
src/providers/providerRoutes.ts:81:9
       params: GetProviderByCapabilityParamsSchema,
     });
 
-    if (!validationResult.ok) {
+    if (true) {
       return this.sendError(ctx, 400, "Invalid capability", {
         validCapabilities: ProviderCapabilitySchema.options,

[NoCoverage] ConditionalExpression
src/providers/providerRoutes.ts:81:9
       params: GetProviderByCapabilityParamsSchema,
     });
 
-    if (!validationResult.ok) {
+    if (false) {
       return this.sendError(ctx, 400, "Invalid capability", {
         validCapabilities: ProviderCapabilitySchema.options,

[NoCoverage] ObjectLiteral
src/providers/providerRoutes.ts:82:61
     });
 
     if (!validationResult.ok) {
-      return this.sendError(ctx, 400, "Invalid capability", {
-        validCapabilities: ProviderCapabilitySchema.options,
-      });
+      return this.sendError(ctx, 400, "Invalid capability", {});
     }
 

[NoCoverage] BlockStatement
src/providers/providerRoutes.ts:98:59
   /**
    * GET /providers/:id - Get specific provider details
    */
-  async getProviderById(ctx: RouteContext): Promise<void> {
-    // Validate params
-    const validationResult = await this.validateRequest(ctx, {
-      params: GetProviderParamsSchema,
-    });
-
-    if (!validationResult.ok) {
-      return this.sendError(ctx, 400, "Invalid provider ID");
-    }
-
-    const { params } = validationResult.value as {
-      params: z.infer<typeof GetProviderParamsSchema>;
-    };
-
-    const provider = await this.providerService.getProviderById(params.id);
-
-    if (!provider) {
-      return this.sendError(ctx, 404, "Provider not found");
-    }
-
-    this.sendSuccess(ctx, { provider });
-  }
+  async getProviderById(ctx: RouteContext): Promise<void> {}
 
   /**

[NoCoverage] BlockStatement
src/providers/providerRoutes.ts:104:31
       params: GetProviderParamsSchema,
     });
 
-    if (!validationResult.ok) {
-      return this.sendError(ctx, 400, "Invalid provider ID");
-    }
+    if (!validationResult.ok) {}
 
     const { params } = validationResult.value as {

[NoCoverage] ConditionalExpression
src/providers/providerRoutes.ts:114:9
 
     const provider = await this.providerService.getProviderById(params.id);
 
-    if (!provider) {
+    if (true) {
       return this.sendError(ctx, 404, "Provider not found");
     }

[NoCoverage] BlockStatement
src/providers/providerRoutes.ts:114:20
 
     const provider = await this.providerService.getProviderById(params.id);
 
-    if (!provider) {
-      return this.sendError(ctx, 404, "Provider not found");
-    }
+    if (!provider) {}
 
     this.sendSuccess(ctx, { provider });

[NoCoverage] ConditionalExpression
src/providers/providerRoutes.ts:140:9
 
     const provider = this.providerRegistry.getProvider(params.id);
 
-    if (!provider) {
+    if (false) {
       return this.sendError(ctx, 404, "Provider not found");
     }

[NoCoverage] ObjectLiteral
src/providers/providerRoutes.ts:146:27
 
     const health = await this.providerRegistry.checkProviderHealth(params.id);
 
-    this.sendSuccess(ctx, {
-      providerId: params.id,
-      providerName: provider.displayName,
-      health,
-    });
+    this.sendSuccess(ctx, {});
   }
 

[NoCoverage] ArrayDeclaration
src/providers/providerRoutes.ts:169:45
     let totalLatency = 0;
     let latencyCount = 0;
 
-    const results: ProviderHealthResult[] = [];
+    const results: ProviderHealthResult[] = ["Stryker was here"];
     for (const [id, health] of healthResults) {
       const provider = this.providerRegistry.getProvider(id);

[NoCoverage] BlockStatement
src/providers/providerRoutes.ts:170:47
     let latencyCount = 0;
 
     const results: ProviderHealthResult[] = [];
-    for (const [id, health] of healthResults) {
-      const provider = this.providerRegistry.getProvider(id);
-      if (health.healthy) {
-        summary.healthy++;
-      } else {
-        summary.unhealthy++;
-      }
-
-      if (health.latency) {
-        totalLatency += health.latency;
-        latencyCount++;
-      }
-
-      results.push({
-        id,
-        name: provider?.displayName || id,
-        status: provider?.status || "unknown",
-        ...health,
-      });
-    }
+    for (const [id, health] of healthResults) {}
 
     if (latencyCount > 0) {

[NoCoverage] ConditionalExpression
src/providers/providerRoutes.ts:172:11
     const results: ProviderHealthResult[] = [];
     for (const [id, health] of healthResults) {
       const provider = this.providerRegistry.getProvider(id);
-      if (health.healthy) {
+      if (true) {
         summary.healthy++;
       } else {

[NoCoverage] ConditionalExpression
src/providers/providerRoutes.ts:172:11
     const results: ProviderHealthResult[] = [];
     for (const [id, health] of healthResults) {
       const provider = this.providerRegistry.getProvider(id);
-      if (health.healthy) {
+      if (false) {
         summary.healthy++;
       } else {

[NoCoverage] UpdateOperator
src/providers/providerRoutes.ts:173:9
     for (const [id, health] of healthResults) {
       const provider = this.providerRegistry.getProvider(id);
       if (health.healthy) {
-        summary.healthy++;
+        summary.healthy--;
       } else {
         summary.unhealthy++;

[NoCoverage] BlockStatement
src/providers/providerRoutes.ts:174:14
       const provider = this.providerRegistry.getProvider(id);
       if (health.healthy) {
         summary.healthy++;
-      } else {
-        summary.unhealthy++;
-      }
+      } else {}
 
       if (health.latency) {

[NoCoverage] UpdateOperator
src/providers/providerRoutes.ts:175:9
       if (health.healthy) {
         summary.healthy++;
       } else {
-        summary.unhealthy++;
+        summary.unhealthy--;
       }
 

[NoCoverage] BlockStatement
src/providers/providerRoutes.ts:178:27
         summary.unhealthy++;
       }
 
-      if (health.latency) {
-        totalLatency += health.latency;
-        latencyCount++;
-      }
+      if (health.latency) {}
 
       results.push({

[NoCoverage] ConditionalExpression
src/providers/providerRoutes.ts:178:11
         summary.unhealthy++;
       }
 
-      if (health.latency) {
+      if (false) {
         totalLatency += health.latency;
         latencyCount++;

[NoCoverage] AssignmentOperator
src/providers/providerRoutes.ts:179:9
       }
 
       if (health.latency) {
-        totalLatency += health.latency;
+        totalLatency -= health.latency;
         latencyCount++;
       }

[NoCoverage] UpdateOperator
src/providers/providerRoutes.ts:180:9
 
       if (health.latency) {
         totalLatency += health.latency;
-        latencyCount++;
+        latencyCount--;
       }
 

[NoCoverage] ConditionalExpression
src/providers/providerRoutes.ts:185:15
 
       results.push({
         id,
-        name: provider?.displayName || id,
+        name: false,
         status: provider?.status || "unknown",
         ...health,

[NoCoverage] LogicalOperator
src/providers/providerRoutes.ts:185:15
 
       results.push({
         id,
-        name: provider?.displayName || id,
+        name: provider?.displayName && id,
         status: provider?.status || "unknown",
         ...health,

[NoCoverage] ConditionalExpression
src/providers/providerRoutes.ts:186:17
       results.push({
         id,
         name: provider?.displayName || id,
-        status: provider?.status || "unknown",
+        status: false,
         ...health,
       });

[NoCoverage] LogicalOperator
src/providers/providerRoutes.ts:186:17
       results.push({
         id,
         name: provider?.displayName || id,
-        status: provider?.status || "unknown",
+        status: provider?.status && "unknown",
         ...health,
       });

[NoCoverage] EqualityOperator
src/providers/providerRoutes.ts:191:9
       });
     }
 
-    if (latencyCount > 0) {
+    if (latencyCount >= 0) {
       summary.avgLatency = Math.round(totalLatency / latencyCount);
     }

[NoCoverage] EqualityOperator
src/providers/providerRoutes.ts:191:9
       });
     }
 
-    if (latencyCount > 0) {
+    if (latencyCount <= 0) {
       summary.avgLatency = Math.round(totalLatency / latencyCount);
     }

[NoCoverage] ArithmeticOperator
src/providers/providerRoutes.ts:192:39
     }
 
     if (latencyCount > 0) {
-      summary.avgLatency = Math.round(totalLatency / latencyCount);
+      summary.avgLatency = Math.round(totalLatency * latencyCount);
     }
 

[NoCoverage] StringLiteral
src/providers/providerRoutes.ts:212:39
     });
 
     if (!validationResult.ok) {
-      return this.sendError(ctx, 400, "Invalid project ID");
+      return this.sendError(ctx, 400, "");
     }
 

[NoCoverage] BlockStatement
src/providers/providerRoutes.ts:219:9
       params: z.infer<typeof GetProviderConnectionsParamsSchema>;
     };
 
-    try {
-      const connections = await this.providerService.getConnectionsByProjectId(params.projectId);
-
-      this.sendSuccess(ctx, {
-        projectId: params.projectId,
-        connections,
-        total: connections.length,
-      });
-    } catch (error) {
+    try {} catch (error) {
       const message =
         error instanceof Error ? error.message : "Failed to fetch provider connections";

[NoCoverage] BlockStatement
src/providers/providerRoutes.ts:227:21
         connections,
         total: connections.length,
       });
-    } catch (error) {
-      const message =
-        error instanceof Error ? error.message : "Failed to fetch provider connections";
-      this.sendError(ctx, 500, message);
-    }
+    } catch (error) {}
   }
 }

[NoCoverage] StringLiteral
src/providers/providerRoutes.ts:229:50
       });
     } catch (error) {
       const message =
-        error instanceof Error ? error.message : "Failed to fetch provider connections";
+        error instanceof Error ? error.message : "";
       this.sendError(ctx, 500, message);
     }

[NoCoverage] BlockStatement
src/providers/providerRoutes.ts:244:85
   const handler = new ProviderRouteHandler(svcProvider, svcRegistry);
 
   // Register routes
-  fastify.get("/providers", async (request: FastifyRequest, reply: FastifyReply) => {
-    await handler.getAllProviders({ request, reply });
-  });
+  fastify.get("/providers", async (request: FastifyRequest, reply: FastifyReply) => {});
 
   fastify.get("/providers/active", async (request: FastifyRequest, reply: FastifyReply) => {

[NoCoverage] BlockStatement
src/providers/providerRoutes.ts:248:92
     await handler.getAllProviders({ request, reply });
   });
 
-  fastify.get("/providers/active", async (request: FastifyRequest, reply: FastifyReply) => {
-    await handler.getActiveProviders({ request, reply });
-  });
+  fastify.get("/providers/active", async (request: FastifyRequest, reply: FastifyReply) => {});
 
   fastify.get(

[NoCoverage] BlockStatement
src/providers/providerRoutes.ts:254:61
 
   fastify.get(
     "/providers/by-capability/:capability",
-    async (request: FastifyRequest, reply: FastifyReply) => {
-      await handler.getProvidersByCapability({ request, reply });
-    }
+    async (request: FastifyRequest, reply: FastifyReply) => {}
   );
 

[NoCoverage] BlockStatement
src/providers/providerRoutes.ts:259:89
     }
   );
 
-  fastify.get("/providers/:id", async (request: FastifyRequest, reply: FastifyReply) => {
-    await handler.getProviderById({ request, reply });
-  });
+  fastify.get("/providers/:id", async (request: FastifyRequest, reply: FastifyReply) => {});
 
   fastify.get("/providers/:id/health", async (request: FastifyRequest, reply: FastifyReply) => {

[NoCoverage] ObjectLiteral
src/providers/providerRoutes.ts:260:35
   );
 
   fastify.get("/providers/:id", async (request: FastifyRequest, reply: FastifyReply) => {
-    await handler.getProviderById({ request, reply });
+    await handler.getProviderById({});
   });
 

[NoCoverage] BlockStatement
src/providers/providerRoutes.ts:263:96
     await handler.getProviderById({ request, reply });
   });
 
-  fastify.get("/providers/:id/health", async (request: FastifyRequest, reply: FastifyReply) => {
-    await handler.getProviderHealth({ request, reply });
-  });
+  fastify.get("/providers/:id/health", async (request: FastifyRequest, reply: FastifyReply) => {});
 
   fastify.get("/providers/health/all", async (request: FastifyRequest, reply: FastifyReply) => {

[NoCoverage] ObjectLiteral
src/providers/providerRoutes.ts:264:37
   });
 
   fastify.get("/providers/:id/health", async (request: FastifyRequest, reply: FastifyReply) => {
-    await handler.getProviderHealth({ request, reply });
+    await handler.getProviderHealth({});
   });
 

[NoCoverage] BlockStatement
src/providers/providerRoutes.ts:267:96
     await handler.getProviderHealth({ request, reply });
   });
 
-  fastify.get("/providers/health/all", async (request: FastifyRequest, reply: FastifyReply) => {
-    await handler.getAllProvidersHealth({ request, reply });
-  });
+  fastify.get("/providers/health/all", async (request: FastifyRequest, reply: FastifyReply) => {});
 
   fastify.get(

[NoCoverage] BlockStatement
src/providers/providerRoutes.ts:273:61
 
   fastify.get(
     "/providers/connections/:projectId",
-    async (request: FastifyRequest, reply: FastifyReply) => {
-      await handler.getProviderConnections({ request, reply });
-    }
+    async (request: FastifyRequest, reply: FastifyReply) => {}
   );
 };
