[Survived] LogicalOperator
src/middleware/autoCacheMiddleware.ts:20:10
 
 const logger = pino({
   name: "auto-cache-middleware",
-  level: process.env.LOG_LEVEL || "info",
+  level: process.env.LOG_LEVEL && "info",
 });
 

[Survived] ConditionalExpression
src/middleware/autoCacheMiddleware.ts:20:10
 
 const logger = pino({
   name: "auto-cache-middleware",
-  level: process.env.LOG_LEVEL || "info",
+  level: false,
 });
 

[Survived] BooleanLiteral
src/middleware/autoCacheMiddleware.ts:62:21
  */
 const autoCachePluginImpl: FastifyPluginAsync<AutoCacheOptions> = async (fastify, options) => {
   const {
-    enableCaching = true,
+    enableCaching = false,
     enableInvalidation = true,
     excludeRoutes = [],

[Survived] BooleanLiteral
src/middleware/autoCacheMiddleware.ts:63:26
 const autoCachePluginImpl: FastifyPluginAsync<AutoCacheOptions> = async (fastify, options) => {
   const {
     enableCaching = true,
-    enableInvalidation = true,
+    enableInvalidation = false,
     excludeRoutes = [],
     logCacheOps = false,

[Survived] ArrayDeclaration
src/middleware/autoCacheMiddleware.ts:64:21
   const {
     enableCaching = true,
     enableInvalidation = true,
-    excludeRoutes = [],
+    excludeRoutes = ["Stryker was here"],
     logCacheOps = false,
   } = options;

[Survived] BooleanLiteral
src/middleware/autoCacheMiddleware.ts:65:19
     enableCaching = true,
     enableInvalidation = true,
     excludeRoutes = [],
-    logCacheOps = false,
+    logCacheOps = true,
   } = options;
 

[Killed] LogicalOperator
src/middleware/autoCacheMiddleware.ts:68:24
     logCacheOps = false,
   } = options;
 
-  const cacheManager = options.cacheManager ?? fastify.cacheManager ?? fastify.cache;
+  const cacheManager = (options.cacheManager ?? fastify.cacheManager) && fastify.cache;
 
   if (!cacheManager) {
killedBy: autoCacheMiddleware - Invalidation, Key Variations and Config Cache Invalidation should invalidate cache on POST requests
statusReason: expected 2 to be 1 // Object.is equality

[Survived] LogicalOperator
src/middleware/autoCacheMiddleware.ts:68:24
     logCacheOps = false,
   } = options;
 
-  const cacheManager = options.cacheManager ?? fastify.cacheManager ?? fastify.cache;
+  const cacheManager = options.cacheManager && fastify.cacheManager ?? fastify.cache;
 
   if (!cacheManager) {

[Survived] StringLiteral
src/middleware/autoCacheMiddleware.ts:76:5
   }
 
   logger.info(
-    `Auto-cache plugin enabled (caching: ${enableCaching}, invalidation: ${enableInvalidation})`
+    ``
   );
 

[Killed] ConditionalExpression
src/middleware/autoCacheMiddleware.ts:82:7
   /**
    * Pre-handler hook for caching GET requests
    */
-  if (enableCaching) {
+  if (false) {
     fastify.addHook("onRequest", async (request: FastifyRequest, reply: FastifyReply) => {
       // Only cache GET requests
killedBy: autoCacheMiddleware - Invalidation, Key Variations and Config Cache Invalidation should invalidate cache on POST requests
statusReason: expected 2 to be 1 // Object.is equality

[Survived] ConditionalExpression
src/middleware/autoCacheMiddleware.ts:82:7
   /**
    * Pre-handler hook for caching GET requests
    */
-  if (enableCaching) {
+  if (true) {
     fastify.addHook("onRequest", async (request: FastifyRequest, reply: FastifyReply) => {
       // Only cache GET requests

[Killed] EqualityOperator
src/middleware/autoCacheMiddleware.ts:85:11
   if (enableCaching) {
     fastify.addHook("onRequest", async (request: FastifyRequest, reply: FastifyReply) => {
       // Only cache GET requests
-      if (request.method !== "GET") {
+      if (request.method === "GET") {
         return;
       }
killedBy: autoCacheMiddleware - Invalidation, Key Variations and Config Cache Invalidation should invalidate cache on POST requests
statusReason: expected 2 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/middleware/autoCacheMiddleware.ts:85:11
   if (enableCaching) {
     fastify.addHook("onRequest", async (request: FastifyRequest, reply: FastifyReply) => {
       // Only cache GET requests
-      if (request.method !== "GET") {
+      if (true) {
         return;
       }
killedBy: autoCacheMiddleware - Invalidation, Key Variations and Config Cache Invalidation should invalidate cache on POST requests
statusReason: expected 2 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/middleware/autoCacheMiddleware.ts:89:21
         return;
       }
 
-      const route = request.routeOptions.url || request.url;
+      const route = false;
 
       // Check if route is excluded
killedBy: autoCacheMiddleware - Invalidation, Key Variations and Config Cache Invalidation should invalidate cache on POST requests
statusReason: expected 2 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/middleware/autoCacheMiddleware.ts:89:21
         return;
       }
 
-      const route = request.routeOptions.url || request.url;
+      const route = true;
 
       // Check if route is excluded
killedBy: autoCacheMiddleware - Invalidation, Key Variations and Config Cache Invalidation should invalidate cache on POST requests
statusReason: expected 2 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/middleware/autoCacheMiddleware.ts:92:11
       const route = request.routeOptions.url || request.url;
 
       // Check if route is excluded
-      if (excludeRoutes.some((excluded) => route.includes(excluded))) {
+      if (true) {
         return;
       }
killedBy: autoCacheMiddleware - Invalidation, Key Variations and Config Cache Invalidation should invalidate cache on POST requests
statusReason: expected 2 to be 1 // Object.is equality

[Killed] MethodExpression
src/middleware/autoCacheMiddleware.ts:92:11
       const route = request.routeOptions.url || request.url;
 
       // Check if route is excluded
-      if (excludeRoutes.some((excluded) => route.includes(excluded))) {
+      if (excludeRoutes.every(excluded => route.includes(excluded))) {
         return;
       }
killedBy: autoCacheMiddleware - Invalidation, Key Variations and Config Cache Invalidation should invalidate cache on POST requests
statusReason: expected 2 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/middleware/autoCacheMiddleware.ts:99:11
       // Get cache configuration
       const config = getCacheConfig("GET", route);
 
-      if (!config || !config.enabled) {
+      if (true) {
         return;
       }
killedBy: autoCacheMiddleware - Invalidation, Key Variations and Config Cache Invalidation should invalidate cache on POST requests
statusReason: expected 2 to be 1 // Object.is equality

[Killed] BooleanLiteral
src/middleware/autoCacheMiddleware.ts:99:22
       // Get cache configuration
       const config = getCacheConfig("GET", route);
 
-      if (!config || !config.enabled) {
+      if (!config || config.enabled) {
         return;
       }
killedBy: autoCacheMiddleware - Invalidation, Key Variations and Config Cache Invalidation should invalidate cache on POST requests
statusReason: expected 2 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/middleware/autoCacheMiddleware.ts:105:9
 
       // Skip if cache manager is unavailable (closed/disconnected)
       if (
-        "isAvailable" in cacheManager &&
-        typeof cacheManager.isAvailable === "function" &&
-        !cacheManager.isAvailable()
+        true
       ) {
         return;
killedBy: autoCacheMiddleware - Invalidation, Key Variations and Config Cache Invalidation should invalidate cache on POST requests
statusReason: expected 2 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/middleware/autoCacheMiddleware.ts:105:9
 
       // Skip if cache manager is unavailable (closed/disconnected)
       if (
-        "isAvailable" in cacheManager &&
-        typeof cacheManager.isAvailable === "function" &&
+        true &&
         !cacheManager.isAvailable()
       ) {
killedBy: autoCacheMiddleware - Invalidation, Key Variations and Config Cache Invalidation should invalidate cache on POST requests
statusReason: expected undefined to be 1 // Object.is equality

[NoCoverage] EqualityOperator
src/middleware/autoCacheMiddleware.ts:106:9
       // Skip if cache manager is unavailable (closed/disconnected)
       if (
         "isAvailable" in cacheManager &&
-        typeof cacheManager.isAvailable === "function" &&
+        typeof cacheManager.isAvailable !== "function" &&
         !cacheManager.isAvailable()
       ) {

[NoCoverage] ConditionalExpression
src/middleware/autoCacheMiddleware.ts:106:9
       // Skip if cache manager is unavailable (closed/disconnected)
       if (
         "isAvailable" in cacheManager &&
-        typeof cacheManager.isAvailable === "function" &&
+        true &&
         !cacheManager.isAvailable()
       ) {

[NoCoverage] BooleanLiteral
src/middleware/autoCacheMiddleware.ts:107:9
       if (
         "isAvailable" in cacheManager &&
         typeof cacheManager.isAvailable === "function" &&
-        !cacheManager.isAvailable()
+        cacheManager.isAvailable()
       ) {
         return;

[NoCoverage] BlockStatement
src/middleware/autoCacheMiddleware.ts:108:9
         "isAvailable" in cacheManager &&
         typeof cacheManager.isAvailable === "function" &&
         !cacheManager.isAvailable()
-      ) {
-        return;
-      }
+      ) {}
 
       try {

[Killed] ConditionalExpression
src/middleware/autoCacheMiddleware.ts:124:13
         // Try to get from cache
         const cached = await cacheManager.get(cacheKey);
 
-        if (!cached.ok) {
+        if (true) {
           // Cache error - continue without cache, do NOT set _cacheKey
           if (logCacheOps) {
killedBy: autoCacheMiddleware - Invalidation, Key Variations and Config Cache Invalidation should invalidate cache on POST requests
statusReason: expected 2 to be 1 // Object.is equality

[Killed] BooleanLiteral
src/middleware/autoCacheMiddleware.ts:124:13
         // Try to get from cache
         const cached = await cacheManager.get(cacheKey);
 
-        if (!cached.ok) {
+        if (cached.ok) {
           // Cache error - continue without cache, do NOT set _cacheKey
           if (logCacheOps) {
killedBy: autoCacheMiddleware - Invalidation, Key Variations and Config Cache Invalidation should invalidate cache on POST requests
statusReason: expected 2 to be 1 // Object.is equality

[NoCoverage] ConditionalExpression
src/middleware/autoCacheMiddleware.ts:126:15
 
         if (!cached.ok) {
           // Cache error - continue without cache, do NOT set _cacheKey
-          if (logCacheOps) {
+          if (true) {
             logger.debug(`Cache error for key ${cacheKey}: ${cached.error}`);
           }

[NoCoverage] BlockStatement
src/middleware/autoCacheMiddleware.ts:126:28
 
         if (!cached.ok) {
           // Cache error - continue without cache, do NOT set _cacheKey
-          if (logCacheOps) {
-            logger.debug(`Cache error for key ${cacheKey}: ${cached.error}`);
-          }
+          if (logCacheOps) {}
           return;
         }

[Killed] EqualityOperator
src/middleware/autoCacheMiddleware.ts:132:13
           return;
         }
 
-        if (cached.value !== null) {
+        if (cached.value === null) {
           // Cache hit
           if (logCacheOps) {
killedBy: autoCacheMiddleware - Invalidation, Key Variations and Config Cache Invalidation should invalidate cache on POST requests
statusReason: expected 2 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/middleware/autoCacheMiddleware.ts:132:13
           return;
         }
 
-        if (cached.value !== null) {
+        if (true) {
           // Cache hit
           if (logCacheOps) {
killedBy: autoCacheMiddleware - Invalidation, Key Variations and Config Cache Invalidation should invalidate cache on POST requests
statusReason: expected 2 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/middleware/autoCacheMiddleware.ts:134:15
 
         if (cached.value !== null) {
           // Cache hit
-          if (logCacheOps) {
+          if (true) {
             logger.debug(`Cache HIT: ${cacheKey}`);
           }
killedBy: autoCacheMiddleware - Invalidation, Key Variations and Config Cache Invalidation should invalidate cache on POST requests
statusReason: expected 1 to be 2 // Object.is equality

[Survived] BlockStatement
src/middleware/autoCacheMiddleware.ts:134:28
 
         if (cached.value !== null) {
           // Cache hit
-          if (logCacheOps) {
-            logger.debug(`Cache HIT: ${cacheKey}`);
-          }
+          if (logCacheOps) {}
 
           const {

[Survived] ConditionalExpression
src/middleware/autoCacheMiddleware.ts:149:15
           };
 
           // Set cached headers
-          if (cachedHeaders) {
+          if (true) {
             for (const [key, value] of Object.entries(cachedHeaders)) {
               reply.header(key, value as string);

[Survived] BlockStatement
src/middleware/autoCacheMiddleware.ts:149:30
           };
 
           // Set cached headers
-          if (cachedHeaders) {
-            for (const [key, value] of Object.entries(cachedHeaders)) {
-              reply.header(key, value as string);
-            }
-          }
+          if (cachedHeaders) {}
 
           // Add cache metadata headers

[Survived] BlockStatement
src/middleware/autoCacheMiddleware.ts:150:71
 
           // Set cached headers
           if (cachedHeaders) {
-            for (const [key, value] of Object.entries(cachedHeaders)) {
-              reply.header(key, value as string);
-            }
+            for (const [key, value] of Object.entries(cachedHeaders)) {}
           }
 

[Survived] ConditionalExpression
src/middleware/autoCacheMiddleware.ts:158:40
           // Add cache metadata headers
           reply.header("X-Cache", "HIT");
           reply.header("X-Cache-Key", cacheKey);
-          reply.header("X-Cache-Tags", config.tags?.join(",") || "");
+          reply.header("X-Cache-Tags", true);
 
           // Send cached response

[Survived] ConditionalExpression
src/middleware/autoCacheMiddleware.ts:158:40
           // Add cache metadata headers
           reply.header("X-Cache", "HIT");
           reply.header("X-Cache-Key", cacheKey);
-          reply.header("X-Cache-Tags", config.tags?.join(",") || "");
+          reply.header("X-Cache-Tags", false);
 
           // Send cached response

[Killed] ConditionalExpression
src/middleware/autoCacheMiddleware.ts:161:22
           reply.header("X-Cache-Tags", config.tags?.join(",") || "");
 
           // Send cached response
-          reply.code(statusCode || 200).send(body);
+          reply.code(true).send(body);
           return;
         }
killedBy: autoCacheMiddleware - Invalidation, Key Variations and Config Cache Invalidation should invalidate cache on POST requests
statusReason: expected 2 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/middleware/autoCacheMiddleware.ts:161:22
           reply.header("X-Cache-Tags", config.tags?.join(",") || "");
 
           // Send cached response
-          reply.code(statusCode || 200).send(body);
+          reply.code(false).send(body);
           return;
         }
killedBy: autoCacheMiddleware - Invalidation, Key Variations and Config Cache Invalidation should invalidate cache on POST requests
statusReason: expected 2 to be 1 // Object.is equality

[NoCoverage] BlockStatement
src/middleware/autoCacheMiddleware.ts:168:32
         // Cache miss (ok=true, value=null) - store key for use in response hook
         request._cacheKey = cacheKey;
         request._cacheConfig = config;
-      } catch (error: unknown) {
-        logger.error(`Cache read error: ${error}`);
-        // Continue without cache on error
-      }
+      } catch (error: unknown) {}
     });
 

[Killed] ConditionalExpression
src/middleware/autoCacheMiddleware.ts:189:13
         const cacheKey = request._cacheKey;
         const config = request._cacheConfig;
 
-        if (!cacheKey || !config) {
+        if (true) {
           done(null, payload);
           return;
killedBy: autoCacheMiddleware - Invalidation, Key Variations and Config Cache Invalidation should invalidate cache on POST requests
statusReason: expected 1 to be 2 // Object.is equality

[Killed] BlockStatement
src/middleware/autoCacheMiddleware.ts:189:35
         const cacheKey = request._cacheKey;
         const config = request._cacheConfig;
 
-        if (!cacheKey || !config) {
-          done(null, payload);
-          return;
-        }
+        if (!cacheKey || !config) {}
 
         // Only cache successful responses
killedBy: autoCacheMiddleware - Invalidation, Key Variations and Config Cache Invalidation should invalidate cache on POST requests
statusReason: expected undefined to be 1 // Object.is equality

[Killed] EqualityOperator
src/middleware/autoCacheMiddleware.ts:195:39
         }
 
         // Only cache successful responses
-        if (reply.statusCode < 200 || reply.statusCode >= 300) {
+        if (reply.statusCode < 200 || reply.statusCode < 300) {
           done(null, payload);
           return;
killedBy: autoCacheMiddleware - Invalidation, Key Variations and Config Cache Invalidation should invalidate cache on POST requests
statusReason: expected 2 to be 1 // Object.is equality

[Killed] EqualityOperator
src/middleware/autoCacheMiddleware.ts:195:13
         }
 
         // Only cache successful responses
-        if (reply.statusCode < 200 || reply.statusCode >= 300) {
+        if (reply.statusCode <= 200 || reply.statusCode >= 300) {
           done(null, payload);
           return;
killedBy: autoCacheMiddleware - Invalidation, Key Variations and Config Cache Invalidation should invalidate cache on POST requests
statusReason: expected 2 to be 1 // Object.is equality

[Survived] StringLiteral
src/middleware/autoCacheMiddleware.ts:201:33
         }
 
         // Add cache metadata headers BEFORE calling done (headers must be set before the response is sent)
-        reply.header("X-Cache", "MISS");
+        reply.header("X-Cache", "");
         reply.header("X-Cache-Key", cacheKey);
         reply.header("X-Cache-Tags", config.tags?.join(",") || "");

[Survived] StringLiteral
src/middleware/autoCacheMiddleware.ts:202:22
 
         // Add cache metadata headers BEFORE calling done (headers must be set before the response is sent)
         reply.header("X-Cache", "MISS");
-        reply.header("X-Cache-Key", cacheKey);
+        reply.header("", cacheKey);
         reply.header("X-Cache-Tags", config.tags?.join(",") || "");
 

[Survived] LogicalOperator
src/middleware/autoCacheMiddleware.ts:203:38
         // Add cache metadata headers BEFORE calling done (headers must be set before the response is sent)
         reply.header("X-Cache", "MISS");
         reply.header("X-Cache-Key", cacheKey);
-        reply.header("X-Cache-Tags", config.tags?.join(",") || "");
+        reply.header("X-Cache-Tags", config.tags?.join(",") && "");
 
         // Prepare cache data

[Survived] EqualityOperator
src/middleware/autoCacheMiddleware.ts:215:17
         // Cache the response in the background (fire-and-forget) — do NOT block done()
         cacheManager
           .set(cacheKey, cacheData, {
-            ...(config.ttl !== undefined && { ttl: config.ttl }),
+            ...(config.ttl === undefined && { ttl: config.ttl }),
             ...(config.tags !== undefined && { tags: config.tags }),
             ...(config.version !== undefined && { version: config.version }),

[Survived] LogicalOperator
src/middleware/autoCacheMiddleware.ts:215:17
         // Cache the response in the background (fire-and-forget) — do NOT block done()
         cacheManager
           .set(cacheKey, cacheData, {
-            ...(config.ttl !== undefined && { ttl: config.ttl }),
+            ...(config.ttl !== undefined || {
+  ttl: config.ttl
+}),
             ...(config.tags !== undefined && { tags: config.tags }),
             ...(config.version !== undefined && { version: config.version }),

[Killed] LogicalOperator
src/middleware/autoCacheMiddleware.ts:216:17
         cacheManager
           .set(cacheKey, cacheData, {
             ...(config.ttl !== undefined && { ttl: config.ttl }),
-            ...(config.tags !== undefined && { tags: config.tags }),
+            ...(config.tags !== undefined || {
+  tags: config.tags
+}),
             ...(config.version !== undefined && { version: config.version }),
           })
killedBy: autoCacheMiddleware - Invalidation, Key Variations and Config Cache Invalidation should invalidate cache on POST requests
statusReason: expected 1 to be 2 // Object.is equality

[Killed] EqualityOperator
src/middleware/autoCacheMiddleware.ts:216:17
         cacheManager
           .set(cacheKey, cacheData, {
             ...(config.ttl !== undefined && { ttl: config.ttl }),
-            ...(config.tags !== undefined && { tags: config.tags }),
+            ...(config.tags === undefined && { tags: config.tags }),
             ...(config.version !== undefined && { version: config.version }),
           })
killedBy: autoCacheMiddleware - Invalidation, Key Variations and Config Cache Invalidation should invalidate cache on POST requests
statusReason: expected 1 to be 2 // Object.is equality

[Survived] ConditionalExpression
src/middleware/autoCacheMiddleware.ts:217:17
           .set(cacheKey, cacheData, {
             ...(config.ttl !== undefined && { ttl: config.ttl }),
             ...(config.tags !== undefined && { tags: config.tags }),
-            ...(config.version !== undefined && { version: config.version }),
+            ...(true),
           })
           .then(() => {

[Survived] ConditionalExpression
src/middleware/autoCacheMiddleware.ts:217:17
           .set(cacheKey, cacheData, {
             ...(config.ttl !== undefined && { ttl: config.ttl }),
             ...(config.tags !== undefined && { tags: config.tags }),
-            ...(config.version !== undefined && { version: config.version }),
+            ...(true && { version: config.version }),
           })
           .then(() => {

[Survived] BlockStatement
src/middleware/autoCacheMiddleware.ts:219:23
             ...(config.tags !== undefined && { tags: config.tags }),
             ...(config.version !== undefined && { version: config.version }),
           })
-          .then(() => {
-            if (logCacheOps) {
-              logger.debug(
-                `Cache MISS (cached): ${cacheKey} (ttl: ${config.ttl}, tags: ${config.tags?.join(",")})`
-              );
-            }
-          })
+          .then(() => {})
           .catch((error: unknown) => {
             logger.error(`Cache write error: ${error}`);

[Survived] BlockStatement
src/middleware/autoCacheMiddleware.ts:220:30
             ...(config.version !== undefined && { version: config.version }),
           })
           .then(() => {
-            if (logCacheOps) {
-              logger.debug(
-                `Cache MISS (cached): ${cacheKey} (ttl: ${config.ttl}, tags: ${config.tags?.join(",")})`
-              );
-            }
+            if (logCacheOps) {}
           })
           .catch((error: unknown) => {

[Survived] ConditionalExpression
src/middleware/autoCacheMiddleware.ts:220:17
             ...(config.version !== undefined && { version: config.version }),
           })
           .then(() => {
-            if (logCacheOps) {
+            if (false) {
               logger.debug(
                 `Cache MISS (cached): ${cacheKey} (ttl: ${config.ttl}, tags: ${config.tags?.join(",")})`

[Survived] OptionalChaining
src/middleware/autoCacheMiddleware.ts:222:80
           .then(() => {
             if (logCacheOps) {
               logger.debug(
-                `Cache MISS (cached): ${cacheKey} (ttl: ${config.ttl}, tags: ${config.tags?.join(",")})`
+                `Cache MISS (cached): ${cacheKey} (ttl: ${config.ttl}, tags: ${config.tags.join(",")})`
               );
             }

[NoCoverage] BlockStatement
src/middleware/autoCacheMiddleware.ts:226:38
               );
             }
           })
-          .catch((error: unknown) => {
-            logger.error(`Cache write error: ${error}`);
-          });
+          .catch((error: unknown) => {});
 
         // Call done immediately — headers are already set above

[Killed] ConditionalExpression
src/middleware/autoCacheMiddleware.ts:240:7
   /**
    * Response hook for invalidating cache on mutations
    */
-  if (enableInvalidation) {
+  if (true) {
     fastify.addHook("onResponse", async (request: FastifyRequest, reply: FastifyReply) => {
       // Only invalidate on mutation methods
killedBy: autoCacheMiddleware - Invalidation, Key Variations and Config Cache Invalidation should invalidate cache on POST requests
statusReason: expected 1 to be 2 // Object.is equality

[Killed] ConditionalExpression
src/middleware/autoCacheMiddleware.ts:240:7
   /**
    * Response hook for invalidating cache on mutations
    */
-  if (enableInvalidation) {
+  if (false) {
     fastify.addHook("onResponse", async (request: FastifyRequest, reply: FastifyReply) => {
       // Only invalidate on mutation methods
killedBy: autoCacheMiddleware - Invalidation, Key Variations and Config Cache Invalidation should invalidate cache on POST requests
statusReason: expected 1 to be 2 // Object.is equality

[Killed] ConditionalExpression
src/middleware/autoCacheMiddleware.ts:243:11
   if (enableInvalidation) {
     fastify.addHook("onResponse", async (request: FastifyRequest, reply: FastifyReply) => {
       // Only invalidate on mutation methods
-      if (!["POST", "PUT", "DELETE", "PATCH"].includes(request.method)) {
+      if (true) {
         return;
       }
killedBy: autoCacheMiddleware - Invalidation, Key Variations and Config Cache Invalidation should invalidate cache on POST requests
statusReason: expected 1 to be 2 // Object.is equality

[Killed] ConditionalExpression
src/middleware/autoCacheMiddleware.ts:248:11
       }
 
       // Only invalidate on successful responses
-      if (reply.statusCode < 200 || reply.statusCode >= 300) {
+      if (false || reply.statusCode >= 300) {
         return;
       }
killedBy: autoCacheMiddleware - Invalidation, Key Variations and Config Cache Invalidation should invalidate cache on POST requests
statusReason: expected 2 to be 1 // Object.is equality

[Killed] EqualityOperator
src/middleware/autoCacheMiddleware.ts:248:11
       }
 
       // Only invalidate on successful responses
-      if (reply.statusCode < 200 || reply.statusCode >= 300) {
+      if (reply.statusCode >= 200 || reply.statusCode >= 300) {
         return;
       }
killedBy: autoCacheMiddleware - Invalidation, Key Variations and Config Cache Invalidation should invalidate cache on POST requests
statusReason: expected 1 to be 2 // Object.is equality

[Killed] EqualityOperator
src/middleware/autoCacheMiddleware.ts:255:11
       const route = request.routeOptions.url || request.url;
       const tags = getInvalidationTags(request.method, route);
 
-      if (tags.length === 0) {
+      if (tags.length !== 0) {
         return;
       }
killedBy: autoCacheMiddleware - Invalidation, Key Variations and Config Cache Invalidation should invalidate cache on POST requests
statusReason: expected 1 to be 2 // Object.is equality

[Killed] ConditionalExpression
src/middleware/autoCacheMiddleware.ts:255:11
       const route = request.routeOptions.url || request.url;
       const tags = getInvalidationTags(request.method, route);
 
-      if (tags.length === 0) {
+      if (true) {
         return;
       }
killedBy: autoCacheMiddleware - Invalidation, Key Variations and Config Cache Invalidation should invalidate cache on POST requests
statusReason: expected 1 to be 2 // Object.is equality

[Killed] BlockStatement
src/middleware/autoCacheMiddleware.ts:259:11
         return;
       }
 
-      try {
-        // Invalidate asynchronously (don't block response)
-        const invalidationPromises = tags.map((tag) => cacheManager.invalidateByTag(tag));
-
-        await Promise.all(invalidationPromises);
-
-        if (logCacheOps) {
-          logger.info(
-            `Cache invalidated: ${tags.join(", ")} (method: ${request.method}, route: ${route})`
-          );
-        }
-      } catch (error: unknown) {
+      try {} catch (error: unknown) {
         logger.error(`Cache invalidation error: ${error}`);
         // Don't fail the request if invalidation fails
killedBy: autoCacheMiddleware - Invalidation, Key Variations and Config Cache Invalidation should invalidate cache on POST requests
statusReason: expected 1 to be 2 // Object.is equality

[Killed] ArrowFunction
src/middleware/autoCacheMiddleware.ts:261:47
 
       try {
         // Invalidate asynchronously (don't block response)
-        const invalidationPromises = tags.map((tag) => cacheManager.invalidateByTag(tag));
+        const invalidationPromises = tags.map(() => undefined);
 
         await Promise.all(invalidationPromises);
killedBy: autoCacheMiddleware - Invalidation, Key Variations and Config Cache Invalidation should invalidate cache on POST requests
statusReason: expected 1 to be 2 // Object.is equality

[Survived] ConditionalExpression
src/middleware/autoCacheMiddleware.ts:265:13
 
         await Promise.all(invalidationPromises);
 
-        if (logCacheOps) {
+        if (false) {
           logger.info(
             `Cache invalidated: ${tags.join(", ")} (method: ${request.method}, route: ${route})`

[NoCoverage] BlockStatement
src/middleware/autoCacheMiddleware.ts:265:26
 
         await Promise.all(invalidationPromises);
 
-        if (logCacheOps) {
-          logger.info(
-            `Cache invalidated: ${tags.join(", ")} (method: ${request.method}, route: ${route})`
-          );
-        }
+        if (logCacheOps) {}
       } catch (error: unknown) {
         logger.error(`Cache invalidation error: ${error}`);
