[Survived] ConditionalExpression
src/content/ContentHandlers.ts:315:9
    */
   async createVersionSnapshot(ctx: RouteContext): Promise<void> {
     const paramsResult = await this.validateParams(ctx, PostIdParamsSchema);
-    if (!paramsResult.ok) return this.sendError(ctx, 400, "Invalid params");
+    if (false) return this.sendError(ctx, 400, "Invalid params");
     const { postId } = paramsResult.value;
 

[Killed] ConditionalExpression
src/content/ContentHandlers.ts:319:9
     const { postId } = paramsResult.value;
 
     const bodyResult = await this.validateBody(ctx, CreateVersionBodySchema);
-    if (!bodyResult.ok) return this.sendError(ctx, 400, "Validation failed");
+    if (false) return this.sendError(ctx, 400, "Validation failed");
     const { content, adaptations, createdBy, changelog, branchName, tags } = bodyResult.value;
 
killedBy: contentRoutes Unit Tests should return 400 for invalid version snapshot body
statusReason: expected 500 to be 400 // Object.is equality

[Killed] BooleanLiteral
src/content/ContentHandlers.ts:319:9
     const { postId } = paramsResult.value;
 
     const bodyResult = await this.validateBody(ctx, CreateVersionBodySchema);
-    if (!bodyResult.ok) return this.sendError(ctx, 400, "Validation failed");
+    if (bodyResult.ok) return this.sendError(ctx, 400, "Validation failed");
     const { content, adaptations, createdBy, changelog, branchName, tags } = bodyResult.value;
 
killedBy: contentRoutes Unit Tests should return 400 for invalid version snapshot body
statusReason: expected 500 to be 400 // Object.is equality

[Survived] LogicalOperator
src/content/ContentHandlers.ts:329:13
       adaptations as unknown as Record<ProviderId, CanonicalPost>,
       {
         createdBy,
-        ...(changelog !== undefined && { changelog }),
+        ...(changelog !== undefined || {
+  changelog
+}),
         ...(branchName !== undefined && { branchName }),
         ...(tags !== undefined && { tags }),

[Survived] ConditionalExpression
src/content/ContentHandlers.ts:329:13
       adaptations as unknown as Record<ProviderId, CanonicalPost>,
       {
         createdBy,
-        ...(changelog !== undefined && { changelog }),
+        ...(true),
         ...(branchName !== undefined && { branchName }),
         ...(tags !== undefined && { tags }),

[Survived] LogicalOperator
src/content/ContentHandlers.ts:330:13
       {
         createdBy,
         ...(changelog !== undefined && { changelog }),
-        ...(branchName !== undefined && { branchName }),
+        ...(branchName !== undefined || {
+  branchName
+}),
         ...(tags !== undefined && { tags }),
       }

[Survived] ConditionalExpression
src/content/ContentHandlers.ts:330:13
       {
         createdBy,
         ...(changelog !== undefined && { changelog }),
-        ...(branchName !== undefined && { branchName }),
+        ...(true),
         ...(tags !== undefined && { tags }),
       }

[Survived] ConditionalExpression
src/content/ContentHandlers.ts:331:13
         createdBy,
         ...(changelog !== undefined && { changelog }),
         ...(branchName !== undefined && { branchName }),
-        ...(tags !== undefined && { tags }),
+        ...(false),
       }
     );

[Survived] ConditionalExpression
src/content/ContentHandlers.ts:331:13
         createdBy,
         ...(changelog !== undefined && { changelog }),
         ...(branchName !== undefined && { branchName }),
-        ...(tags !== undefined && { tags }),
+        ...(true),
       }
     );

[Killed] BlockStatement
src/content/ContentHandlers.ts:347:58
    * POST /content/versions/:postId/restore/:versionId
    * Restore a post to a specific version, creating a new version record.
    */
-  async restoreVersion(ctx: RouteContext): Promise<void> {
-    const paramsResult = await this.validateParams(ctx, RestoreVersionParamsSchema);
-    if (!paramsResult.ok) return this.sendError(ctx, 400, "Invalid params");
-    const { versionId } = paramsResult.value;
-
-    const bodyResult = await this.validateBody(ctx, RestoreVersionBodySchema);
-    if (!bodyResult.ok) return this.sendError(ctx, 400, "Validation failed");
-    const { restoredBy } = bodyResult.value;
-
-    const manager = resolveVersionManager(ctx);
-    const result = await manager.restoreVersion(versionId, restoredBy);
-
-    if (!result.ok) {
-      const status = result.error.type === "validation" ? 404 : 500;
-      return this.sendError(ctx, status, result.error.message);
-    }
-
-    return this.sendSuccess(ctx, result.value);
-  }
+  async restoreVersion(ctx: RouteContext): Promise<void> {}
 
   /**
killedBy: contentRoutes Unit Tests should return 400 for missing restoredBy body in version restore
statusReason: expected 200 to be 400 // Object.is equality

[Killed] ConditionalExpression
src/content/ContentHandlers.ts:349:9
    */
   async restoreVersion(ctx: RouteContext): Promise<void> {
     const paramsResult = await this.validateParams(ctx, RestoreVersionParamsSchema);
-    if (!paramsResult.ok) return this.sendError(ctx, 400, "Invalid params");
+    if (true) return this.sendError(ctx, 400, "Invalid params");
     const { versionId } = paramsResult.value;
 
killedBy: contentRoutes Unit Tests should attempt to restore version with valid body
statusReason: expected false to be truthy

[Killed] BooleanLiteral
src/content/ContentHandlers.ts:349:9
    */
   async restoreVersion(ctx: RouteContext): Promise<void> {
     const paramsResult = await this.validateParams(ctx, RestoreVersionParamsSchema);
-    if (!paramsResult.ok) return this.sendError(ctx, 400, "Invalid params");
+    if (paramsResult.ok) return this.sendError(ctx, 400, "Invalid params");
     const { versionId } = paramsResult.value;
 
killedBy: contentRoutes Unit Tests should attempt to restore version with valid body
statusReason: expected false to be truthy

[Killed] BooleanLiteral
src/content/ContentHandlers.ts:353:9
     const { versionId } = paramsResult.value;
 
     const bodyResult = await this.validateBody(ctx, RestoreVersionBodySchema);
-    if (!bodyResult.ok) return this.sendError(ctx, 400, "Validation failed");
+    if (bodyResult.ok) return this.sendError(ctx, 400, "Validation failed");
     const { restoredBy } = bodyResult.value;
 
killedBy: contentRoutes Unit Tests should return 400 for missing restoredBy body in version restore
statusReason: expected 500 to be 400 // Object.is equality

[Killed] ConditionalExpression
src/content/ContentHandlers.ts:353:9
     const { versionId } = paramsResult.value;
 
     const bodyResult = await this.validateBody(ctx, RestoreVersionBodySchema);
-    if (!bodyResult.ok) return this.sendError(ctx, 400, "Validation failed");
+    if (false) return this.sendError(ctx, 400, "Validation failed");
     const { restoredBy } = bodyResult.value;
 
killedBy: contentRoutes Unit Tests should return 400 for missing restoredBy body in version restore
statusReason: expected 500 to be 400 // Object.is equality

[Killed] BlockStatement
src/content/ContentHandlers.ts:359:21
     const manager = resolveVersionManager(ctx);
     const result = await manager.restoreVersion(versionId, restoredBy);
 
-    if (!result.ok) {
-      const status = result.error.type === "validation" ? 404 : 500;
-      return this.sendError(ctx, status, result.error.message);
-    }
+    if (!result.ok) {}
 
     return this.sendSuccess(ctx, result.value);
killedBy: contentRoutes Unit Tests should attempt to restore version with valid body
statusReason: expected false to be truthy

[Survived] EqualityOperator
src/content/ContentHandlers.ts:360:22
     const result = await manager.restoreVersion(versionId, restoredBy);
 
     if (!result.ok) {
-      const status = result.error.type === "validation" ? 404 : 500;
+      const status = result.error.type !== "validation" ? 404 : 500;
       return this.sendError(ctx, status, result.error.message);
     }

[Survived] ConditionalExpression
src/content/ContentHandlers.ts:360:22
     const result = await manager.restoreVersion(versionId, restoredBy);
 
     if (!result.ok) {
-      const status = result.error.type === "validation" ? 404 : 500;
+      const status = false ? 404 : 500;
       return this.sendError(ctx, status, result.error.message);
     }

[Killed] BlockStatement
src/content/ContentHandlers.ts:371:59
    * POST /content/versions/compare
    * Compare two versions and return a structured diff.
    */
-  async compareVersions(ctx: RouteContext): Promise<void> {
-    const bodyResult = await this.validateBody(ctx, CompareVersionsBodySchema);
-    if (!bodyResult.ok) return this.sendError(ctx, 400, "Validation failed");
-    const { fromVersionId, toVersionId } = bodyResult.value;
-
-    const manager = resolveVersionManager(ctx);
-    const result = await manager.compareVersions(fromVersionId, toVersionId);
-
-    if (!result.ok) {
-      const status = result.error.type === "validation" ? 400 : 500;
-      return this.sendError(ctx, status, result.error.message);
-    }
-
-    return this.sendSuccess(ctx, result.value);
-  }
+  async compareVersions(ctx: RouteContext): Promise<void> {}
 }
 
killedBy: contentRoutes Unit Tests should return 400 for missing version IDs in compare
statusReason: expected 200 to be 400 // Object.is equality

[Killed] BooleanLiteral
src/content/ContentHandlers.ts:373:9
    */
   async compareVersions(ctx: RouteContext): Promise<void> {
     const bodyResult = await this.validateBody(ctx, CompareVersionsBodySchema);
-    if (!bodyResult.ok) return this.sendError(ctx, 400, "Validation failed");
+    if (bodyResult.ok) return this.sendError(ctx, 400, "Validation failed");
     const { fromVersionId, toVersionId } = bodyResult.value;
 
killedBy: contentRoutes Unit Tests should return 400 for missing version IDs in compare
statusReason: expected 500 to be 400 // Object.is equality

[Killed] ConditionalExpression
src/content/ContentHandlers.ts:373:9
    */
   async compareVersions(ctx: RouteContext): Promise<void> {
     const bodyResult = await this.validateBody(ctx, CompareVersionsBodySchema);
-    if (!bodyResult.ok) return this.sendError(ctx, 400, "Validation failed");
+    if (false) return this.sendError(ctx, 400, "Validation failed");
     const { fromVersionId, toVersionId } = bodyResult.value;
 
killedBy: contentRoutes Unit Tests should return 400 for missing version IDs in compare
statusReason: expected 500 to be 400 // Object.is equality

[Survived] StringLiteral
src/content/ContentHandlers.ts:395:25
  * Uses a shared ConflictDetector instance (stateless except for in-memory history).
  */
 export class ContentConflictHandlers extends BaseRouteHandler {
-  protected routeName = "content/conflicts";
+  protected routeName = "";
 
   private conflictDetector = new ConflictDetector();

[Killed] BlockStatement
src/content/ContentHandlers.ts:404:60
    * Apply user-supplied resolutions to a set of sync conflicts and resume
    * the associated transaction via SyncEngine.
    */
-  async resolveConflicts(ctx: RouteContext): Promise<void> {
-    const bodyResult = await this.validateBody(ctx, ResolveConflictsBodySchema);
-    if (!bodyResult.ok) return this.sendError(ctx, 400, "Validation failed");
-    const { transactionId, resolutions } = bodyResult.value;
-
-    const engine = resolveSyncEngine(ctx);
-    const result = await engine.resolveSyncConflicts(
-      transactionId,
-      resolutions.map((r) => ({
-        conflictId: r.conflictId,
-        resolution: r.resolution,
-        ...(r.resolvedValue !== undefined && { resolvedValue: r.resolvedValue }),
-      }))
-    );
-
-    if (!result.ok) {
-      const status = result.error.type === "validation" ? 400 : 500;
-      return this.sendError(ctx, status, result.error.message);
-    }
-
-    return this.sendSuccess(ctx, result.value);
-  }
+  async resolveConflicts(ctx: RouteContext): Promise<void> {}
 
   /**
killedBy: contentRoutes Unit Tests should return 400 for invalid conflict resolution body
statusReason: expected 200 to be 400 // Object.is equality

[Killed] ConditionalExpression
src/content/ContentHandlers.ts:406:9
    */
   async resolveConflicts(ctx: RouteContext): Promise<void> {
     const bodyResult = await this.validateBody(ctx, ResolveConflictsBodySchema);
-    if (!bodyResult.ok) return this.sendError(ctx, 400, "Validation failed");
+    if (false) return this.sendError(ctx, 400, "Validation failed");
     const { transactionId, resolutions } = bodyResult.value;
 
killedBy: contentRoutes Unit Tests should return 400 for invalid conflict resolution body
statusReason: expected 500 to be 400 // Object.is equality

[Killed] BooleanLiteral
src/content/ContentHandlers.ts:406:9
    */
   async resolveConflicts(ctx: RouteContext): Promise<void> {
     const bodyResult = await this.validateBody(ctx, ResolveConflictsBodySchema);
-    if (!bodyResult.ok) return this.sendError(ctx, 400, "Validation failed");
+    if (bodyResult.ok) return this.sendError(ctx, 400, "Validation failed");
     const { transactionId, resolutions } = bodyResult.value;
 
killedBy: contentRoutes Unit Tests should return 400 for invalid conflict resolution body
statusReason: expected 500 to be 400 // Object.is equality

[Survived] ArrowFunction
src/content/ContentHandlers.ts:412:23
     const engine = resolveSyncEngine(ctx);
     const result = await engine.resolveSyncConflicts(
       transactionId,
-      resolutions.map((r) => ({
-        conflictId: r.conflictId,
-        resolution: r.resolution,
-        ...(r.resolvedValue !== undefined && { resolvedValue: r.resolvedValue }),
-      }))
+      resolutions.map(() => undefined)
     );
 

[Survived] ConditionalExpression
src/content/ContentHandlers.ts:415:13
       resolutions.map((r) => ({
         conflictId: r.conflictId,
         resolution: r.resolution,
-        ...(r.resolvedValue !== undefined && { resolvedValue: r.resolvedValue }),
+        ...(true),
       }))
     );

[Survived] ConditionalExpression
src/content/ContentHandlers.ts:415:13
       resolutions.map((r) => ({
         conflictId: r.conflictId,
         resolution: r.resolution,
-        ...(r.resolvedValue !== undefined && { resolvedValue: r.resolvedValue }),
+        ...(true && { resolvedValue: r.resolvedValue }),
       }))
     );

[Killed] BlockStatement
src/content/ContentHandlers.ts:431:62
    * GET /content/conflicts/history/:channelId
    * Return in-memory conflict history for the given sync channel.
    */
-  async getConflictHistory(ctx: RouteContext): Promise<void> {
-    const paramsResult = await this.validateParams(ctx, ChannelIdParamsSchema);
-    if (!paramsResult.ok) return this.sendError(ctx, 400, "Invalid params");
-    const { channelId } = paramsResult.value;
-
-    const history = this.conflictDetector.getConflictHistory(channelId);
-    return this.sendSuccess(ctx, { channelId, conflicts: history });
-  }
+  async getConflictHistory(ctx: RouteContext): Promise<void> {}
 }
 
killedBy: contentRoutes Unit Tests should return conflict history for a channel (empty for new channel)
statusReason: Unexpected end of JSON input

[Killed] BooleanLiteral
src/content/ContentHandlers.ts:433:9
    */
   async getConflictHistory(ctx: RouteContext): Promise<void> {
     const paramsResult = await this.validateParams(ctx, ChannelIdParamsSchema);
-    if (!paramsResult.ok) return this.sendError(ctx, 400, "Invalid params");
+    if (paramsResult.ok) return this.sendError(ctx, 400, "Invalid params");
     const { channelId } = paramsResult.value;
 
killedBy: contentRoutes Unit Tests should return conflict history for a channel (empty for new channel)
statusReason: expected 400 to be 200 // Object.is equality

[Killed] ConditionalExpression
src/content/ContentHandlers.ts:433:9
    */
   async getConflictHistory(ctx: RouteContext): Promise<void> {
     const paramsResult = await this.validateParams(ctx, ChannelIdParamsSchema);
-    if (!paramsResult.ok) return this.sendError(ctx, 400, "Invalid params");
+    if (true) return this.sendError(ctx, 400, "Invalid params");
     const { channelId } = paramsResult.value;
 
killedBy: contentRoutes Unit Tests should return conflict history for a channel (empty for new channel)
statusReason: expected 400 to be 200 // Object.is equality

[Killed] ObjectLiteral
src/content/ContentHandlers.ts:437:34
     const { channelId } = paramsResult.value;
 
     const history = this.conflictDetector.getConflictHistory(channelId);
-    return this.sendSuccess(ctx, { channelId, conflicts: history });
+    return this.sendSuccess(ctx, {});
   }
 }
killedBy: contentRoutes Unit Tests should return conflict history for a channel (empty for new channel)
statusReason: expected false to be truthy

[Killed] BlockStatement
src/content/ContentHandlers.ts:455:60
    * POST /content/transform
    * Adapt canonical post content for a specific provider.
    */
-  async transformContent(ctx: RouteContext): Promise<void> {
-    const bodyResult = await this.validateBody(ctx, TransformBodySchema);
-    if (!bodyResult.ok) return this.sendError(ctx, 400, "Validation failed");
-    const { content, targetProvider, userPreferences } = bodyResult.value;
-
-    const adapter = resolvePlatformAdapter(ctx);
-    const result = await adapter.adaptForSingleProvider(
-      content as unknown as CanonicalPost,
-      targetProvider as ProviderId,
-      userPreferences as
-        | import("./platformContentAdapterTypes.js").UserAdaptationPreferences
-        | undefined
-    );
-
-    if (!result.ok) {
-      const status = result.error.type === "validation" ? 400 : 500;
-      return this.sendError(ctx, status, result.error.message);
-    }
-
-    // PlatformAdaptation.adaptedContent is the transformed CanonicalPost
-    return this.sendSuccess(ctx, result.value);
-  }
+  async transformContent(ctx: RouteContext): Promise<void> {}
 
   /**
killedBy: contentRoutes Unit Tests should return 400 for invalid transform body
statusReason: expected 200 to be 400 // Object.is equality

[Killed] ConditionalExpression
src/content/ContentHandlers.ts:457:9
    */
   async transformContent(ctx: RouteContext): Promise<void> {
     const bodyResult = await this.validateBody(ctx, TransformBodySchema);
-    if (!bodyResult.ok) return this.sendError(ctx, 400, "Validation failed");
+    if (true) return this.sendError(ctx, 400, "Validation failed");
     const { content, targetProvider, userPreferences } = bodyResult.value;
 
killedBy: contentRoutes Unit Tests should transform content for a single provider
statusReason: expected 400 to be 200 // Object.is equality

[Killed] ConditionalExpression
src/content/ContentHandlers.ts:457:9
    */
   async transformContent(ctx: RouteContext): Promise<void> {
     const bodyResult = await this.validateBody(ctx, TransformBodySchema);
-    if (!bodyResult.ok) return this.sendError(ctx, 400, "Validation failed");
+    if (false) return this.sendError(ctx, 400, "Validation failed");
     const { content, targetProvider, userPreferences } = bodyResult.value;
 
killedBy: contentRoutes Unit Tests should return 400 for invalid transform body
statusReason: expected 500 to be 400 // Object.is equality

[Killed] ConditionalExpression
src/content/ContentHandlers.ts:484:9
    */
   async renderForProvider(ctx: RouteContext): Promise<void> {
     const paramsResult = await this.validateParams(ctx, RenderParamsSchema);
-    if (!paramsResult.ok) return this.sendError(ctx, 400, "Invalid params");
+    if (true) return this.sendError(ctx, 400, "Invalid params");
     const { provider } = paramsResult.value;
 
killedBy: contentRoutes Unit Tests should render content for a provider
statusReason: expected 400 to be 200 // Object.is equality

[Killed] BooleanLiteral
src/content/ContentHandlers.ts:484:9
    */
   async renderForProvider(ctx: RouteContext): Promise<void> {
     const paramsResult = await this.validateParams(ctx, RenderParamsSchema);
-    if (!paramsResult.ok) return this.sendError(ctx, 400, "Invalid params");
+    if (paramsResult.ok) return this.sendError(ctx, 400, "Invalid params");
     const { provider } = paramsResult.value;
 
killedBy: contentRoutes Unit Tests should render content for a provider
statusReason: expected 400 to be 200 // Object.is equality

[Killed] BooleanLiteral
src/content/ContentHandlers.ts:488:9
     const { provider } = paramsResult.value;
 
     const bodyResult = await this.validateBody(ctx, RenderBodySchema);
-    if (!bodyResult.ok) return this.sendError(ctx, 400, "Validation failed");
+    if (bodyResult.ok) return this.sendError(ctx, 400, "Validation failed");
     const { content } = bodyResult.value;
 
killedBy: contentRoutes Unit Tests should return 400 for invalid render body
statusReason: expected 500 to be 400 // Object.is equality

[Killed] ConditionalExpression
src/content/ContentHandlers.ts:488:9
     const { provider } = paramsResult.value;
 
     const bodyResult = await this.validateBody(ctx, RenderBodySchema);
-    if (!bodyResult.ok) return this.sendError(ctx, 400, "Validation failed");
+    if (true) return this.sendError(ctx, 400, "Validation failed");
     const { content } = bodyResult.value;
 
killedBy: contentRoutes Unit Tests should render content for a provider
statusReason: expected 400 to be 200 // Object.is equality

[Killed] MethodExpression
src/content/ContentHandlers.ts:520:32
   async transformForMultipleProviders(ctx: RouteContext): Promise<void> {
     const MultiTransformSchema = z.object({
       content: z.record(z.string(), z.unknown()),
-      targetProviders: z.array(z.string().min(1)).min(1),
+      targetProviders: z.array(z.string().max(1)).min(1),
     });
 
killedBy: contentRoutes Unit Tests should transform content for multiple providers
statusReason: expected 400 to be 200 // Object.is equality

[Killed] MethodExpression
src/content/ContentHandlers.ts:520:24
   async transformForMultipleProviders(ctx: RouteContext): Promise<void> {
     const MultiTransformSchema = z.object({
       content: z.record(z.string(), z.unknown()),
-      targetProviders: z.array(z.string().min(1)).min(1),
+      targetProviders: z.array(z.string().min(1)).max(1),
     });
 
killedBy: contentRoutes Unit Tests should transform content for multiple providers
statusReason: expected 400 to be 200 // Object.is equality

[Killed] BooleanLiteral
src/content/ContentHandlers.ts:524:9
     });
 
     const bodyResult = await this.validateBody(ctx, MultiTransformSchema);
-    if (!bodyResult.ok) return this.sendError(ctx, 400, "Validation failed");
+    if (bodyResult.ok) return this.sendError(ctx, 400, "Validation failed");
     const { content, targetProviders } = bodyResult.value;
 
killedBy: contentRoutes Unit Tests should return 400 for invalid multi-transform body
statusReason: expected 500 to be 400 // Object.is equality

[Killed] ConditionalExpression
src/content/ContentHandlers.ts:524:9
     });
 
     const bodyResult = await this.validateBody(ctx, MultiTransformSchema);
-    if (!bodyResult.ok) return this.sendError(ctx, 400, "Validation failed");
+    if (true) return this.sendError(ctx, 400, "Validation failed");
     const { content, targetProviders } = bodyResult.value;
 
killedBy: contentRoutes Unit Tests should transform content for multiple providers
statusReason: expected 400 to be 200 // Object.is equality

[Survived] BlockStatement
src/content/ContentHandlers.ts:540:66
 
     // Convert Map to plain object for JSON serialisation
     const adaptations: Record<string, unknown> = {};
-    for (const [provider, adaptation] of result.value.entries()) {
-      adaptations[provider] = adaptation;
-    }
+    for (const [provider, adaptation] of result.value.entries()) {}
 
     return this.sendSuccess(ctx, { adaptations });

[Killed] ConditionalExpression
src/content/ContentHandlers.ts:553:9
    */
   async calculateDiff(ctx: RouteContext): Promise<void> {
     const bodyResult = await this.validateBody(ctx, DiffBodySchema);
-    if (!bodyResult.ok) return this.sendError(ctx, 400, "Validation failed");
+    if (false) return this.sendError(ctx, 400, "Validation failed");
     const { fromVersion, toVersion } = bodyResult.value;
 
killedBy: contentRoutes Unit Tests should return 400 for invalid diff body
statusReason: expected 500 to be 400 // Object.is equality

[Killed] BooleanLiteral
src/content/ContentHandlers.ts:553:9
    */
   async calculateDiff(ctx: RouteContext): Promise<void> {
     const bodyResult = await this.validateBody(ctx, DiffBodySchema);
-    if (!bodyResult.ok) return this.sendError(ctx, 400, "Validation failed");
+    if (bodyResult.ok) return this.sendError(ctx, 400, "Validation failed");
     const { fromVersion, toVersion } = bodyResult.value;
 
killedBy: contentRoutes Unit Tests should return 400 for invalid diff body
statusReason: expected 500 to be 400 // Object.is equality

[Survived] StringLiteral
src/content/ContentHandlers.ts:570:13
     const diffs = this.diffCalculator.generateDiff(
       {
         ...fromVersionObj,
-        id: "",
+        id: "Stryker was here!",
         postId: "",
         version: 0,

[Survived] BooleanLiteral
src/content/ContentHandlers.ts:575:19
         version: 0,
         createdAt: new Date(),
         createdBy: "",
-        isActive: false,
+        isActive: true,
       },
       {

[Survived] StringLiteral
src/content/ContentHandlers.ts:580:17
       {
         ...toVersionObj,
         id: "",
-        postId: "",
+        postId: "Stryker was here!",
         version: 0,
         createdAt: new Date(),

[Killed] BlockStatement
src/content/ContentHandlers.ts:597:62
    * POST /content/transform/recommendations
    * Return adaptation recommendations for content across target providers.
    */
-  async getRecommendations(ctx: RouteContext): Promise<void> {
-    const RecommendationsSchema = z.object({
-      content: z.record(z.string(), z.unknown()),
-      targetProviders: z.array(z.string().min(1)).min(1),
-    });
-
-    const bodyResult = await this.validateBody(ctx, RecommendationsSchema);
-    if (!bodyResult.ok) return this.sendError(ctx, 400, "Validation failed");
-    const { content, targetProviders } = bodyResult.value;
-
-    const adapter = resolvePlatformAdapter(ctx);
-    const recommendations = await adapter.getAdaptationRecommendations(
-      content as unknown as CanonicalPost,
-      targetProviders as ProviderId[]
-    );
-
-    // Convert Map to plain object for JSON serialisation
-    const result: Record<string, string[]> = {};
-    for (const [provider, recs] of recommendations.entries()) {
-      result[provider] = recs;
-    }
-
-    return this.sendSuccess(ctx, { recommendations: result });
-  }
+  async getRecommendations(ctx: RouteContext): Promise<void> {}
 }
 
killedBy: contentRoutes Unit Tests should return 400 for invalid recommendations body
statusReason: expected 200 to be 400 // Object.is equality

[Killed] ObjectLiteral
src/content/ContentHandlers.ts:598:44
    * Return adaptation recommendations for content across target providers.
    */
   async getRecommendations(ctx: RouteContext): Promise<void> {
-    const RecommendationsSchema = z.object({
-      content: z.record(z.string(), z.unknown()),
-      targetProviders: z.array(z.string().min(1)).min(1),
-    });
+    const RecommendationsSchema = z.object({});
 
     const bodyResult = await this.validateBody(ctx, RecommendationsSchema);
killedBy: contentRoutes Unit Tests should return 400 for invalid recommendations body
statusReason: expected 500 to be 400 // Object.is equality

[Killed] ConditionalExpression
src/content/ContentHandlers.ts:604:9
     });
 
     const bodyResult = await this.validateBody(ctx, RecommendationsSchema);
-    if (!bodyResult.ok) return this.sendError(ctx, 400, "Validation failed");
+    if (true) return this.sendError(ctx, 400, "Validation failed");
     const { content, targetProviders } = bodyResult.value;
 
killedBy: contentRoutes Unit Tests should return adaptation recommendations
statusReason: expected 400 to be 200 // Object.is equality

[Killed] BooleanLiteral
src/content/ContentHandlers.ts:604:9
     });
 
     const bodyResult = await this.validateBody(ctx, RecommendationsSchema);
-    if (!bodyResult.ok) return this.sendError(ctx, 400, "Validation failed");
+    if (bodyResult.ok) return this.sendError(ctx, 400, "Validation failed");
     const { content, targetProviders } = bodyResult.value;
 
killedBy: contentRoutes Unit Tests should return 400 for invalid recommendations body
statusReason: expected 500 to be 400 // Object.is equality

[Survived] BlockStatement
src/content/ContentHandlers.ts:615:63
 
     // Convert Map to plain object for JSON serialisation
     const result: Record<string, string[]> = {};
-    for (const [provider, recs] of recommendations.entries()) {
-      result[provider] = recs;
-    }
+    for (const [provider, recs] of recommendations.entries()) {}
 
     return this.sendSuccess(ctx, { recommendations: result });
