[Survived] BlockStatement
src/content/MergeManager.ts:325:94
     }
   }
 
-  private async emitMergeEvent(eventType: string, mergeRequest: MergeRequest): Promise<void> {
-    await this.eventService.publishEvent({
-      id: this.generateId(),
-      type: eventType,
-      aggregateId: mergeRequest.postId,
-      aggregateType: "MergeRequest",
-      version: 1,
-      data: { mergeRequest },
-      metadata: { source: "MergeManager" },
-      timestamp: new Date(),
-    });
-  }
+  private async emitMergeEvent(eventType: string, mergeRequest: MergeRequest): Promise<void> {}
 
   private generateId(): string {

[Survived] StringLiteral
src/content/MergeManager.ts:330:22
       id: this.generateId(),
       type: eventType,
       aggregateId: mergeRequest.postId,
-      aggregateType: "MergeRequest",
+      aggregateType: "",
       version: 1,
       data: { mergeRequest },

[Survived] ObjectLiteral
src/content/MergeManager.ts:332:13
       aggregateId: mergeRequest.postId,
       aggregateType: "MergeRequest",
       version: 1,
-      data: { mergeRequest },
+      data: {},
       metadata: { source: "MergeManager" },
       timestamp: new Date(),

[Survived] ObjectLiteral
src/content/MergeManager.ts:333:17
       aggregateType: "MergeRequest",
       version: 1,
       data: { mergeRequest },
-      metadata: { source: "MergeManager" },
+      metadata: {},
       timestamp: new Date(),
     });
