[Killed] BlockStatement
src/content/PlatformContentAdapter.ts:29:97
   private strategy: PlatformContentAdapterStrategy;
   private validation: PlatformContentAdapterValidation;
 
-  constructor(dependencies: { prisma: PrismaClient; redis: Redis; eventService: EventService }) {
-    this.core = new PlatformContentAdapterCore(dependencies);
-
-    const generateId = () => this.core.generateId();
-
-    this.strategy = new PlatformContentAdapterStrategy(
-      dependencies.prisma,
-      dependencies.redis,
-      dependencies.eventService,
-      generateId
-    );
-
-    this.validation = new PlatformContentAdapterValidation(
-      dependencies.redis,
-      dependencies.eventService,
-      generateId
-    );
-
-    // Wire modules together
-    this.core.strategyModule = this.strategy;
-    this.core.validationModule = this.validation;
-  }
+  constructor(dependencies: { prisma: PrismaClient; redis: Redis; eventService: EventService }) {}
 
   async initialize(): Promise<void> {
killedBy: contentRoutes Unit Tests should transform content for a single provider
statusReason: expected 500 to be 200 // Object.is equality

[Timeout] ArrowFunction
src/content/PlatformContentAdapter.ts:32:24
   constructor(dependencies: { prisma: PrismaClient; redis: Redis; eventService: EventService }) {
     this.core = new PlatformContentAdapterCore(dependencies);
 
-    const generateId = () => this.core.generateId();
+    const generateId = () => undefined;
 
     this.strategy = new PlatformContentAdapterStrategy(

[Timeout] BlockStatement
src/content/PlatformContentAdapter.ts:52:37
     this.core.validationModule = this.validation;
   }
 
-  async initialize(): Promise<void> {
-    try {
-      await this.strategy.initialize();
-    } catch (error) {
-      logger.error({ err: error }, "Failed to initialize Platform Content Adapter");
-      throw error;
-    }
-  }
+  async initialize(): Promise<void> {}
 
   async adaptForProviders(

[Timeout] BlockStatement
src/content/PlatformContentAdapter.ts:53:9
   }
 
   async initialize(): Promise<void> {
-    try {
-      await this.strategy.initialize();
-    } catch (error) {
+    try {} catch (error) {
       logger.error({ err: error }, "Failed to initialize Platform Content Adapter");
       throw error;

[NoCoverage] BlockStatement
src/content/PlatformContentAdapter.ts:55:21
   async initialize(): Promise<void> {
     try {
       await this.strategy.initialize();
-    } catch (error) {
-      logger.error({ err: error }, "Failed to initialize Platform Content Adapter");
-      throw error;
-    }
+    } catch (error) {}
   }
 

[NoCoverage] ObjectLiteral
src/content/PlatformContentAdapter.ts:56:20
     try {
       await this.strategy.initialize();
     } catch (error) {
-      logger.error({ err: error }, "Failed to initialize Platform Content Adapter");
+      logger.error({}, "Failed to initialize Platform Content Adapter");
       throw error;
     }

[Killed] BlockStatement
src/content/PlatformContentAdapter.ts:65:72
     content: CanonicalPost,
     targetProviders: ProviderId[],
     userPreferences?: UserAdaptationPreferences
-  ): Promise<OrchestrationResult<Map<ProviderId, PlatformAdaptation>>> {
-    return this.core.adaptForProviders(content, targetProviders, userPreferences);
-  }
+  ): Promise<OrchestrationResult<Map<ProviderId, PlatformAdaptation>>> {}
 
   async adaptForSingleProvider(
killedBy: contentRoutes Unit Tests should transform content for multiple providers
statusReason: expected 500 to be 200 // Object.is equality

[Killed] BlockStatement
src/content/PlatformContentAdapter.ts:73:55
     content: CanonicalPost,
     providerId: ProviderId,
     userPreferences?: UserAdaptationPreferences
-  ): Promise<OrchestrationResult<PlatformAdaptation>> {
-    return this.core.adaptForSingleProvider(content, providerId, userPreferences);
-  }
+  ): Promise<OrchestrationResult<PlatformAdaptation>> {}
 
   async optimizeForEngagement(
killedBy: contentRoutes Unit Tests should transform content for a single provider
statusReason: expected 500 to be 200 // Object.is equality

[NoCoverage] BlockStatement
src/content/PlatformContentAdapter.ts:81:55
     content: CanonicalPost,
     providerId: ProviderId,
     audienceData?: any
-  ): Promise<OrchestrationResult<PlatformAdaptation>> {
-    return this.core.optimizeForEngagement(content, providerId, audienceData);
-  }
+  ): Promise<OrchestrationResult<PlatformAdaptation>> {}
 
   async reverseAdaptation(

[NoCoverage] BlockStatement
src/content/PlatformContentAdapter.ts:87:50
 
   async reverseAdaptation(
     adaptation: PlatformAdaptation
-  ): Promise<OrchestrationResult<CanonicalPost>> {
-    return this.core.reverseAdaptation(adaptation);
-  }
+  ): Promise<OrchestrationResult<CanonicalPost>> {}
 
   async getAdaptationRecommendations(

[Killed] BlockStatement
src/content/PlatformContentAdapter.ts:94:41
   async getAdaptationRecommendations(
     content: CanonicalPost,
     targetProviders: ProviderId[]
-  ): Promise<Map<ProviderId, string[]>> {
-    return this.core.getAdaptationRecommendations(content, targetProviders);
-  }
+  ): Promise<Map<ProviderId, string[]>> {}
 }
 
killedBy: contentRoutes Unit Tests should return adaptation recommendations
statusReason: expected 500 to be 200 // Object.is equality
