[NoCoverage] EqualityOperator
src/content/SyncEngineImpl.ts:295:47
   protected findExistingChannel(source: ProviderId, target: ProviderId): SyncChannel | undefined {
     return Array.from(this.syncChannels.values()).find(
       (channel) =>
-        (channel.sourceProvider === source && channel.targetProvider === target) ||
+        (channel.sourceProvider === source && channel.targetProvider !== target) ||
         (channel.bidirectional &&
           channel.sourceProvider === target &&

[NoCoverage] ConditionalExpression
src/content/SyncEngineImpl.ts:296:10
     return Array.from(this.syncChannels.values()).find(
       (channel) =>
         (channel.sourceProvider === source && channel.targetProvider === target) ||
-        (channel.bidirectional &&
-          channel.sourceProvider === target &&
-          channel.targetProvider === source)
+        (false)
     );
   }

[NoCoverage] LogicalOperator
src/content/SyncEngineImpl.ts:296:10
     return Array.from(this.syncChannels.values()).find(
       (channel) =>
         (channel.sourceProvider === source && channel.targetProvider === target) ||
-        (channel.bidirectional &&
-          channel.sourceProvider === target &&
-          channel.targetProvider === source)
+        (channel.bidirectional && channel.sourceProvider === target || channel.targetProvider === source)
     );
   }

[NoCoverage] EqualityOperator
src/content/SyncEngineImpl.ts:297:11
       (channel) =>
         (channel.sourceProvider === source && channel.targetProvider === target) ||
         (channel.bidirectional &&
-          channel.sourceProvider === target &&
+          channel.sourceProvider !== target &&
           channel.targetProvider === source)
     );

[NoCoverage] ConditionalExpression
src/content/SyncEngineImpl.ts:297:11
       (channel) =>
         (channel.sourceProvider === source && channel.targetProvider === target) ||
         (channel.bidirectional &&
-          channel.sourceProvider === target &&
+          true &&
           channel.targetProvider === source)
     );

[NoCoverage] EqualityOperator
src/content/SyncEngineImpl.ts:298:11
         (channel.sourceProvider === source && channel.targetProvider === target) ||
         (channel.bidirectional &&
           channel.sourceProvider === target &&
-          channel.targetProvider === source)
+          channel.targetProvider !== source)
     );
   }

[NoCoverage] ConditionalExpression
src/content/SyncEngineImpl.ts:298:11
         (channel.sourceProvider === source && channel.targetProvider === target) ||
         (channel.bidirectional &&
           channel.sourceProvider === target &&
-          channel.targetProvider === source)
+          true)
     );
   }

[Survived] BlockStatement
src/content/SyncEngineImpl.ts:302:73
     );
   }
 
-  protected async storeSyncChannel(channel: SyncChannel): Promise<void> {
-    await this.redis.setex(
-      `sync:channel:${channel.id}`,
-      86400 * 7, // 7 days
-      JSON.stringify(channel)
-    );
-  }
+  protected async storeSyncChannel(channel: SyncChannel): Promise<void> {}
 
   protected async setupChannelMonitoring(channel: SyncChannel): Promise<void> {

[Survived] StringLiteral
src/content/SyncEngineImpl.ts:304:7
 
   protected async storeSyncChannel(channel: SyncChannel): Promise<void> {
     await this.redis.setex(
-      `sync:channel:${channel.id}`,
+      ``,
       86400 * 7, // 7 days
       JSON.stringify(channel)

[Survived] ArithmeticOperator
src/content/SyncEngineImpl.ts:305:7
   protected async storeSyncChannel(channel: SyncChannel): Promise<void> {
     await this.redis.setex(
       `sync:channel:${channel.id}`,
-      86400 * 7, // 7 days
+      86400 / 7, // 7 days
       JSON.stringify(channel)
     );

[Survived] BlockStatement
src/content/SyncEngineImpl.ts:310:79
     );
   }
 
-  protected async setupChannelMonitoring(channel: SyncChannel): Promise<void> {
-    // Setup monitoring for this specific channel
-    logger.debug(
-      { channelName: channel.name, channelId: channel.id },
-      "Monitoring setup for channel"
-    );
-  }
+  protected async setupChannelMonitoring(channel: SyncChannel): Promise<void> {}
 
   protected async startContentChangeMonitoring(postId: string): Promise<void> {

[Survived] StringLiteral
src/content/SyncEngineImpl.ts:314:7
     // Setup monitoring for this specific channel
     logger.debug(
       { channelName: channel.name, channelId: channel.id },
-      "Monitoring setup for channel"
+      ""
     );
   }

[NoCoverage] BlockStatement
src/content/SyncEngineImpl.ts:318:79
     );
   }
 
-  protected async startContentChangeMonitoring(postId: string): Promise<void> {
-    // Setup content change monitoring for a specific post
-    logger.debug({ postId }, "Started content change monitoring for post");
-  }
+  protected async startContentChangeMonitoring(postId: string): Promise<void> {}
 
   private async processContentChangeMessage(fields: string[]): Promise<void> {

[NoCoverage] StringLiteral
src/content/SyncEngineImpl.ts:320:30
 
   protected async startContentChangeMonitoring(postId: string): Promise<void> {
     // Setup content change monitoring for a specific post
-    logger.debug({ postId }, "Started content change monitoring for post");
+    logger.debug({ postId }, "");
   }
 

[NoCoverage] BlockStatement
src/content/SyncEngineImpl.ts:323:78
     logger.debug({ postId }, "Started content change monitoring for post");
   }
 
-  private async processContentChangeMessage(fields: string[]): Promise<void> {
-    try {
-      const data = this.parseRedisFields(fields);
-      const { postId, changes, providerId } = data;
-
-      if (postId && changes && providerId) {
-        await this.handleContentChange(postId, JSON.parse(changes), providerId as ProviderId);
-      }
-    } catch (error) {
-      logger.error({ err: error }, "Error processing content change message");
-    }
-  }
+  private async processContentChangeMessage(fields: string[]): Promise<void> {}
 
   private parseRedisFields(fields: string[]): Record<string, string> {

[NoCoverage] BlockStatement
src/content/SyncEngineImpl.ts:324:9
   }
 
   private async processContentChangeMessage(fields: string[]): Promise<void> {
-    try {
-      const data = this.parseRedisFields(fields);
-      const { postId, changes, providerId } = data;
-
-      if (postId && changes && providerId) {
-        await this.handleContentChange(postId, JSON.parse(changes), providerId as ProviderId);
-      }
-    } catch (error) {
+    try {} catch (error) {
       logger.error({ err: error }, "Error processing content change message");
     }

[NoCoverage] LogicalOperator
src/content/SyncEngineImpl.ts:328:11
       const data = this.parseRedisFields(fields);
       const { postId, changes, providerId } = data;
 
-      if (postId && changes && providerId) {
+      if (postId && changes || providerId) {
         await this.handleContentChange(postId, JSON.parse(changes), providerId as ProviderId);
       }

[NoCoverage] ConditionalExpression
src/content/SyncEngineImpl.ts:328:11
       const data = this.parseRedisFields(fields);
       const { postId, changes, providerId } = data;
 
-      if (postId && changes && providerId) {
+      if (false) {
         await this.handleContentChange(postId, JSON.parse(changes), providerId as ProviderId);
       }

[NoCoverage] BlockStatement
src/content/SyncEngineImpl.ts:331:21
       if (postId && changes && providerId) {
         await this.handleContentChange(postId, JSON.parse(changes), providerId as ProviderId);
       }
-    } catch (error) {
-      logger.error({ err: error }, "Error processing content change message");
-    }
+    } catch (error) {}
   }
 

[NoCoverage] StringLiteral
src/content/SyncEngineImpl.ts:332:36
         await this.handleContentChange(postId, JSON.parse(changes), providerId as ProviderId);
       }
     } catch (error) {
-      logger.error({ err: error }, "Error processing content change message");
+      logger.error({ err: error }, "");
     }
   }

[NoCoverage] BlockStatement
src/content/SyncEngineImpl.ts:336:70
     }
   }
 
-  private parseRedisFields(fields: string[]): Record<string, string> {
-    const result: Record<string, string> = {};
-    for (let i = 0; i < fields.length; i += 2) {
-      const key = fields[i];
-      const value = fields[i + 1];
-      if (key !== undefined && value !== undefined) {
-        result[key] = value;
-      }
-    }
-    return result;
-  }
+  private parseRedisFields(fields: string[]): Record<string, string> {}
 
   private async getContentForProvider(

[NoCoverage] AssignmentOperator
src/content/SyncEngineImpl.ts:338:40
 
   private parseRedisFields(fields: string[]): Record<string, string> {
     const result: Record<string, string> = {};
-    for (let i = 0; i < fields.length; i += 2) {
+    for (let i = 0; i < fields.length; i -= 2) {
       const key = fields[i];
       const value = fields[i + 1];

[NoCoverage] ConditionalExpression
src/content/SyncEngineImpl.ts:338:21
 
   private parseRedisFields(fields: string[]): Record<string, string> {
     const result: Record<string, string> = {};
-    for (let i = 0; i < fields.length; i += 2) {
+    for (let i = 0; false; i += 2) {
       const key = fields[i];
       const value = fields[i + 1];

[NoCoverage] ArithmeticOperator
src/content/SyncEngineImpl.ts:340:28
     const result: Record<string, string> = {};
     for (let i = 0; i < fields.length; i += 2) {
       const key = fields[i];
-      const value = fields[i + 1];
+      const value = fields[i - 1];
       if (key !== undefined && value !== undefined) {
         result[key] = value;

[NoCoverage] ConditionalExpression
src/content/SyncEngineImpl.ts:341:11
     for (let i = 0; i < fields.length; i += 2) {
       const key = fields[i];
       const value = fields[i + 1];
-      if (key !== undefined && value !== undefined) {
+      if (false) {
         result[key] = value;
       }

[NoCoverage] BlockStatement
src/content/SyncEngineImpl.ts:341:53
     for (let i = 0; i < fields.length; i += 2) {
       const key = fields[i];
       const value = fields[i + 1];
-      if (key !== undefined && value !== undefined) {
-        result[key] = value;
-      }
+      if (key !== undefined && value !== undefined) {}
     }
     return result;

[NoCoverage] BlockStatement
src/content/SyncEngineImpl.ts:351:36
   private async getContentForProvider(
     postId: string,
     _providerId: ProviderId
-  ): Promise<CanonicalPost | null> {
-    // Get content from database for the given post
-    try {
-      const post = await this.prisma.post.findUnique({
-        where: { id: postId },
-        include: { contents: true },
-      });
-
-      if (!post) return null;
-
-      const content = post.contents[0];
-      return {
-        id: post.id,
-        projectId: post.projectId,
-        locale: (content?.locale as "es" | "en") || "en",
-        body: content?.body || "",
-      };
-    } catch {
-      return null;
-    }
-  }
+  ): Promise<CanonicalPost | null> {}
 
   private async detectChanges(

[NoCoverage] BlockStatement
src/content/SyncEngineImpl.ts:353:9
     _providerId: ProviderId
   ): Promise<CanonicalPost | null> {
     // Get content from database for the given post
-    try {
-      const post = await this.prisma.post.findUnique({
-        where: { id: postId },
-        include: { contents: true },
-      });
-
-      if (!post) return null;
-
-      const content = post.contents[0];
-      return {
-        id: post.id,
-        projectId: post.projectId,
-        locale: (content?.locale as "es" | "en") || "en",
-        body: content?.body || "",
-      };
-    } catch {
+    try {} catch {
       return null;
     }

[NoCoverage] BooleanLiteral
src/content/SyncEngineImpl.ts:356:30
     try {
       const post = await this.prisma.post.findUnique({
         where: { id: postId },
-        include: { contents: true },
+        include: { contents: false },
       });
 

[NoCoverage] ObjectLiteral
src/content/SyncEngineImpl.ts:356:18
     try {
       const post = await this.prisma.post.findUnique({
         where: { id: postId },
-        include: { contents: true },
+        include: {},
       });
 

[NoCoverage] ConditionalExpression
src/content/SyncEngineImpl.ts:359:11
         include: { contents: true },
       });
 
-      if (!post) return null;
+      if (false) return null;
 
       const content = post.contents[0];

[NoCoverage] ConditionalExpression
src/content/SyncEngineImpl.ts:359:11
         include: { contents: true },
       });
 
-      if (!post) return null;
+      if (true) return null;
 
       const content = post.contents[0];

[NoCoverage] ObjectLiteral
src/content/SyncEngineImpl.ts:362:14
       if (!post) return null;
 
       const content = post.contents[0];
-      return {
-        id: post.id,
-        projectId: post.projectId,
-        locale: (content?.locale as "es" | "en") || "en",
-        body: content?.body || "",
-      };
+      return {};
     } catch {
       return null;

[NoCoverage] ConditionalExpression
src/content/SyncEngineImpl.ts:365:17
       return {
         id: post.id,
         projectId: post.projectId,
-        locale: (content?.locale as "es" | "en") || "en",
+        locale: true,
         body: content?.body || "",
       };

[NoCoverage] ConditionalExpression
src/content/SyncEngineImpl.ts:365:17
       return {
         id: post.id,
         projectId: post.projectId,
-        locale: (content?.locale as "es" | "en") || "en",
+        locale: false,
         body: content?.body || "",
       };

[NoCoverage] LogicalOperator
src/content/SyncEngineImpl.ts:366:15
         id: post.id,
         projectId: post.projectId,
         locale: (content?.locale as "es" | "en") || "en",
-        body: content?.body || "",
+        body: content?.body && "",
       };
     } catch {

[NoCoverage] ConditionalExpression
src/content/SyncEngineImpl.ts:366:15
         id: post.id,
         projectId: post.projectId,
         locale: (content?.locale as "es" | "en") || "en",
-        body: content?.body || "",
+        body: true,
       };
     } catch {

[NoCoverage] BlockStatement
src/content/SyncEngineImpl.ts:377:28
     _sourceContent: CanonicalPost,
     _targetContent: CanonicalPost | null,
     _channel: SyncChannel
-  ): Promise<SyncChange[]> {
-    // Detect changes between source and target content
-    return []; // Placeholder
-  }
+  ): Promise<SyncChange[]> {}
 
   private async detectConflicts(

[NoCoverage] BlockStatement
src/content/SyncEngineImpl.ts:385:30
   private async detectConflicts(
     _changes: SyncChange[],
     _channel: SyncChannel
-  ): Promise<SyncConflict[]> {
-    // Detect conflicts in the changes
-    return []; // Placeholder
-  }
+  ): Promise<SyncConflict[]> {}
 
   private async handleSyncConflicts(

[NoCoverage] BlockStatement
src/content/SyncEngineImpl.ts:393:20
   private async handleSyncConflicts(
     transaction: SyncTransaction,
     conflicts: SyncConflict[]
-  ): Promise<void> {
-    // Handle detected conflicts
-    logger.info(
-      { conflictCount: conflicts.length, transactionId: transaction.id },
-      "Handling sync conflicts"
-    );
-  }
+  ): Promise<void> {}
 
   private async applyChanges(transaction: SyncTransaction, _channel: SyncChannel): Promise<void> {

[NoCoverage] BlockStatement
src/content/SyncEngineImpl.ts:401:98
     );
   }
 
-  private async applyChanges(transaction: SyncTransaction, _channel: SyncChannel): Promise<void> {
-    // Apply changes to target provider
-    logger.debug(
-      { changeCount: transaction.changes.length, transactionId: transaction.id },
-      "Applying sync changes"
-    );
-  }
+  private async applyChanges(transaction: SyncTransaction, _channel: SyncChannel): Promise<void> {}
 
   private async applyRealtimeChanges(

[NoCoverage] BlockStatement
src/content/SyncEngineImpl.ts:413:20
     transaction: SyncTransaction,
     changes: VersionDiff[],
     _channel: SyncChannel
-  ): Promise<void> {
-    // Apply real-time changes
-    logger.debug(
-      { changeCount: changes.length, transactionId: transaction.id },
-      "Applying real-time changes"
-    );
-  }
+  ): Promise<void> {}
 
   private async filterChanges(

[NoCoverage] StringLiteral
src/content/SyncEngineImpl.ts:417:7
     // Apply real-time changes
     logger.debug(
       { changeCount: changes.length, transactionId: transaction.id },
-      "Applying real-time changes"
+      ""
     );
   }

[NoCoverage] BlockStatement
src/content/SyncEngineImpl.ts:424:29
   private async filterChanges(
     changes: VersionDiff[],
     _syncRules: SyncRule[]
-  ): Promise<VersionDiff[]> {
-    // Filter changes based on sync rules
-    return changes; // Placeholder
-  }
+  ): Promise<VersionDiff[]> {}
 
   protected async resumeSyncTransaction(transaction: SyncTransaction): Promise<void> {

[NoCoverage] BlockStatement
src/content/SyncEngineImpl.ts:429:86
     return changes; // Placeholder
   }
 
-  protected async resumeSyncTransaction(transaction: SyncTransaction): Promise<void> {
-    // Resume transaction after conflict resolution
-    logger.info({ transactionId: transaction.id }, "Resuming sync transaction");
-  }
+  protected async resumeSyncTransaction(transaction: SyncTransaction): Promise<void> {}
 
   protected async executeRollback(rollbackPlan: SyncRollbackPlan): Promise<void> {

[NoCoverage] ObjectLiteral
src/content/SyncEngineImpl.ts:431:17
 
   protected async resumeSyncTransaction(transaction: SyncTransaction): Promise<void> {
     // Resume transaction after conflict resolution
-    logger.info({ transactionId: transaction.id }, "Resuming sync transaction");
+    logger.info({}, "Resuming sync transaction");
   }
 

[NoCoverage] BlockStatement
src/content/SyncEngineImpl.ts:434:82
     logger.info({ transactionId: transaction.id }, "Resuming sync transaction");
   }
 
-  protected async executeRollback(rollbackPlan: SyncRollbackPlan): Promise<void> {
-    // Execute rollback plan
-    logger.info({ rollbackPlanId: rollbackPlan.id }, "Executing sync rollback");
-  }
+  protected async executeRollback(rollbackPlan: SyncRollbackPlan): Promise<void> {}
 
   private async handleProviderStatusChange(providerId: ProviderId, status: string): Promise<void> {

[NoCoverage] BlockStatement
src/content/SyncEngineImpl.ts:439:99
     logger.info({ rollbackPlanId: rollbackPlan.id }, "Executing sync rollback");
   }
 
-  private async handleProviderStatusChange(providerId: ProviderId, status: string): Promise<void> {
-    // Handle provider status changes
-    logger.info({ providerId, status }, "Provider status changed");
-  }
+  private async handleProviderStatusChange(providerId: ProviderId, status: string): Promise<void> {}
 
   private async updateChannelMetrics(channelId: string, success: boolean): Promise<void> {

[NoCoverage] StringLiteral
src/content/SyncEngineImpl.ts:441:41
 
   private async handleProviderStatusChange(providerId: ProviderId, status: string): Promise<void> {
     // Handle provider status changes
-    logger.info({ providerId, status }, "Provider status changed");
+    logger.info({ providerId, status }, "");
   }
 

[NoCoverage] BlockStatement
src/content/SyncEngineImpl.ts:444:90
     logger.info({ providerId, status }, "Provider status changed");
   }
 
-  private async updateChannelMetrics(channelId: string, success: boolean): Promise<void> {
-    // Update channel performance metrics
-    const channel = this.syncChannels.get(channelId);
-    if (channel) {
-      if (success) {
-        channel.errorCount = Math.max(0, channel.errorCount - 1);
-      } else {
-        channel.errorCount++;
-      }
-
-      // Recalculate success rate (placeholder logic)
-      channel.successRate = Math.max(0.1, 1 - channel.errorCount * 0.1);
-    }
-  }
+  private async updateChannelMetrics(channelId: string, success: boolean): Promise<void> {}
 
   protected async getChannelMetrics(_channelId: string): Promise<SyncMetrics> {

[NoCoverage] ConditionalExpression
src/content/SyncEngineImpl.ts:447:9
   private async updateChannelMetrics(channelId: string, success: boolean): Promise<void> {
     // Update channel performance metrics
     const channel = this.syncChannels.get(channelId);
-    if (channel) {
+    if (false) {
       if (success) {
         channel.errorCount = Math.max(0, channel.errorCount - 1);

[NoCoverage] BlockStatement
src/content/SyncEngineImpl.ts:447:18
   private async updateChannelMetrics(channelId: string, success: boolean): Promise<void> {
     // Update channel performance metrics
     const channel = this.syncChannels.get(channelId);
-    if (channel) {
-      if (success) {
-        channel.errorCount = Math.max(0, channel.errorCount - 1);
-      } else {
-        channel.errorCount++;
-      }
-
-      // Recalculate success rate (placeholder logic)
-      channel.successRate = Math.max(0.1, 1 - channel.errorCount * 0.1);
-    }
+    if (channel) {}
   }
 

[NoCoverage] ConditionalExpression
src/content/SyncEngineImpl.ts:448:11
     // Update channel performance metrics
     const channel = this.syncChannels.get(channelId);
     if (channel) {
-      if (success) {
+      if (false) {
         channel.errorCount = Math.max(0, channel.errorCount - 1);
       } else {

[NoCoverage] ConditionalExpression
src/content/SyncEngineImpl.ts:448:11
     // Update channel performance metrics
     const channel = this.syncChannels.get(channelId);
     if (channel) {
-      if (success) {
+      if (true) {
         channel.errorCount = Math.max(0, channel.errorCount - 1);
       } else {

[NoCoverage] ArithmeticOperator
src/content/SyncEngineImpl.ts:449:42
     const channel = this.syncChannels.get(channelId);
     if (channel) {
       if (success) {
-        channel.errorCount = Math.max(0, channel.errorCount - 1);
+        channel.errorCount = Math.max(0, channel.errorCount + 1);
       } else {
         channel.errorCount++;

[NoCoverage] MethodExpression
src/content/SyncEngineImpl.ts:449:30
     const channel = this.syncChannels.get(channelId);
     if (channel) {
       if (success) {
-        channel.errorCount = Math.max(0, channel.errorCount - 1);
+        channel.errorCount = Math.min(0, channel.errorCount - 1);
       } else {
         channel.errorCount++;

[NoCoverage] BlockStatement
src/content/SyncEngineImpl.ts:450:14
     if (channel) {
       if (success) {
         channel.errorCount = Math.max(0, channel.errorCount - 1);
-      } else {
-        channel.errorCount++;
-      }
+      } else {}
 
       // Recalculate success rate (placeholder logic)

[NoCoverage] UpdateOperator
src/content/SyncEngineImpl.ts:451:9
       if (success) {
         channel.errorCount = Math.max(0, channel.errorCount - 1);
       } else {
-        channel.errorCount++;
+        channel.errorCount--;
       }
 

[NoCoverage] ArithmeticOperator
src/content/SyncEngineImpl.ts:455:43
       }
 
       // Recalculate success rate (placeholder logic)
-      channel.successRate = Math.max(0.1, 1 - channel.errorCount * 0.1);
+      channel.successRate = Math.max(0.1, 1 + channel.errorCount * 0.1);
     }
   }

[NoCoverage] ArithmeticOperator
src/content/SyncEngineImpl.ts:455:47
       }
 
       // Recalculate success rate (placeholder logic)
-      channel.successRate = Math.max(0.1, 1 - channel.errorCount * 0.1);
+      channel.successRate = Math.max(0.1, 1 - channel.errorCount / 0.1);
     }
   }

[Killed] BlockStatement
src/content/SyncEngineImpl.ts:459:79
     }
   }
 
-  protected async getChannelMetrics(_channelId: string): Promise<SyncMetrics> {
-    // Get metrics for specific channel
-    return this.getDefaultMetrics();
-  }
+  protected async getChannelMetrics(_channelId: string): Promise<SyncMetrics> {}
 
   protected async getGlobalMetrics(): Promise<SyncMetrics> {
killedBy: contentRoutes Unit Tests should return per-channel sync metrics
statusReason: expected false to be truthy

[Killed] BlockStatement
src/content/SyncEngineImpl.ts:464:60
     return this.getDefaultMetrics();
   }
 
-  protected async getGlobalMetrics(): Promise<SyncMetrics> {
-    // Get global sync metrics
-    return this.getDefaultMetrics();
-  }
+  protected async getGlobalMetrics(): Promise<SyncMetrics> {}
 
   protected getDefaultMetrics(): SyncMetrics {
killedBy: contentRoutes Unit Tests should return global sync metrics
statusReason: expected false to be truthy

[Killed] BlockStatement
src/content/SyncEngineImpl.ts:469:46
     return this.getDefaultMetrics();
   }
 
-  protected getDefaultMetrics(): SyncMetrics {
-    return {
-      totalTransactions: 0,
-      successfulSyncs: 0,
-      failedSyncs: 0,
-      conflictsDetected: 0,
-      conflictsResolved: 0,
-      averageSyncTime: 0,
-      dataTransferred: 0,
-      lastSyncDuration: 0,
-    };
-  }
+  protected getDefaultMetrics(): SyncMetrics {}
 
   private async collectAndStoreMetrics(): Promise<void> {
killedBy: contentRoutes Unit Tests should return global sync metrics
statusReason: expected false to be truthy

[NoCoverage] BlockStatement
src/content/SyncEngineImpl.ts:482:57
     };
   }
 
-  private async collectAndStoreMetrics(): Promise<void> {
-    // Collect and store metrics periodically
-    const metrics = await this.getGlobalMetrics();
-    await this.redis.setex("sync:metrics:global", 300, JSON.stringify(metrics));
-  }
+  private async collectAndStoreMetrics(): Promise<void> {}
 
   protected async emitSyncEvent(event: RealtimeSyncEvent): Promise<void> {

[NoCoverage] BlockStatement
src/content/SyncEngineImpl.ts:488:74
     await this.redis.setex("sync:metrics:global", 300, JSON.stringify(metrics));
   }
 
-  protected async emitSyncEvent(event: RealtimeSyncEvent): Promise<void> {
-    await this.eventService.publishEvent({
-      id: event.id,
-      type: event.type,
-      aggregateId: event.postId,
-      aggregateType: "SyncEngine",
-      version: 1,
-      data: event.data,
-      metadata: {
-        source: "SyncEngine",
-        providerId: event.providerId,
-        ...event.metadata,
-      },
-      timestamp: event.timestamp,
-    });
-  }
+  protected async emitSyncEvent(event: RealtimeSyncEvent): Promise<void> {}
 
   protected generateId(): string {

[Survived] BlockStatement
src/content/SyncEngineImpl.ts:505:34
     });
   }
 
-  protected generateId(): string {
-    return `sync_${randomUUID()}`;
-  }
+  protected generateId(): string {}
 }
 
