[Killed] ArrowFunction
src/content/contentRoutes.ts:73:41
    * Body: { channelId, direction? }
    * Returns the created SyncTransaction record.
    */
-  fastify.post("/content/sync/:postId", async (request, reply) =>
-    syncHandlers.syncPost({ request, reply })
+  fastify.post("/content/sync/:postId", () => undefined
   );
 
killedBy: contentRoutes Unit Tests should return 400 for missing channelId when syncing a post
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] ArrowFunction
src/content/contentRoutes.ts:82:40
    *
    * Return global sync metrics (total transactions, success/fail counts, etc.).
    */
-  fastify.get("/content/sync/metrics", async (request, reply) =>
-    syncHandlers.getSyncMetrics({ request, reply })
+  fastify.get("/content/sync/metrics", () => undefined
   );
 
killedBy: contentRoutes Unit Tests should return global sync metrics
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] StringLiteral
src/content/contentRoutes.ts:82:15
    *
    * Return global sync metrics (total transactions, success/fail counts, etc.).
    */
-  fastify.get("/content/sync/metrics", async (request, reply) =>
+  fastify.get("", async (request, reply) =>
     syncHandlers.getSyncMetrics({ request, reply })
   );
killedBy: contentRoutes Unit Tests should return global sync metrics; contentRoutes Unit Tests should return per-channel sync metrics; contentRoutes Unit Tests should return 400 for missing channelId when syncing a post
statusReason: The path could not be empty

[Killed] ObjectLiteral
src/content/contentRoutes.ts:83:33
    * Return global sync metrics (total transactions, success/fail counts, etc.).
    */
   fastify.get("/content/sync/metrics", async (request, reply) =>
-    syncHandlers.getSyncMetrics({ request, reply })
+    syncHandlers.getSyncMetrics({})
   );
 
killedBy: contentRoutes Unit Tests should return global sync metrics
statusReason: expected 500 to be 200 // Object.is equality

[Killed] ArrowFunction
src/content/contentRoutes.ts:91:51
    *
    * Return sync metrics scoped to a single channel.
    */
-  fastify.get("/content/sync/metrics/:channelId", async (request, reply) =>
-    syncHandlers.getSyncMetrics({ request, reply })
+  fastify.get("/content/sync/metrics/:channelId", () => undefined
   );
 
killedBy: contentRoutes Unit Tests should return per-channel sync metrics
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] StringLiteral
src/content/contentRoutes.ts:91:15
    *
    * Return sync metrics scoped to a single channel.
    */
-  fastify.get("/content/sync/metrics/:channelId", async (request, reply) =>
+  fastify.get("", async (request, reply) =>
     syncHandlers.getSyncMetrics({ request, reply })
   );
killedBy: contentRoutes Unit Tests should return global sync metrics; contentRoutes Unit Tests should return per-channel sync metrics; contentRoutes Unit Tests should return 400 for missing channelId when syncing a post
statusReason: The path could not be empty

[Killed] ArrowFunction
src/content/contentRoutes.ts:100:57
    *
    * Roll back an active sync transaction (requires a rollbackPlan to be set).
    */
-  fastify.post("/content/sync/:transactionId/rollback", async (request, reply) =>
-    syncHandlers.rollbackTransaction({ request, reply })
+  fastify.post("/content/sync/:transactionId/rollback", () => undefined
   );
 
killedBy: contentRoutes Unit Tests should attempt rollback for a non-existent transaction
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] StringLiteral
src/content/contentRoutes.ts:100:16
    *
    * Roll back an active sync transaction (requires a rollbackPlan to be set).
    */
-  fastify.post("/content/sync/:transactionId/rollback", async (request, reply) =>
+  fastify.post("", async (request, reply) =>
     syncHandlers.rollbackTransaction({ request, reply })
   );
killedBy: contentRoutes Unit Tests should return global sync metrics; contentRoutes Unit Tests should return per-channel sync metrics; contentRoutes Unit Tests should return 400 for missing channelId when syncing a post
statusReason: The path could not be empty

[Killed] ArrowFunction
src/content/contentRoutes.ts:113:37
    * Body: { name, sourceProvider, targetProvider, bidirectional?, configuration? }
    * Returns: SyncChannel
    */
-  fastify.post("/content/channels", async (request, reply) =>
-    channelHandlers.createChannel({ request, reply })
+  fastify.post("/content/channels", () => undefined
   );
 
killedBy: contentRoutes Unit Tests should return 400 for invalid channel creation body
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] ArrowFunction
src/content/contentRoutes.ts:123:52
    * Subscribe a post to real-time synchronisation across a set of channels.
    * Body: { postId, channelIds[] }
    */
-  fastify.post("/content/channels/realtime/start", async (request, reply) =>
-    channelHandlers.startRealtimeSync({ request, reply })
+  fastify.post("/content/channels/realtime/start", () => undefined
   );
 
killedBy: contentRoutes Unit Tests should return 400 for invalid realtime start body
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] ArrowFunction
src/content/contentRoutes.ts:132:59
    *
    * Unsubscribe a post from real-time synchronisation.
    */
-  fastify.post("/content/channels/realtime/stop/:postId", async (request, reply) =>
-    channelHandlers.stopRealtimeSync({ request, reply })
+  fastify.post("/content/channels/realtime/stop/:postId", () => undefined
   );
 
killedBy: contentRoutes Unit Tests should stop realtime sync for a post
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] StringLiteral
src/content/contentRoutes.ts:132:16
    *
    * Unsubscribe a post from real-time synchronisation.
    */
-  fastify.post("/content/channels/realtime/stop/:postId", async (request, reply) =>
+  fastify.post("", async (request, reply) =>
     channelHandlers.stopRealtimeSync({ request, reply })
   );
killedBy: contentRoutes Unit Tests should return global sync metrics; contentRoutes Unit Tests should return per-channel sync metrics; contentRoutes Unit Tests should return 400 for missing channelId when syncing a post
statusReason: The path could not be empty

[Killed] ObjectLiteral
src/content/contentRoutes.ts:133:38
    * Unsubscribe a post from real-time synchronisation.
    */
   fastify.post("/content/channels/realtime/stop/:postId", async (request, reply) =>
-    channelHandlers.stopRealtimeSync({ request, reply })
+    channelHandlers.stopRealtimeSync({})
   );
 
killedBy: contentRoutes Unit Tests should stop realtime sync for a post
statusReason: expected 500 to be 200 // Object.is equality

[Killed] ArrowFunction
src/content/contentRoutes.ts:144:44
    * List version history for a post.
    * Query params: branch (string), limit (number)
    */
-  fastify.get("/content/versions/:postId", async (request, reply) =>
-    versionHandlers.listVersions({ request, reply })
+  fastify.get("/content/versions/:postId", () => undefined
   );
 
killedBy: contentRoutes Unit Tests should return empty version history for a non-existent post
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] ObjectLiteral
src/content/contentRoutes.ts:145:34
    * Query params: branch (string), limit (number)
    */
   fastify.get("/content/versions/:postId", async (request, reply) =>
-    versionHandlers.listVersions({ request, reply })
+    versionHandlers.listVersions({})
   );
 
killedBy: contentRoutes Unit Tests should return empty version history for a non-existent post
statusReason: expected 500 to be 200 // Object.is equality

[Killed] ArrowFunction
src/content/contentRoutes.ts:155:45
    * Body: { content, adaptations?, createdBy, changelog?, branchName?, tags? }
    * Returns: ContentVersion (201)
    */
-  fastify.post("/content/versions/:postId", async (request, reply) =>
-    versionHandlers.createVersionSnapshot({ request, reply })
+  fastify.post("/content/versions/:postId", () => undefined
   );
 
killedBy: contentRoutes Unit Tests should return 400 for invalid version snapshot body
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] ObjectLiteral
src/content/contentRoutes.ts:156:43
    * Returns: ContentVersion (201)
    */
   fastify.post("/content/versions/:postId", async (request, reply) =>
-    versionHandlers.createVersionSnapshot({ request, reply })
+    versionHandlers.createVersionSnapshot({})
   );
 
killedBy: contentRoutes Unit Tests should return 400 for invalid version snapshot body
statusReason: expected 500 to be 400 // Object.is equality

[Killed] ArrowFunction
src/content/contentRoutes.ts:167:64
    * Body: { restoredBy }
    * Returns: ContentVersion
    */
-  fastify.post("/content/versions/:postId/restore/:versionId", async (request, reply) =>
-    versionHandlers.restoreVersion({ request, reply })
+  fastify.post("/content/versions/:postId/restore/:versionId", () => undefined
   );
 
killedBy: contentRoutes Unit Tests should return 400 for missing restoredBy body in version restore
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] StringLiteral
src/content/contentRoutes.ts:167:16
    * Body: { restoredBy }
    * Returns: ContentVersion
    */
-  fastify.post("/content/versions/:postId/restore/:versionId", async (request, reply) =>
+  fastify.post("", async (request, reply) =>
     versionHandlers.restoreVersion({ request, reply })
   );
killedBy: contentRoutes Unit Tests should return global sync metrics; contentRoutes Unit Tests should return per-channel sync metrics; contentRoutes Unit Tests should return 400 for missing channelId when syncing a post
statusReason: The path could not be empty

[Killed] ArrowFunction
src/content/contentRoutes.ts:177:45
    * Compare two versions by ID and return a structured VersionDiff array.
    * Body: { fromVersionId, toVersionId }
    */
-  fastify.post("/content/versions/compare", async (request, reply) =>
-    versionHandlers.compareVersions({ request, reply })
+  fastify.post("/content/versions/compare", () => undefined
   );
 
killedBy: contentRoutes Unit Tests should return 400 for missing version IDs in compare
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] ArrowFunction
src/content/contentRoutes.ts:190:46
    * Body: { transactionId, resolutions[] }
    * Returns: SyncTransaction
    */
-  fastify.post("/content/conflicts/resolve", async (request, reply) =>
-    conflictHandlers.resolveConflicts({ request, reply })
+  fastify.post("/content/conflicts/resolve", () => undefined
   );
 
killedBy: contentRoutes Unit Tests should return 400 for invalid conflict resolution body
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] StringLiteral
src/content/contentRoutes.ts:190:16
    * Body: { transactionId, resolutions[] }
    * Returns: SyncTransaction
    */
-  fastify.post("/content/conflicts/resolve", async (request, reply) =>
+  fastify.post("", async (request, reply) =>
     conflictHandlers.resolveConflicts({ request, reply })
   );
killedBy: contentRoutes Unit Tests should return global sync metrics; contentRoutes Unit Tests should return per-channel sync metrics; contentRoutes Unit Tests should return 400 for missing channelId when syncing a post
statusReason: The path could not be empty

[Killed] ObjectLiteral
src/content/contentRoutes.ts:191:39
    * Returns: SyncTransaction
    */
   fastify.post("/content/conflicts/resolve", async (request, reply) =>
-    conflictHandlers.resolveConflicts({ request, reply })
+    conflictHandlers.resolveConflicts({})
   );
 
killedBy: contentRoutes Unit Tests should return 400 for invalid conflict resolution body
statusReason: expected 500 to be 400 // Object.is equality

[Killed] ArrowFunction
src/content/contentRoutes.ts:200:56
    * Return the in-memory conflict history accumulated by the ConflictDetector
    * for the given sync channel.
    */
-  fastify.get("/content/conflicts/history/:channelId", async (request, reply) =>
-    conflictHandlers.getConflictHistory({ request, reply })
+  fastify.get("/content/conflicts/history/:channelId", () => undefined
   );
 
killedBy: contentRoutes Unit Tests should return conflict history for a channel (empty for new channel)
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] ArrowFunction
src/content/contentRoutes.ts:213:38
    * Body: { content, targetProvider, userPreferences? }
    * Returns: PlatformAdaptation
    */
-  fastify.post("/content/transform", async (request, reply) =>
-    transformHandlers.transformContent({ request, reply })
+  fastify.post("/content/transform", () => undefined
   );
 
killedBy: contentRoutes Unit Tests should return 400 for invalid transform body
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] StringLiteral
src/content/contentRoutes.ts:213:16
    * Body: { content, targetProvider, userPreferences? }
    * Returns: PlatformAdaptation
    */
-  fastify.post("/content/transform", async (request, reply) =>
+  fastify.post("", async (request, reply) =>
     transformHandlers.transformContent({ request, reply })
   );
killedBy: contentRoutes Unit Tests should return global sync metrics; contentRoutes Unit Tests should return per-channel sync metrics; contentRoutes Unit Tests should return 400 for missing channelId when syncing a post
statusReason: The path could not be empty

[Killed] ArrowFunction
src/content/contentRoutes.ts:224:44
    * Body: { content, targetProviders[] }
    * Returns: { adaptations: Record<ProviderId, PlatformAdaptation> }
    */
-  fastify.post("/content/transform/multi", async (request, reply) =>
-    transformHandlers.transformForMultipleProviders({ request, reply })
+  fastify.post("/content/transform/multi", () => undefined
   );
 
killedBy: contentRoutes Unit Tests should return 400 for invalid multi-transform body
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] StringLiteral
src/content/contentRoutes.ts:224:16
    * Body: { content, targetProviders[] }
    * Returns: { adaptations: Record<ProviderId, PlatformAdaptation> }
    */
-  fastify.post("/content/transform/multi", async (request, reply) =>
+  fastify.post("", async (request, reply) =>
     transformHandlers.transformForMultipleProviders({ request, reply })
   );
killedBy: contentRoutes Unit Tests should return global sync metrics; contentRoutes Unit Tests should return per-channel sync metrics; contentRoutes Unit Tests should return 400 for missing channelId when syncing a post
statusReason: The path could not be empty

[Killed] ArrowFunction
src/content/contentRoutes.ts:236:54
    * Body: { content, targetProviders[] }
    * Returns: { recommendations: Record<ProviderId, string[]> }
    */
-  fastify.post("/content/transform/recommendations", async (request, reply) =>
-    transformHandlers.getRecommendations({ request, reply })
+  fastify.post("/content/transform/recommendations", () => undefined
   );
 
killedBy: contentRoutes Unit Tests should return 400 for invalid recommendations body
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] ArrowFunction
src/content/contentRoutes.ts:247:45
    * Returns the adapted content alongside applied rules, confidence score,
    * and any warnings — useful for building a live preview UI.
    */
-  fastify.post("/content/render/:provider", async (request, reply) =>
-    transformHandlers.renderForProvider({ request, reply })
+  fastify.post("/content/render/:provider", () => undefined
   );
 
killedBy: contentRoutes Unit Tests should return 400 for invalid render body
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] StringLiteral
src/content/contentRoutes.ts:247:16
    * Returns the adapted content alongside applied rules, confidence score,
    * and any warnings — useful for building a live preview UI.
    */
-  fastify.post("/content/render/:provider", async (request, reply) =>
+  fastify.post("", async (request, reply) =>
     transformHandlers.renderForProvider({ request, reply })
   );
killedBy: contentRoutes Unit Tests should return global sync metrics; contentRoutes Unit Tests should return per-channel sync metrics; contentRoutes Unit Tests should return 400 for missing channelId when syncing a post
statusReason: The path could not be empty

[Killed] ObjectLiteral
src/content/contentRoutes.ts:248:41
    * and any warnings — useful for building a live preview UI.
    */
   fastify.post("/content/render/:provider", async (request, reply) =>
-    transformHandlers.renderForProvider({ request, reply })
+    transformHandlers.renderForProvider({})
   );
 
killedBy: contentRoutes Unit Tests should return 400 for invalid render body
statusReason: expected 500 to be 400 // Object.is equality

[Killed] ArrowFunction
src/content/contentRoutes.ts:259:33
    * Body: { fromVersion, toVersion }
    * Returns: { diffs: VersionDiff[], summary }
    */
-  fastify.post("/content/diff", async (request, reply) =>
-    transformHandlers.calculateDiff({ request, reply })
+  fastify.post("/content/diff", () => undefined
   );
 
killedBy: contentRoutes Unit Tests should return 400 for invalid diff body
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] StringLiteral
src/content/contentRoutes.ts:259:16
    * Body: { fromVersion, toVersion }
    * Returns: { diffs: VersionDiff[], summary }
    */
-  fastify.post("/content/diff", async (request, reply) =>
+  fastify.post("", async (request, reply) =>
     transformHandlers.calculateDiff({ request, reply })
   );
killedBy: contentRoutes Unit Tests should return global sync metrics; contentRoutes Unit Tests should return per-channel sync metrics; contentRoutes Unit Tests should return 400 for missing channelId when syncing a post
statusReason: The path could not be empty

[Survived] StringLiteral
src/content/contentRoutes.ts:263:12
     transformHandlers.calculateDiff({ request, reply })
   );
 
-  log.info("Content sync routes registered (F28)");
+  log.info("");
 };
 
