[Killed] BlockStatement
src/middleware/metricsMiddleware.ts:11:98
 export function createMetricsMiddleware(apiMetrics: ApiMetrics) {
   return {
     // Pre-handler hook to start request tracking
-    preHandler: (request: FastifyRequest, reply: FastifyReply, done: HookHandlerDoneFunction) => {
-      const requestId = request.id;
-      const correlationId = apiMetrics.generateCorrelationId(requestId);
-
-      // Add correlation ID to request context
-      request.correlationId = correlationId;
-
-      // Start request tracking
-      const finishRequest = apiMetrics.recordRequest(
-        request.method,
-        request.routeOptions?.url || request.url
-      );
-      request.finishRequest = finishRequest;
-
-      // Track endpoint-specific metrics
-      const endpoint = request.routeOptions?.url || request.url;
-      const finishEndpoint = apiMetrics.recordEndpointRequest(endpoint, request.method);
-      request.finishEndpoint = finishEndpoint;
-
-      done();
-    },
+    preHandler: (request: FastifyRequest, reply: FastifyReply, done: HookHandlerDoneFunction) => {},
 
     // Response hook to complete request tracking
killedBy: metricsMiddleware Tests preHandler - Request Initialization should generate and attach correlation ID
statusReason: expected undefined to be truthy

[Killed] OptionalChaining
src/middleware/metricsMiddleware.ts:21:9
       // Start request tracking
       const finishRequest = apiMetrics.recordRequest(
         request.method,
-        request.routeOptions?.url || request.url
+        request.routeOptions.url || request.url
       );
       request.finishRequest = finishRequest;
killedBy: metricsMiddleware Tests preHandler - Request Initialization should fallback to url when routeOptions.url not available
statusReason: Cannot read properties of undefined (reading 'url')

[Survived] ConditionalExpression
src/middleware/metricsMiddleware.ts:21:9
       // Start request tracking
       const finishRequest = apiMetrics.recordRequest(
         request.method,
-        request.routeOptions?.url || request.url
+        false
       );
       request.finishRequest = finishRequest;

[Killed] OptionalChaining
src/middleware/metricsMiddleware.ts:26:24
       request.finishRequest = finishRequest;
 
       // Track endpoint-specific metrics
-      const endpoint = request.routeOptions?.url || request.url;
+      const endpoint = request.routeOptions.url || request.url;
       const finishEndpoint = apiMetrics.recordEndpointRequest(endpoint, request.method);
       request.finishEndpoint = finishEndpoint;
killedBy: metricsMiddleware Tests preHandler - Request Initialization should fallback to url when routeOptions.url not available
statusReason: Cannot read properties of undefined (reading 'url')

[Survived] ConditionalExpression
src/middleware/metricsMiddleware.ts:26:24
       request.finishRequest = finishRequest;
 
       // Track endpoint-specific metrics
-      const endpoint = request.routeOptions?.url || request.url;
+      const endpoint = true;
       const finishEndpoint = apiMetrics.recordEndpointRequest(endpoint, request.method);
       request.finishEndpoint = finishEndpoint;

[Survived] ConditionalExpression
src/middleware/metricsMiddleware.ts:39:11
       const finishEndpoint = request.finishEndpoint;
       const correlationId = request.correlationId;
 
-      if (finishRequest) {
+      if (false) {
         finishRequest(reply.statusCode);
       }

[Survived] ConditionalExpression
src/middleware/metricsMiddleware.ts:39:11
       const finishEndpoint = request.finishEndpoint;
       const correlationId = request.correlationId;
 
-      if (finishRequest) {
+      if (true) {
         finishRequest(reply.statusCode);
       }

[Survived] BlockStatement
src/middleware/metricsMiddleware.ts:43:27
         finishRequest(reply.statusCode);
       }
 
-      if (finishEndpoint) {
-        const status = reply.statusCode >= 400 ? "error" : "success";
-        finishEndpoint(status);
-      }
+      if (finishEndpoint) {}
 
       // Record response size

[Survived] ConditionalExpression
src/middleware/metricsMiddleware.ts:43:11
         finishRequest(reply.statusCode);
       }
 
-      if (finishEndpoint) {
+      if (true) {
         const status = reply.statusCode >= 400 ? "error" : "success";
         finishEndpoint(status);

[Survived] EqualityOperator
src/middleware/metricsMiddleware.ts:44:24
       }
 
       if (finishEndpoint) {
-        const status = reply.statusCode >= 400 ? "error" : "success";
+        const status = reply.statusCode > 400 ? "error" : "success";
         finishEndpoint(status);
       }

[Survived] ConditionalExpression
src/middleware/metricsMiddleware.ts:44:24
       }
 
       if (finishEndpoint) {
-        const status = reply.statusCode >= 400 ? "error" : "success";
+        const status = true ? "error" : "success";
         finishEndpoint(status);
       }

[Survived] ConditionalExpression
src/middleware/metricsMiddleware.ts:49:24
       }
 
       // Record response size
-      const endpoint = request.routeOptions?.url || request.url;
+      const endpoint = true;
       const statusClass = Math.floor(reply.statusCode / 100) + "xx";
       const responseLength = reply.getHeader("content-length");

[Survived] OptionalChaining
src/middleware/metricsMiddleware.ts:49:24
       }
 
       // Record response size
-      const endpoint = request.routeOptions?.url || request.url;
+      const endpoint = request.routeOptions.url || request.url;
       const statusClass = Math.floor(reply.statusCode / 100) + "xx";
       const responseLength = reply.getHeader("content-length");

[Survived] ArithmeticOperator
src/middleware/metricsMiddleware.ts:50:38
 
       // Record response size
       const endpoint = request.routeOptions?.url || request.url;
-      const statusClass = Math.floor(reply.statusCode / 100) + "xx";
+      const statusClass = Math.floor(reply.statusCode * 100) + "xx";
       const responseLength = reply.getHeader("content-length");
       if (responseLength) {

[Survived] StringLiteral
src/middleware/metricsMiddleware.ts:50:64
 
       // Record response size
       const endpoint = request.routeOptions?.url || request.url;
-      const statusClass = Math.floor(reply.statusCode / 100) + "xx";
+      const statusClass = Math.floor(reply.statusCode / 100) + "";
       const responseLength = reply.getHeader("content-length");
       if (responseLength) {

[Killed] ConditionalExpression
src/middleware/metricsMiddleware.ts:52:11
       const endpoint = request.routeOptions?.url || request.url;
       const statusClass = Math.floor(reply.statusCode / 100) + "xx";
       const responseLength = reply.getHeader("content-length");
-      if (responseLength) {
+      if (true) {
         apiMetrics.metrics.responseSize.observe(
           { endpoint, status_class: statusClass },
killedBy: metricsMiddleware Tests onResponse - Success Cases should complete request tracking with 200 status
statusReason: Cannot read properties of undefined (reading 'toString')

[Survived] ConditionalExpression
src/middleware/metricsMiddleware.ts:52:11
       const endpoint = request.routeOptions?.url || request.url;
       const statusClass = Math.floor(reply.statusCode / 100) + "xx";
       const responseLength = reply.getHeader("content-length");
-      if (responseLength) {
+      if (false) {
         apiMetrics.metrics.responseSize.observe(
           { endpoint, status_class: statusClass },

[Survived] ObjectLiteral
src/middleware/metricsMiddleware.ts:54:11
       const responseLength = reply.getHeader("content-length");
       if (responseLength) {
         apiMetrics.metrics.responseSize.observe(
-          { endpoint, status_class: statusClass },
+          {},
           parseInt(responseLength.toString())
         );

[Survived] EqualityOperator
src/middleware/metricsMiddleware.ts:60:11
       }
 
       // Record errors by endpoint
-      if (reply.statusCode >= 400) {
+      if (reply.statusCode < 400) {
         const errorCategory = reply.statusCode >= 500 ? "server_error" : "client_error";
         apiMetrics.metrics.errorsByEndpoint.inc({

[Survived] ConditionalExpression
src/middleware/metricsMiddleware.ts:60:11
       }
 
       // Record errors by endpoint
-      if (reply.statusCode >= 400) {
+      if (true) {
         const errorCategory = reply.statusCode >= 500 ? "server_error" : "client_error";
         apiMetrics.metrics.errorsByEndpoint.inc({

[Survived] EqualityOperator
src/middleware/metricsMiddleware.ts:61:31
 
       // Record errors by endpoint
       if (reply.statusCode >= 400) {
-        const errorCategory = reply.statusCode >= 500 ? "server_error" : "client_error";
+        const errorCategory = reply.statusCode < 500 ? "server_error" : "client_error";
         apiMetrics.metrics.errorsByEndpoint.inc({
           endpoint,

[Survived] ConditionalExpression
src/middleware/metricsMiddleware.ts:61:31
 
       // Record errors by endpoint
       if (reply.statusCode >= 400) {
-        const errorCategory = reply.statusCode >= 500 ? "server_error" : "client_error";
+        const errorCategory = true ? "server_error" : "client_error";
         apiMetrics.metrics.errorsByEndpoint.inc({
           endpoint,

[Killed] ConditionalExpression
src/middleware/metricsMiddleware.ts:70:11
       }
 
       // Clean up correlation ID
-      if (correlationId) {
+      if (false) {
         apiMetrics.removeCorrelationId(request.id);
       }
killedBy: metricsMiddleware Tests onResponse - Success Cases should clean up correlation ID after response
statusReason: expected 'b8079db6-dfe6-4141-8eaa-3fc2f68d7ea9' to be undefined // Object.is equality

[Killed] BlockStatement
src/middleware/metricsMiddleware.ts:70:26
       }
 
       // Clean up correlation ID
-      if (correlationId) {
-        apiMetrics.removeCorrelationId(request.id);
-      }
+      if (correlationId) {}
 
       done();
killedBy: metricsMiddleware Tests onResponse - Success Cases should clean up correlation ID after response
statusReason: expected 'd408126c-86a9-4425-98fb-3e61c14f7daf' to be undefined // Object.is equality

[Killed] BlockStatement
src/middleware/metricsMiddleware.ts:83:10
       reply: FastifyReply,
       error: Error,
       done: HookHandlerDoneFunction
-    ) => {
-      const endpoint = request.routeOptions?.url || request.url;
-      const correlationId = request.correlationId;
-
-      // Record error by type
-      apiMetrics.recordError("api", error.name || "UnknownError", true);
-
-      // Record error by endpoint
-      const statusCode = reply.statusCode >= 400 ? reply.statusCode : 500;
-      const errorCategory = statusCode >= 500 ? "server_error" : "client_error";
-
-      apiMetrics.metrics.errorsByEndpoint.inc({
-        endpoint,
-        status_code: statusCode.toString(),
-        error_category: errorCategory,
-      });
-
-      // Add correlation ID to error context for logging
-      if (correlationId) {
-        (error as ErrorWithCorrelation).correlationId = correlationId;
-      }
-
-      done();
-    },
+    ) => {},
   };
 }
killedBy: metricsMiddleware Tests onError - Error Handling should attach correlation ID to error
statusReason: expected undefined to be '13c74d90-766b-432a-9fd6-6dedc336d04b' // Object.is equality

[Survived] ConditionalExpression
src/middleware/metricsMiddleware.ts:84:24
       error: Error,
       done: HookHandlerDoneFunction
     ) => {
-      const endpoint = request.routeOptions?.url || request.url;
+      const endpoint = true;
       const correlationId = request.correlationId;
 

[Survived] ConditionalExpression
src/middleware/metricsMiddleware.ts:84:24
       error: Error,
       done: HookHandlerDoneFunction
     ) => {
-      const endpoint = request.routeOptions?.url || request.url;
+      const endpoint = false;
       const correlationId = request.correlationId;
 

[Survived] ConditionalExpression
src/middleware/metricsMiddleware.ts:88:37
       const correlationId = request.correlationId;
 
       // Record error by type
-      apiMetrics.recordError("api", error.name || "UnknownError", true);
+      apiMetrics.recordError("api", true, true);
 
       // Record error by endpoint

[Survived] ConditionalExpression
src/middleware/metricsMiddleware.ts:88:37
       const correlationId = request.correlationId;
 
       // Record error by type
-      apiMetrics.recordError("api", error.name || "UnknownError", true);
+      apiMetrics.recordError("api", false, true);
 
       // Record error by endpoint

[Survived] ConditionalExpression
src/middleware/metricsMiddleware.ts:91:26
       apiMetrics.recordError("api", error.name || "UnknownError", true);
 
       // Record error by endpoint
-      const statusCode = reply.statusCode >= 400 ? reply.statusCode : 500;
+      const statusCode = true ? reply.statusCode : 500;
       const errorCategory = statusCode >= 500 ? "server_error" : "client_error";
 

[Survived] EqualityOperator
src/middleware/metricsMiddleware.ts:91:26
       apiMetrics.recordError("api", error.name || "UnknownError", true);
 
       // Record error by endpoint
-      const statusCode = reply.statusCode >= 400 ? reply.statusCode : 500;
+      const statusCode = reply.statusCode > 400 ? reply.statusCode : 500;
       const errorCategory = statusCode >= 500 ? "server_error" : "client_error";
 

[Survived] EqualityOperator
src/middleware/metricsMiddleware.ts:92:29
 
       // Record error by endpoint
       const statusCode = reply.statusCode >= 400 ? reply.statusCode : 500;
-      const errorCategory = statusCode >= 500 ? "server_error" : "client_error";
+      const errorCategory = statusCode < 500 ? "server_error" : "client_error";
 
       apiMetrics.metrics.errorsByEndpoint.inc({

[Survived] ConditionalExpression
src/middleware/metricsMiddleware.ts:92:29
 
       // Record error by endpoint
       const statusCode = reply.statusCode >= 400 ? reply.statusCode : 500;
-      const errorCategory = statusCode >= 500 ? "server_error" : "client_error";
+      const errorCategory = false ? "server_error" : "client_error";
 
       apiMetrics.metrics.errorsByEndpoint.inc({

[Survived] ObjectLiteral
src/middleware/metricsMiddleware.ts:94:47
       const statusCode = reply.statusCode >= 400 ? reply.statusCode : 500;
       const errorCategory = statusCode >= 500 ? "server_error" : "client_error";
 
-      apiMetrics.metrics.errorsByEndpoint.inc({
-        endpoint,
-        status_code: statusCode.toString(),
-        error_category: errorCategory,
-      });
+      apiMetrics.metrics.errorsByEndpoint.inc({});
 
       // Add correlation ID to error context for logging

[Killed] BlockStatement
src/middleware/metricsMiddleware.ts:101:26
       });
 
       // Add correlation ID to error context for logging
-      if (correlationId) {
-        (error as ErrorWithCorrelation).correlationId = correlationId;
-      }
+      if (correlationId) {}
 
       done();
killedBy: metricsMiddleware Tests onError - Error Handling should attach correlation ID to error
statusReason: expected undefined to be '0e955958-a5ea-4bcd-9ce0-4f4374d86777' // Object.is equality

[Killed] ConditionalExpression
src/middleware/metricsMiddleware.ts:101:11
       });
 
       // Add correlation ID to error context for logging
-      if (correlationId) {
+      if (false) {
         (error as ErrorWithCorrelation).correlationId = correlationId;
       }
killedBy: metricsMiddleware Tests onError - Error Handling should attach correlation ID to error
statusReason: expected undefined to be '12dc7b98-a885-4003-9471-b53d21e187d0' // Object.is equality

[Killed] BlockStatement
src/middleware/metricsMiddleware.ts:111:66
 }
 
 // Helper to extract clean route from request
-export function getRoutePattern(request: FastifyRequest): string {
-  return request.routeOptions?.url || request.url?.split("?")[0] || "unknown";
-}
+export function getRoutePattern(request: FastifyRequest): string {}
 
 // Helper to record business logic metrics
killedBy: metricsMiddleware Tests getRoutePattern - Route Extraction should extract route from routeOptions.url
statusReason: expected undefined to be '/api/posts/:id' // Object.is equality

[Killed] OptionalChaining
src/middleware/metricsMiddleware.ts:112:10
 
 // Helper to extract clean route from request
 export function getRoutePattern(request: FastifyRequest): string {
-  return request.routeOptions?.url || request.url?.split("?")[0] || "unknown";
+  return request.routeOptions.url || request.url?.split("?")[0] || "unknown";
 }
 
killedBy: metricsMiddleware Tests getRoutePattern - Route Extraction should fallback to url when routeOptions not available
statusReason: Cannot read properties of undefined (reading 'url')

[Killed] LogicalOperator
src/middleware/metricsMiddleware.ts:112:10
 
 // Helper to extract clean route from request
 export function getRoutePattern(request: FastifyRequest): string {
-  return request.routeOptions?.url || request.url?.split("?")[0] || "unknown";
+  return (request.routeOptions?.url || request.url?.split("?")[0]) && "unknown";
 }
 
killedBy: metricsMiddleware Tests getRoutePattern - Route Extraction should extract route from routeOptions.url
statusReason: expected 'unknown' to be '/api/posts/:id' // Object.is equality

[Killed] BlockStatement
src/middleware/metricsMiddleware.ts:120:3
   apiMetrics: ApiMetrics,
   operation: string,
   labels: Record<string, string> = {}
-) {
-  switch (operation) {
-    case "post_created":
-      apiMetrics.metrics.postsCreated.inc(labels);
-      break;
-    case "post_published":
-      apiMetrics.metrics.postsPublished.inc(labels);
-      break;
-    case "media_uploaded":
-      apiMetrics.metrics.mediaUploads.inc(labels);
-      break;
-    case "thread_created":
-      apiMetrics.metrics.threadsCreated.inc(labels);
-      break;
-    case "tweet_created":
-      apiMetrics.metrics.tweetsCreated.inc(labels);
-      break;
-    case "preview_requested":
-      apiMetrics.metrics.previewRequests.inc(labels);
-      break;
-  }
-}
+) {}
 
killedBy: metricsMiddleware Tests recordBusinessMetric - Business Operations should record post_created metric
statusReason: expected false to be truthy

[Killed] ConditionalExpression
src/middleware/metricsMiddleware.ts:122:5
   labels: Record<string, string> = {}
 ) {
   switch (operation) {
-    case "post_created":
-      apiMetrics.metrics.postsCreated.inc(labels);
-      break;
+    case "post_created":
     case "post_published":
       apiMetrics.metrics.postsPublished.inc(labels);
killedBy: metricsMiddleware Tests recordBusinessMetric - Business Operations should record post_created metric
statusReason: Added label "project_id" is not included in initial labelset: [ 'channel_id', 'scheduled' ]

[Killed] ConditionalExpression
src/middleware/metricsMiddleware.ts:125:5
     case "post_created":
       apiMetrics.metrics.postsCreated.inc(labels);
       break;
-    case "post_published":
-      apiMetrics.metrics.postsPublished.inc(labels);
-      break;
+    case "post_published":
     case "media_uploaded":
       apiMetrics.metrics.mediaUploads.inc(labels);
killedBy: metricsMiddleware Tests recordBusinessMetric - Business Operations should record post_published metric
statusReason: Added label "channel_id" is not included in initial labelset: [ 'media_type', 'status' ]

[Killed] StringLiteral
src/middleware/metricsMiddleware.ts:125:10
     case "post_created":
       apiMetrics.metrics.postsCreated.inc(labels);
       break;
-    case "post_published":
+    case "":
       apiMetrics.metrics.postsPublished.inc(labels);
       break;
killedBy: metricsMiddleware Tests recordBusinessMetric - Business Operations should record post_published metric
statusReason: expected false to be truthy

[Killed] ConditionalExpression
src/middleware/metricsMiddleware.ts:128:5
     case "post_published":
       apiMetrics.metrics.postsPublished.inc(labels);
       break;
-    case "media_uploaded":
-      apiMetrics.metrics.mediaUploads.inc(labels);
-      break;
+    case "media_uploaded":
     case "thread_created":
       apiMetrics.metrics.threadsCreated.inc(labels);
killedBy: metricsMiddleware Tests recordBusinessMetric - Business Operations should record media_uploaded metric
statusReason: Added label "media_type" is not included in initial labelset: [ 'strategy', 'post_id' ]

[Killed] StringLiteral
src/middleware/metricsMiddleware.ts:128:10
     case "post_published":
       apiMetrics.metrics.postsPublished.inc(labels);
       break;
-    case "media_uploaded":
+    case "":
       apiMetrics.metrics.mediaUploads.inc(labels);
       break;
killedBy: metricsMiddleware Tests recordBusinessMetric - Business Operations should record media_uploaded metric
statusReason: expected false to be truthy

[Killed] ConditionalExpression
src/middleware/metricsMiddleware.ts:131:5
     case "media_uploaded":
       apiMetrics.metrics.mediaUploads.inc(labels);
       break;
-    case "thread_created":
-      apiMetrics.metrics.threadsCreated.inc(labels);
-      break;
+    case "thread_created":
     case "tweet_created":
       apiMetrics.metrics.tweetsCreated.inc(labels);
killedBy: metricsMiddleware Tests recordBusinessMetric - Business Operations should record thread_created metric
statusReason: Added label "strategy" is not included in initial labelset: [ 'thread_id' ]

[Killed] ConditionalExpression
src/middleware/metricsMiddleware.ts:134:5
     case "thread_created":
       apiMetrics.metrics.threadsCreated.inc(labels);
       break;
-    case "tweet_created":
-      apiMetrics.metrics.tweetsCreated.inc(labels);
-      break;
+    case "tweet_created":
     case "preview_requested":
       apiMetrics.metrics.previewRequests.inc(labels);
killedBy: metricsMiddleware Tests recordBusinessMetric - Business Operations should record tweet_created metric
statusReason: Added label "thread_id" is not included in initial labelset: [ 'provider', 'content_type' ]

[Killed] ConditionalExpression
src/middleware/metricsMiddleware.ts:137:5
     case "tweet_created":
       apiMetrics.metrics.tweetsCreated.inc(labels);
       break;
-    case "preview_requested":
-      apiMetrics.metrics.previewRequests.inc(labels);
-      break;
+    case "preview_requested":
   }
 }
killedBy: metricsMiddleware Tests recordBusinessMetric - Business Operations should record preview_requested metric
statusReason: expected false to be truthy
