[NoCoverage] BlockStatement
src/application/brand-voice/DeleteBrandVoiceUseCase.ts:22:84
    * @method execute
    * @description Deletes the brand voice for the given account. No-op if none exists.
    */
-  async execute(input: DeleteBrandVoiceInput): Promise<Result<void, UseCaseError>> {
-    if (!input.accountId) {
-      return err(new UseCaseError("accountId is required", USE_CASE_ERRORS.VALIDATION_FAILED));
-    }
-
-    await this.repository.deleteByAccountId(input.accountId);
-    return ok(undefined);
-  }
+  async execute(input: DeleteBrandVoiceInput): Promise<Result<void, UseCaseError>> {}
 }
 

[NoCoverage] ConditionalExpression
src/application/brand-voice/DeleteBrandVoiceUseCase.ts:23:9
    * @description Deletes the brand voice for the given account. No-op if none exists.
    */
   async execute(input: DeleteBrandVoiceInput): Promise<Result<void, UseCaseError>> {
-    if (!input.accountId) {
+    if (true) {
       return err(new UseCaseError("accountId is required", USE_CASE_ERRORS.VALIDATION_FAILED));
     }

[NoCoverage] ConditionalExpression
src/application/brand-voice/DeleteBrandVoiceUseCase.ts:23:9
    * @description Deletes the brand voice for the given account. No-op if none exists.
    */
   async execute(input: DeleteBrandVoiceInput): Promise<Result<void, UseCaseError>> {
-    if (!input.accountId) {
+    if (false) {
       return err(new UseCaseError("accountId is required", USE_CASE_ERRORS.VALIDATION_FAILED));
     }
