[NoCoverage] BlockStatement
src/application/external-notifications/DeleteExternalNotificationUseCase.ts:31:94
    * @method execute
    * @description Removes the specified notification config.
    */
-  async execute(input: DeleteExternalNotificationInput): Promise<Result<void, UseCaseError>> {
-    const result = await this.repository.delete(input.id);
-
-    if (!result.ok) {
-      const statusCode =
-        result.error.code === "ENTITY_NOT_FOUND"
-          ? USE_CASE_ERRORS.NOT_FOUND
-          : USE_CASE_ERRORS.INTERNAL_ERROR;
-      return err(new UseCaseError(result.error.message, statusCode));
-    }
-
-    return ok(undefined);
-  }
+  async execute(input: DeleteExternalNotificationInput): Promise<Result<void, UseCaseError>> {}
 }
 

[NoCoverage] ConditionalExpression
src/application/external-notifications/DeleteExternalNotificationUseCase.ts:34:9
   async execute(input: DeleteExternalNotificationInput): Promise<Result<void, UseCaseError>> {
     const result = await this.repository.delete(input.id);
 
-    if (!result.ok) {
+    if (true) {
       const statusCode =
         result.error.code === "ENTITY_NOT_FOUND"

[NoCoverage] BooleanLiteral
src/application/external-notifications/DeleteExternalNotificationUseCase.ts:34:9
   async execute(input: DeleteExternalNotificationInput): Promise<Result<void, UseCaseError>> {
     const result = await this.repository.delete(input.id);
 
-    if (!result.ok) {
+    if (result.ok) {
       const statusCode =
         result.error.code === "ENTITY_NOT_FOUND"

[NoCoverage] EqualityOperator
src/application/external-notifications/DeleteExternalNotificationUseCase.ts:36:9
 
     if (!result.ok) {
       const statusCode =
-        result.error.code === "ENTITY_NOT_FOUND"
+        result.error.code !== "ENTITY_NOT_FOUND"
           ? USE_CASE_ERRORS.NOT_FOUND
           : USE_CASE_ERRORS.INTERNAL_ERROR;

[NoCoverage] ConditionalExpression
src/application/external-notifications/DeleteExternalNotificationUseCase.ts:36:9
 
     if (!result.ok) {
       const statusCode =
-        result.error.code === "ENTITY_NOT_FOUND"
+        false
           ? USE_CASE_ERRORS.NOT_FOUND
           : USE_CASE_ERRORS.INTERNAL_ERROR;
