[NoCoverage] BlockStatement
src/application/external-notifications/TestExternalNotificationUseCase.ts:41:27
   ): Promise<Result<{ delivered: boolean }, UseCaseError>> {
     const configResult = await this.repository.findById(input.id);
 
-    if (!configResult.ok) {
-      return err(new UseCaseError(configResult.error.message, USE_CASE_ERRORS.NOT_FOUND));
-    }
+    if (!configResult.ok) {}
 
     const config = configResult.value;

[NoCoverage] ConditionalExpression
src/application/external-notifications/TestExternalNotificationUseCase.ts:41:9
   ): Promise<Result<{ delivered: boolean }, UseCaseError>> {
     const configResult = await this.repository.findById(input.id);
 
-    if (!configResult.ok) {
+    if (false) {
       return err(new UseCaseError(configResult.error.message, USE_CASE_ERRORS.NOT_FOUND));
     }

[NoCoverage] BlockStatement
src/application/external-notifications/TestExternalNotificationUseCase.ts:59:25
       },
     });
 
-    if (!sendResult.ok) {
-      return err(
-        new UseCaseError(
-          `Test notification failed: ${sendResult.error.message}`,
-          USE_CASE_ERRORS.INTERNAL_ERROR
-        )
-      );
-    }
+    if (!sendResult.ok) {}
 
     return ok({ delivered: true });

[NoCoverage] BooleanLiteral
src/application/external-notifications/TestExternalNotificationUseCase.ts:59:9
       },
     });
 
-    if (!sendResult.ok) {
+    if (sendResult.ok) {
       return err(
         new UseCaseError(

[NoCoverage] StringLiteral
src/application/external-notifications/TestExternalNotificationUseCase.ts:62:11
     if (!sendResult.ok) {
       return err(
         new UseCaseError(
-          `Test notification failed: ${sendResult.error.message}`,
+          ``,
           USE_CASE_ERRORS.INTERNAL_ERROR
         )

[NoCoverage] BooleanLiteral
src/application/external-notifications/TestExternalNotificationUseCase.ts:68:28
       );
     }
 
-    return ok({ delivered: true });
+    return ok({ delivered: false });
   }
 }
