[NoCoverage] ConditionalExpression
src/application/first-comment/PublishFirstCommentUseCase.ts:69:9
     // Fetch the pending first comment
     const findResult = await this.firstCommentRepo.findByPostId(command.postId);
 
-    if (!findResult.ok) {
+    if (true) {
       return err(
         new UseCaseError(findResult.error.message, USE_CASE_ERRORS.INTERNAL_ERROR, findResult.error)

[NoCoverage] BooleanLiteral
src/application/first-comment/PublishFirstCommentUseCase.ts:76:9
     }
 
     const firstComment = findResult.value;
-    if (!firstComment) {
+    if (firstComment) {
       return err(
         new UseCaseError(

[NoCoverage] ConditionalExpression
src/application/first-comment/PublishFirstCommentUseCase.ts:76:9
     }
 
     const firstComment = findResult.value;
-    if (!firstComment) {
+    if (false) {
       return err(
         new UseCaseError(

[NoCoverage] StringLiteral
src/application/first-comment/PublishFirstCommentUseCase.ts:79:11
     if (!firstComment) {
       return err(
         new UseCaseError(
-          `No first comment found for post ${command.postId}`,
+          ``,
           USE_CASE_ERRORS.NOT_FOUND
         )

[NoCoverage] ConditionalExpression
src/application/first-comment/PublishFirstCommentUseCase.ts:85:9
       );
     }
 
-    if (firstComment.status === "PUBLISHED") {
+    if (false) {
       return err(
         new UseCaseError(

[NoCoverage] EqualityOperator
src/application/first-comment/PublishFirstCommentUseCase.ts:85:9
       );
     }
 
-    if (firstComment.status === "PUBLISHED") {
+    if (firstComment.status !== "PUBLISHED") {
       return err(
         new UseCaseError(

[NoCoverage] StringLiteral
src/application/first-comment/PublishFirstCommentUseCase.ts:88:11
     if (firstComment.status === "PUBLISHED") {
       return err(
         new UseCaseError(
-          `First comment for post ${command.postId} is already published`,
+          ``,
           USE_CASE_ERRORS.CONFLICT
         )

[NoCoverage] BlockStatement
src/application/first-comment/PublishFirstCommentUseCase.ts:97:26
     // Call the provider to post the reply
     const replyResult = await command.provider.postReply(command.platformPostId, firstComment.body);
 
-    if (!replyResult.ok) {
-      // Update status to FAILED with error message
-      await this.firstCommentRepo.updateStatus(command.postId, "FAILED", {
-        error: replyResult.error.message,
-      });
-
-      return err(
-        new UseCaseError(
-          `Failed to publish first comment: ${replyResult.error.message}`,
-          USE_CASE_ERRORS.INTERNAL_ERROR,
-          replyResult.error
-        )
-      );
-    }
+    if (!replyResult.ok) {}
 
     const providerCommentId = replyResult.value;

[NoCoverage] BooleanLiteral
src/application/first-comment/PublishFirstCommentUseCase.ts:97:9
     // Call the provider to post the reply
     const replyResult = await command.provider.postReply(command.platformPostId, firstComment.body);
 
-    if (!replyResult.ok) {
+    if (replyResult.ok) {
       // Update status to FAILED with error message
       await this.firstCommentRepo.updateStatus(command.postId, "FAILED", {

[NoCoverage] StringLiteral
src/application/first-comment/PublishFirstCommentUseCase.ts:122:15
     return ok({
       postId: command.postId,
       providerCommentId,
-      status: "PUBLISHED",
+      status: "",
     });
   }
