[NoCoverage] BlockStatement
src/application/first-comment/RemoveFirstCommentUseCase.ts:34:90
    * @param command - Contains the post ID
    * @returns Result<void> on success, UseCaseError on failure
    */
-  async execute(command: RemoveFirstCommentCommand): Promise<Result<void, UseCaseError>> {
-    const deleteResult = await this.firstCommentRepo.delete(command.postId);
-
-    if (!deleteResult.ok) {
-      return err(
-        new UseCaseError(
-          `First comment not found for post ${command.postId}`,
-          USE_CASE_ERRORS.NOT_FOUND,
-          deleteResult.error
-        )
-      );
-    }
-
-    return ok(undefined);
-  }
+  async execute(command: RemoveFirstCommentCommand): Promise<Result<void, UseCaseError>> {}
 }
 

[NoCoverage] BooleanLiteral
src/application/first-comment/RemoveFirstCommentUseCase.ts:37:9
   async execute(command: RemoveFirstCommentCommand): Promise<Result<void, UseCaseError>> {
     const deleteResult = await this.firstCommentRepo.delete(command.postId);
 
-    if (!deleteResult.ok) {
+    if (deleteResult.ok) {
       return err(
         new UseCaseError(

[NoCoverage] BlockStatement
src/application/first-comment/RemoveFirstCommentUseCase.ts:37:27
   async execute(command: RemoveFirstCommentCommand): Promise<Result<void, UseCaseError>> {
     const deleteResult = await this.firstCommentRepo.delete(command.postId);
 
-    if (!deleteResult.ok) {
-      return err(
-        new UseCaseError(
-          `First comment not found for post ${command.postId}`,
-          USE_CASE_ERRORS.NOT_FOUND,
-          deleteResult.error
-        )
-      );
-    }
+    if (!deleteResult.ok) {}
 
     return ok(undefined);
