[NoCoverage] BlockStatement
src/application/usage/IncrementUsageUseCase.ts:24:82
 export class IncrementUsageUseCase {
   constructor(private readonly repository: UsageMetricRepository) {}
 
-  async execute(input: IncrementUsageInput): Promise<Result<void, UseCaseError>> {
-    if (!input.accountId) {
-      return err(new UseCaseError("accountId is required", USE_CASE_ERRORS.VALIDATION_FAILED));
-    }
-
-    const now = new Date();
-    const year = now.getUTCFullYear();
-    const month = now.getUTCMonth() + 1; // 1-12
-
-    await this.repository.increment(input.accountId, year, month, input.field, input.delta ?? 1);
-    return ok(undefined);
-  }
+  async execute(input: IncrementUsageInput): Promise<Result<void, UseCaseError>> {}
 }
 

[NoCoverage] BooleanLiteral
src/application/usage/IncrementUsageUseCase.ts:25:9
   constructor(private readonly repository: UsageMetricRepository) {}
 
   async execute(input: IncrementUsageInput): Promise<Result<void, UseCaseError>> {
-    if (!input.accountId) {
+    if (input.accountId) {
       return err(new UseCaseError("accountId is required", USE_CASE_ERRORS.VALIDATION_FAILED));
     }

[NoCoverage] ConditionalExpression
src/application/usage/IncrementUsageUseCase.ts:25:9
   constructor(private readonly repository: UsageMetricRepository) {}
 
   async execute(input: IncrementUsageInput): Promise<Result<void, UseCaseError>> {
-    if (!input.accountId) {
+    if (true) {
       return err(new UseCaseError("accountId is required", USE_CASE_ERRORS.VALIDATION_FAILED));
     }

[NoCoverage] StringLiteral
src/application/usage/IncrementUsageUseCase.ts:26:35
 
   async execute(input: IncrementUsageInput): Promise<Result<void, UseCaseError>> {
     if (!input.accountId) {
-      return err(new UseCaseError("accountId is required", USE_CASE_ERRORS.VALIDATION_FAILED));
+      return err(new UseCaseError("", USE_CASE_ERRORS.VALIDATION_FAILED));
     }
 

[NoCoverage] ArithmeticOperator
src/application/usage/IncrementUsageUseCase.ts:31:19
 
     const now = new Date();
     const year = now.getUTCFullYear();
-    const month = now.getUTCMonth() + 1; // 1-12
+    const month = now.getUTCMonth() - 1; // 1-12
 
     await this.repository.increment(input.accountId, year, month, input.field, input.delta ?? 1);

[NoCoverage] LogicalOperator
src/application/usage/IncrementUsageUseCase.ts:33:80
     const year = now.getUTCFullYear();
     const month = now.getUTCMonth() + 1; // 1-12
 
-    await this.repository.increment(input.accountId, year, month, input.field, input.delta ?? 1);
+    await this.repository.increment(input.accountId, year, month, input.field, input.delta && 1);
     return ok(undefined);
   }
