[Killed] BlockStatement
src/application/brand-voice/UpsertBrandVoiceUseCase.ts:36:94
    * @method execute
    * @description Validates and upserts the brand voice. One brand voice per account (unique constraint).
    */
-  async execute(input: UpsertBrandVoiceInput): Promise<Result<BrandVoiceData, UseCaseError>> {
-    const validationError = this.validate(input);
-    if (validationError) {
-      return err(validationError);
-    }
-
-    const data = await this.repository.upsert({
-      accountId: input.accountId,
-      name: input.name.trim(),
-      systemPrompt: input.systemPrompt.trim(),
-      tone: input.tone ?? [],
-      examples: input.examples ?? [],
-      isActive: input.isActive ?? true,
-    });
-
-    return ok(data);
-  }
+  async execute(input: UpsertBrandVoiceInput): Promise<Result<BrandVoiceData, UseCaseError>> {}
 
   private validate(input: UpsertBrandVoiceInput): UseCaseError | null {
killedBy: UpsertBrandVoiceUseCase upserts brand voice with valid input
statusReason: Cannot read properties of undefined (reading 'ok')

[Killed] ConditionalExpression
src/application/brand-voice/UpsertBrandVoiceUseCase.ts:38:9
    */
   async execute(input: UpsertBrandVoiceInput): Promise<Result<BrandVoiceData, UseCaseError>> {
     const validationError = this.validate(input);
-    if (validationError) {
+    if (false) {
       return err(validationError);
     }
killedBy: UpsertBrandVoiceUseCase rejects empty accountId
statusReason: The expression evaluated to a falsy value:

  it("defaults examples to empty array", async () => {
    await uc.execute(makeInput());
    assert.deepEqual(repo.upsert.mock.calls[0]?.[0]?.examples, []);
  })

[Killed] BlockStatement
src/application/brand-voice/UpsertBrandVoiceUseCase.ts:38:26
    */
   async execute(input: UpsertBrandVoiceInput): Promise<Result<BrandVoiceData, UseCaseError>> {
     const validationError = this.validate(input);
-    if (validationError) {
-      return err(validationError);
-    }
+    if (validationError) {}
 
     const data = await this.repository.upsert({
killedBy: UpsertBrandVoiceUseCase rejects empty accountId
statusReason: The expression evaluated to a falsy value:

  it("defaults examples to empty array", async () => {
    await uc.execute(makeInput());
    assert.deepEqual(repo.upsert.mock.calls[0]?.[0]?.examples, []);
  })

[Killed] MethodExpression
src/application/brand-voice/UpsertBrandVoiceUseCase.ts:45:21
     const data = await this.repository.upsert({
       accountId: input.accountId,
       name: input.name.trim(),
-      systemPrompt: input.systemPrompt.trim(),
+      systemPrompt: input.systemPrompt,
       tone: input.tone ?? [],
       examples: input.examples ?? [],
killedBy: UpsertBrandVoiceUseCase trims name and systemPrompt
statusReason: Expected values to be strictly equal:
+ actual - expected

+ '  Prompt  '
- 'Prompt'

[Killed] LogicalOperator
src/application/brand-voice/UpsertBrandVoiceUseCase.ts:46:13
       accountId: input.accountId,
       name: input.name.trim(),
       systemPrompt: input.systemPrompt.trim(),
-      tone: input.tone ?? [],
+      tone: input.tone && [],
       examples: input.examples ?? [],
       isActive: input.isActive ?? true,
killedBy: UpsertBrandVoiceUseCase defaults tone to empty array
statusReason: Expected values to be strictly deep-equal:

undefined !== []

[Killed] ArrayDeclaration
src/application/brand-voice/UpsertBrandVoiceUseCase.ts:46:27
       accountId: input.accountId,
       name: input.name.trim(),
       systemPrompt: input.systemPrompt.trim(),
-      tone: input.tone ?? [],
+      tone: input.tone ?? ["Stryker was here"],
       examples: input.examples ?? [],
       isActive: input.isActive ?? true,
killedBy: UpsertBrandVoiceUseCase defaults tone to empty array
statusReason: Expected values to be strictly deep-equal:
+ actual - expected

+ [
+   'Stryker was here'
+ ]
- []

[Killed] LogicalOperator
src/application/brand-voice/UpsertBrandVoiceUseCase.ts:47:17
       name: input.name.trim(),
       systemPrompt: input.systemPrompt.trim(),
       tone: input.tone ?? [],
-      examples: input.examples ?? [],
+      examples: input.examples && [],
       isActive: input.isActive ?? true,
     });
killedBy: UpsertBrandVoiceUseCase defaults examples to empty array
statusReason: Expected values to be strictly deep-equal:

undefined !== []

[Killed] LogicalOperator
src/application/brand-voice/UpsertBrandVoiceUseCase.ts:48:17
       systemPrompt: input.systemPrompt.trim(),
       tone: input.tone ?? [],
       examples: input.examples ?? [],
-      isActive: input.isActive ?? true,
+      isActive: input.isActive && true,
     });
 
killedBy: UpsertBrandVoiceUseCase defaults isActive to true
statusReason: Expected values to be strictly equal:
+ actual - expected

+ undefined
- true

[Killed] BooleanLiteral
src/application/brand-voice/UpsertBrandVoiceUseCase.ts:48:35
       systemPrompt: input.systemPrompt.trim(),
       tone: input.tone ?? [],
       examples: input.examples ?? [],
-      isActive: input.isActive ?? true,
+      isActive: input.isActive ?? false,
     });
 
killedBy: UpsertBrandVoiceUseCase defaults isActive to true
statusReason: Expected values to be strictly equal:

false !== true

[Killed] BlockStatement
src/application/brand-voice/UpsertBrandVoiceUseCase.ts:54:71
     return ok(data);
   }
 
-  private validate(input: UpsertBrandVoiceInput): UseCaseError | null {
-    if (!input.accountId) {
-      return new UseCaseError("accountId is required", USE_CASE_ERRORS.VALIDATION_FAILED);
-    }
-    if (!input.name || input.name.trim().length === 0) {
-      return new UseCaseError("name is required", USE_CASE_ERRORS.VALIDATION_FAILED);
-    }
-    if (input.name.trim().length > UpsertBrandVoiceUseCase.MAX_NAME_LENGTH) {
-      return new UseCaseError(
-        `name must be at most ${UpsertBrandVoiceUseCase.MAX_NAME_LENGTH} characters`,
-        USE_CASE_ERRORS.VALIDATION_FAILED
-      );
-    }
-    if (!input.systemPrompt || input.systemPrompt.trim().length === 0) {
-      return new UseCaseError("systemPrompt is required", USE_CASE_ERRORS.VALIDATION_FAILED);
-    }
-    if (input.systemPrompt.trim().length > UpsertBrandVoiceUseCase.MAX_SYSTEM_PROMPT_LENGTH) {
-      return new UseCaseError(
-        `systemPrompt must be at most ${UpsertBrandVoiceUseCase.MAX_SYSTEM_PROMPT_LENGTH} characters`,
-        USE_CASE_ERRORS.VALIDATION_FAILED
-      );
-    }
-    return null;
-  }
+  private validate(input: UpsertBrandVoiceInput): UseCaseError | null {}
 }
 
killedBy: UpsertBrandVoiceUseCase rejects empty accountId
statusReason: The expression evaluated to a falsy value:

  it("defaults examples to empty array", async () => {
    await uc.execute(makeInput());
    assert.deepEqual(repo.upsert.mock.calls[0]?.[0]?.examples, []);
  })

[Killed] BlockStatement
src/application/brand-voice/UpsertBrandVoiceUseCase.ts:55:27
   }
 
   private validate(input: UpsertBrandVoiceInput): UseCaseError | null {
-    if (!input.accountId) {
-      return new UseCaseError("accountId is required", USE_CASE_ERRORS.VALIDATION_FAILED);
-    }
+    if (!input.accountId) {}
     if (!input.name || input.name.trim().length === 0) {
       return new UseCaseError("name is required", USE_CASE_ERRORS.VALIDATION_FAILED);
killedBy: UpsertBrandVoiceUseCase rejects empty accountId
statusReason: The expression evaluated to a falsy value:

  it("defaults examples to empty array", async () => {
    await uc.execute(makeInput());
    assert.deepEqual(repo.upsert.mock.calls[0]?.[0]?.examples, []);
  })

[Killed] BooleanLiteral
src/application/brand-voice/UpsertBrandVoiceUseCase.ts:55:9
   }
 
   private validate(input: UpsertBrandVoiceInput): UseCaseError | null {
-    if (!input.accountId) {
+    if (input.accountId) {
       return new UseCaseError("accountId is required", USE_CASE_ERRORS.VALIDATION_FAILED);
     }
killedBy: UpsertBrandVoiceUseCase upserts brand voice with valid input
statusReason: false == true

[Killed] ConditionalExpression
src/application/brand-voice/UpsertBrandVoiceUseCase.ts:58:9
     if (!input.accountId) {
       return new UseCaseError("accountId is required", USE_CASE_ERRORS.VALIDATION_FAILED);
     }
-    if (!input.name || input.name.trim().length === 0) {
+    if (false) {
       return new UseCaseError("name is required", USE_CASE_ERRORS.VALIDATION_FAILED);
     }
killedBy: UpsertBrandVoiceUseCase rejects empty name
statusReason: The expression evaluated to a falsy value:

  it("defaults isActive to true", async () => {
  await uc.execute(makeInput());
  assert.equal(repo.upsert.mock.calls[0]?.[0]?.isActive, true);
  })

[Killed] ConditionalExpression
src/application/brand-voice/UpsertBrandVoiceUseCase.ts:58:9
     if (!input.accountId) {
       return new UseCaseError("accountId is required", USE_CASE_ERRORS.VALIDATION_FAILED);
     }
-    if (!input.name || input.name.trim().length === 0) {
+    if (true) {
       return new UseCaseError("name is required", USE_CASE_ERRORS.VALIDATION_FAILED);
     }
killedBy: UpsertBrandVoiceUseCase upserts brand voice with valid input
statusReason: false == true

[Survived] StringLiteral
src/application/brand-voice/UpsertBrandVoiceUseCase.ts:59:31
       return new UseCaseError("accountId is required", USE_CASE_ERRORS.VALIDATION_FAILED);
     }
     if (!input.name || input.name.trim().length === 0) {
-      return new UseCaseError("name is required", USE_CASE_ERRORS.VALIDATION_FAILED);
+      return new UseCaseError("", USE_CASE_ERRORS.VALIDATION_FAILED);
     }
     if (input.name.trim().length > UpsertBrandVoiceUseCase.MAX_NAME_LENGTH) {

[Killed] EqualityOperator
src/application/brand-voice/UpsertBrandVoiceUseCase.ts:61:9
     if (!input.name || input.name.trim().length === 0) {
       return new UseCaseError("name is required", USE_CASE_ERRORS.VALIDATION_FAILED);
     }
-    if (input.name.trim().length > UpsertBrandVoiceUseCase.MAX_NAME_LENGTH) {
+    if (input.name.trim().length >= UpsertBrandVoiceUseCase.MAX_NAME_LENGTH) {
       return new UseCaseError(
         `name must be at most ${UpsertBrandVoiceUseCase.MAX_NAME_LENGTH} characters`,
killedBy: UpsertBrandVoiceUseCase accepts name of exactly 100 chars
statusReason: The expression evaluated to a falsy value:

  assert.deepEqual(repo.upsert.mock.calls[0]?.[0]?.tone, ["professional", "friendly"])

[Killed] ConditionalExpression
src/application/brand-voice/UpsertBrandVoiceUseCase.ts:61:9
     if (!input.name || input.name.trim().length === 0) {
       return new UseCaseError("name is required", USE_CASE_ERRORS.VALIDATION_FAILED);
     }
-    if (input.name.trim().length > UpsertBrandVoiceUseCase.MAX_NAME_LENGTH) {
+    if (true) {
       return new UseCaseError(
         `name must be at most ${UpsertBrandVoiceUseCase.MAX_NAME_LENGTH} characters`,
killedBy: UpsertBrandVoiceUseCase upserts brand voice with valid input
statusReason: false == true

[Survived] StringLiteral
src/application/brand-voice/UpsertBrandVoiceUseCase.ts:63:9
     }
     if (input.name.trim().length > UpsertBrandVoiceUseCase.MAX_NAME_LENGTH) {
       return new UseCaseError(
-        `name must be at most ${UpsertBrandVoiceUseCase.MAX_NAME_LENGTH} characters`,
+        ``,
         USE_CASE_ERRORS.VALIDATION_FAILED
       );

[Killed] BlockStatement
src/application/brand-voice/UpsertBrandVoiceUseCase.ts:67:72
         USE_CASE_ERRORS.VALIDATION_FAILED
       );
     }
-    if (!input.systemPrompt || input.systemPrompt.trim().length === 0) {
-      return new UseCaseError("systemPrompt is required", USE_CASE_ERRORS.VALIDATION_FAILED);
-    }
+    if (!input.systemPrompt || input.systemPrompt.trim().length === 0) {}
     if (input.systemPrompt.trim().length > UpsertBrandVoiceUseCase.MAX_SYSTEM_PROMPT_LENGTH) {
       return new UseCaseError(
killedBy: UpsertBrandVoiceUseCase rejects empty systemPrompt
statusReason: The expression evaluated to a falsy value:

  it("rejects empty accountId", async () => {
    assert.ok(!(await uc.execute(makeInput({ accountId: "" }))).ok);
  })

[Killed] BooleanLiteral
src/application/brand-voice/UpsertBrandVoiceUseCase.ts:67:9
         USE_CASE_ERRORS.VALIDATION_FAILED
       );
     }
-    if (!input.systemPrompt || input.systemPrompt.trim().length === 0) {
+    if (input.systemPrompt || input.systemPrompt.trim().length === 0) {
       return new UseCaseError("systemPrompt is required", USE_CASE_ERRORS.VALIDATION_FAILED);
     }
killedBy: UpsertBrandVoiceUseCase upserts brand voice with valid input
statusReason: false == true

[Killed] BlockStatement
src/application/brand-voice/UpsertBrandVoiceUseCase.ts:70:94
     if (!input.systemPrompt || input.systemPrompt.trim().length === 0) {
       return new UseCaseError("systemPrompt is required", USE_CASE_ERRORS.VALIDATION_FAILED);
     }
-    if (input.systemPrompt.trim().length > UpsertBrandVoiceUseCase.MAX_SYSTEM_PROMPT_LENGTH) {
-      return new UseCaseError(
-        `systemPrompt must be at most ${UpsertBrandVoiceUseCase.MAX_SYSTEM_PROMPT_LENGTH} characters`,
-        USE_CASE_ERRORS.VALIDATION_FAILED
-      );
-    }
+    if (input.systemPrompt.trim().length > UpsertBrandVoiceUseCase.MAX_SYSTEM_PROMPT_LENGTH) {}
     return null;
   }
killedBy: UpsertBrandVoiceUseCase rejects systemPrompt > 2000 chars
statusReason: The expression evaluated to a falsy value:

  it("rejects empty name", async () => {
   assert.ok(!(await uc.execute(makeInput({ name: "" }))).ok);
  })

[Killed] EqualityOperator
src/application/brand-voice/UpsertBrandVoiceUseCase.ts:70:9
     if (!input.systemPrompt || input.systemPrompt.trim().length === 0) {
       return new UseCaseError("systemPrompt is required", USE_CASE_ERRORS.VALIDATION_FAILED);
     }
-    if (input.systemPrompt.trim().length > UpsertBrandVoiceUseCase.MAX_SYSTEM_PROMPT_LENGTH) {
+    if (input.systemPrompt.trim().length <= UpsertBrandVoiceUseCase.MAX_SYSTEM_PROMPT_LENGTH) {
       return new UseCaseError(
         `systemPrompt must be at most ${UpsertBrandVoiceUseCase.MAX_SYSTEM_PROMPT_LENGTH} characters`,
killedBy: UpsertBrandVoiceUseCase upserts brand voice with valid input
statusReason: false == true
