[Killed] ConditionalExpression
src/application/usage/GetUsageUseCase.ts:27:9
   constructor(private readonly repository: UsageMetricRepository) {}
 
   async execute(input: GetUsageInput): Promise<Result<UsageDto, UseCaseError>> {
-    if (!input.accountId) {
+    if (false) {
       return err(new UseCaseError("accountId is required", USE_CASE_ERRORS.VALIDATION_FAILED));
     }
killedBy: GetUsageUseCase rejects empty accountId
statusReason: The expression evaluated to a falsy value:

  assert.equal(r.value.postsPublished, 42)

[Killed] ConditionalExpression
src/application/usage/GetUsageUseCase.ts:27:9
   constructor(private readonly repository: UsageMetricRepository) {}
 
   async execute(input: GetUsageInput): Promise<Result<UsageDto, UseCaseError>> {
-    if (!input.accountId) {
+    if (true) {
       return err(new UseCaseError("accountId is required", USE_CASE_ERRORS.VALIDATION_FAILED));
     }
killedBy: GetUsageUseCase returns zeroed metrics when no data exists
statusReason: false == true

[Killed] EqualityOperator
src/application/usage/GetUsageUseCase.ts:30:9
     if (!input.accountId) {
       return err(new UseCaseError("accountId is required", USE_CASE_ERRORS.VALIDATION_FAILED));
     }
-    if (input.month < 1 || input.month > 12) {
+    if (input.month >= 1 || input.month > 12) {
       return err(
         new UseCaseError("month must be between 1 and 12", USE_CASE_ERRORS.VALIDATION_FAILED)
killedBy: GetUsageUseCase returns zeroed metrics when no data exists
statusReason: false == true

[Killed] EqualityOperator
src/application/usage/GetUsageUseCase.ts:30:9
     if (!input.accountId) {
       return err(new UseCaseError("accountId is required", USE_CASE_ERRORS.VALIDATION_FAILED));
     }
-    if (input.month < 1 || input.month > 12) {
+    if (input.month <= 1 || input.month > 12) {
       return err(
         new UseCaseError("month must be between 1 and 12", USE_CASE_ERRORS.VALIDATION_FAILED)
killedBy: GetUsageUseCase accepts month 1 (boundary)
statusReason: The expression evaluated to a falsy value:

  uc.execute({ accountId: "a", year: 2025, month: 0 })

[Killed] ConditionalExpression
src/application/usage/GetUsageUseCase.ts:38:9
 
     const row = await this.repository.findByPeriod(input.accountId, input.year, input.month);
 
-    if (!row) {
+    if (false) {
       return ok({
         accountId: input.accountId,
killedBy: GetUsageUseCase returns zeroed metrics when no data exists
statusReason: Cannot read properties of null (reading 'accountId')

[Killed] ConditionalExpression
src/application/usage/GetUsageUseCase.ts:38:9
 
     const row = await this.repository.findByPeriod(input.accountId, input.year, input.month);
 
-    if (!row) {
+    if (true) {
       return ok({
         accountId: input.accountId,
killedBy: GetUsageUseCase returns stored metrics when data exists
statusReason: Expected values to be strictly equal:

0 !== 42
